{
  "contract_number": "47QRAA21D004A",
  "contractor_id": 8241,
  "price_list_id": 277,
  "labor_categories": [
    {
      "contract_number": "47QRAA21D004A",
      "labor_category": "Sr. Principal/Principal II",
      "hourly_rate": 468.23,
      "source_sheet_name": "Price List",
      "source_row_number": 4,
      "raw_data": {
        "vendor_name": "MERCER (US) LLC",
        "unique_catalog_item_id": "102.0",
        "title": "Sr. Principal/Principal II",
        "description": "This position is for a recognized master in consulting, who leads and manages relationships and engagements with clients.  Responsible for client management, client engagement and satisfaction, new and expanded business development, contract negotiation and scope, and project and team management. Oversees multiple project managers, ensuring the team is within budget, on time, and producing work consistent with the scope of work and ensuring communication with the client, project team, and senior client leader.  Manages the relationship with key client stakeholders and oversees client engagements. Identifies and secures resources and specialists ensuring work is leveraged to the right skill and career level, and provides team members with the opportunity to develop skills and expertise. Is a recognized policy expert in various facets, including health and retirement benefits, regulatory policies, human resource policy and procedures, and/or the financial and operational aspects of government programs. Considers the implication of policy, law, political changes, etc. on client programs. Develops intellectual capital.  Leads or participates in the development of tools or processes that can be leveraged for multiple clients.",
        "sin": "541611.0",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "468.23",
        "gsa_price_with_iff__a_": "479.93",
        "gsa_price_with_iff__b_": "491.93",
        "gsa_price_with_iff__c_": "504.23",
        "gsa_price_with_iff__d_": "516.84",
        "gsa_price_with_iff__e_": "529.76",
        "minimum_education": "Masters",
        "minimum_years_of_education": "10.0",
        "education_and_experience_substitution": "Bachelors Degree with 13 years of experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Client Management,Leads Manages Relationships",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Masters",
      "years_experience": "Bachelors Degree with 13 years of experience",
      "security_clearance": "No",
      "contractor_id": 8241,
      "price_list_id": 277
    },
    {
      "contract_number": "47QRAA21D004A",
      "labor_category": "Principal/Principal I",
      "hourly_rate": 379.84,
      "source_sheet_name": "Price List",
      "source_row_number": 5,
      "raw_data": {
        "vendor_name": "MERCER (US) LLC",
        "unique_catalog_item_id": "103.0",
        "title": "Principal/Principal I",
        "description": "This position is for a recognized subject matter expert in consulting, who manages large projects or processes. Works as the lead client manager to one or more projects. Consults with the senior client manager to initiate a project once it is sold.  Manages the client, project, budget, resources, timelines, scope and expectations as well as working closely with the peer position at the client. Presents on project results to clients and client-related stakeholders; manages the day-to-day relationship with the key members of the client team. Identifies and secures resources and specialists ensuring work is leveraged to the right skill and career level, and provides team members with the opportunity to develop skills and expertise. Collaborates with client team and project team to ensure high-quality deliverables are developed and submitted to the client on time and on budget. Utilizes knowledge of client’s challenges to identify sales opportunities.",
        "sin": "541611.0",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "379.84",
        "gsa_price_with_iff__a_": "389.34",
        "gsa_price_with_iff__b_": "399.07",
        "gsa_price_with_iff__c_": "409.05",
        "gsa_price_with_iff__d_": "419.27",
        "gsa_price_with_iff__e_": "429.75",
        "minimum_education": "Masters",
        "minimum_years_of_education": "7.0",
        "education_and_experience_substitution": "Bachelors Degree with 10 years of experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Manages,Project,Budget,Resources,Timeline",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Masters",
      "years_experience": "Bachelors Degree with 10 years of experience",
      "security_clearance": "No",
      "contractor_id": 8241,
      "price_list_id": 277
    },
    {
      "contract_number": "47QRAA21D004A",
      "labor_category": "Senior Associate II",
      "hourly_rate": 321.25,
      "source_sheet_name": "Price List",
      "source_row_number": 6,
      "raw_data": {
        "vendor_name": "MERCER (US) LLC",
        "unique_catalog_item_id": "104.0",
        "title": "Senior Associate II",
        "description": "This position is for a seasoned professional individual contributor in consulting, who works independently with minimal supervision to lead the project management on all client consulting initiatives.  A key part of this role is also to be the expert for projects and proposals.  Mentors junior staff while overseeing their work. Works to initiate the project and support day-to-day management of one engagement. Leads meetings with the client and clearly defines the scope, timelines, and deliverable of the project. Ensures the team is within budget, on time, and producing work consistent with the scope of work. Manages the quality and timeliness of project deliverables and ensures they are client ready. Continues regular communication with client and proposes essential project documents, including the budget and work plans. Provides updates, and advises clients on interim analyses. Provides insight and expertise on project strategy, timeline, and deliverables based on project scope. Works directly with the client to clarify project scope and serves as a resource for client to answer project-related questions. Participates on multiple projects with multiple clients simultaneously. Identifies project/data anomalies in deliverables. Understands the reasons and impacts of said anomalies in order to communicate them to senior staff or project lead(s). Works with peers who are specialists to coordinate their contribution throughout the project. Keeps self current on relevant technical policies, such as health and benefits policies, federal rules and regulations, etc. Considers the implication of policy, law, political changes, etc. on client programs. Develops intellectual capital. Leads or participates in the development of tools or processes that can be leveraged for multiple clients.",
        "sin": "541611.0",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "321.25",
        "gsa_price_with_iff__a_": "329.28",
        "gsa_price_with_iff__b_": "337.51",
        "gsa_price_with_iff__c_": "345.95",
        "gsa_price_with_iff__d_": "354.6",
        "gsa_price_with_iff__e_": "363.46",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Manages,Support Day-to-Day,Mentors",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 8241,
      "price_list_id": 277
    },
    {
      "contract_number": "47QRAA21D004A",
      "labor_category": "Associate II",
      "hourly_rate": 277.2,
      "source_sheet_name": "Price List",
      "source_row_number": 7,
      "raw_data": {
        "vendor_name": "MERCER (US) LLC",
        "unique_catalog_item_id": "105.0",
        "title": "Associate II",
        "description": "This position is for an established and productive professional individual contributor in consulting, who works independently with minimal supervision. The purpose of this job is to leverage qualifications and consulting expertise to provide technical reviews of data and deliverables, and support the management of tasks and deadlines.  This role is a key resource for the client. Participates and takes detailed notes in initial meetings with client or project lead to define the scope of the project. Supports project scoping. Provides updates on data requests, and advises lead client manager on interim analyses. Creates client call agendas, and coordinates calls with client and project team.  Actively participates in client calls and meetings. Assists in project work flow coordination and the coordination of data requests. Assists in developing essential project documents, including the budget and work plans. Completes technical reviews and analyses relating to project scope and supports project plan timeline. Shares knowledge with junior staff and acts as a resource to answer questions and problem-solve. Leads junior resources in defining and understanding project scope and overall goals/deliverables. Supports development of technical deliverables.  Maintains peer review responsibility to ensure accuracy and quality of deliverables. Assists in technical reviews and supports project plan timeline. Leads technical development/review activities, ensuring accuracy and high-quality.",
        "sin": "541611.0",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "277.2",
        "gsa_price_with_iff__a_": "284.13",
        "gsa_price_with_iff__b_": "291.24",
        "gsa_price_with_iff__c_": "298.52",
        "gsa_price_with_iff__d_": "305.98",
        "gsa_price_with_iff__e_": "313.63",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Deliver,Manage,Updates,Coordinates",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 8241,
      "price_list_id": 277
    },
    {
      "contract_number": "47QRAA21D004A",
      "labor_category": "Senior Analyst",
      "hourly_rate": 158.95,
      "source_sheet_name": "Price List",
      "source_row_number": 8,
      "raw_data": {
        "vendor_name": "MERCER (US) LLC",
        "unique_catalog_item_id": "106.0",
        "title": "Senior Analyst",
        "description": "This position is for a developing professional individual contributor in consulting, who works under moderate supervision. Coordinates with project lead on deliverables, documentation, data, and other relevant information to support overall project scope. Coordinates data requests. Assists in the coordination of timeliness and project deliverables. Subject matter expert in Word, Excel and/or Access. Completes supplemental ad hoc analyses as needed. Assists in development of project documentation, including technical write ups, certification, and executive summaries.",
        "sin": "541611.0",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "158.95",
        "gsa_price_with_iff__a_": "162.92",
        "gsa_price_with_iff__b_": "167",
        "gsa_price_with_iff__c_": "171.17",
        "gsa_price_with_iff__d_": "175.45",
        "gsa_price_with_iff__e_": "179.84",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "2.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Coordinates,Support,Assists,Excel,Access",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 8241,
      "price_list_id": 277
    },
    {
      "contract_number": "47QRAA21D004A",
      "labor_category": "Analyst",
      "hourly_rate": 119.5,
      "source_sheet_name": "Price List",
      "source_row_number": 9,
      "raw_data": {
        "vendor_name": "MERCER (US) LLC",
        "unique_catalog_item_id": "107.0",
        "title": "Analyst",
        "description": "This position is for an entry-level professional individual contributor in consulting, who works under close supervision.  The purpose of this job is to support consultants with research and technical analyses. Ensures project team is regularly updated on projects assigned.  Includes taking meeting notes and following up with action items and assignments. Becomes familiar with models, techniques, processes, and methodologies specific to scope of project. Assists the project team in updating, analyzing, and validating data in Word, Excel and/or Access. Validates data to ensure accuracy. Utilizes intranet resources; participates in training courses and online learning; engages in on-the-job training through more experienced colleagues to gain an understanding client goals and objectives. Demonstrates superior analytical skills, strong command of excel, excellent interpersonal skills, strong oral and written communication skills.",
        "sin": "541611.0",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "119.5",
        "gsa_price_with_iff__a_": "122.49",
        "gsa_price_with_iff__b_": "125.55",
        "gsa_price_with_iff__c_": "128.69",
        "gsa_price_with_iff__d_": "131.91",
        "gsa_price_with_iff__e_": "135.2",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "1.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Analyses,Data,Support,Validates",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 8241,
      "price_list_id": 277
    }
  ],
  "parsed_at": "2025-11-06T11:50:15.824559"
}