{
  "contract_number": "47QRAA22D00E3",
  "contractor_id": 8182,
  "price_list_id": 71,
  "labor_categories": [
    {
      "contract_number": "47QRAA22D00E3",
      "labor_category": "Business Analyst- Executive/ Strategy",
      "hourly_rate": 353.03,
      "source_sheet_name": "Price List",
      "source_row_number": 8,
      "raw_data": {
        "vendor_name": "MCKINSEY & COMPANY, INC. WASHINGTON D.C.",
        "unique_catalog_item_id": "6.0",
        "title": "Business Analyst- Executive/ Strategy",
        "description": "Engages on urgent, highly complex, and/or high-impact opportunities for senior Government executive leaders, with an ability to deliver rapidly and to 'get it right the first time.’ Performs daily team activities under the direction of the project lead to complete project-specific tasks and presentations. Leads an engagement workstream independently (e.g., interviewing clients, leading client teams, building financial and analytical models, supporting strategy and organizational development, analyzing and designing IT systems, creating and delivering presentations, and working with subject experts to develop perspectives and insights). Brings experience and best practices from private sector clients. Creates outputs and content for deliverables for regular client updates as well as intermediate and final deliverables. Strong proficiency in Excel, Word, PowerPoint, and relevant analytics/statistical packages (e.g., Tableau). Serves clients by gathering and analyzing information. Supports development, formulation, and testing of hypotheses and analytical models.",
        "sin": "541611, 541990, 541612HC, 54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "353.03",
        "gsa_price_with_iff__d_": "353.03",
        "gsa_price_with_iff__e_": "367.15",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "1.0",
        "education_and_experience_substitution": "Once the minimum education requirements have been met, additional degrees count as the following additional equivalent years of experience: Additional Bachelor’s – 2 years; Master’s – 3 years.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "execuive,strategy,models,insights,analytical",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Once the minimum education requirements have been met, additional degrees count as the following additional equivalent years of experience: Additional Bachelor’s – 2 years; Master’s – 3 years.",
      "security_clearance": "No",
      "contractor_id": 8182,
      "price_list_id": 71
    },
    {
      "contract_number": "47QRAA22D00E3",
      "labor_category": "Associate - Data Science",
      "hourly_rate": 499.94,
      "source_sheet_name": "Price List",
      "source_row_number": 9,
      "raw_data": {
        "vendor_name": "MCKINSEY & COMPANY, INC. WASHINGTON D.C.",
        "unique_catalog_item_id": "7.0",
        "title": "Associate - Data Science",
        "description": "Engages on urgent, highly complex, and/or high-impact opportunities for senior Government leaders, with an ability to deliver rapidly and to 'get it right the first time.’ Leads a more complex engagement workstream independently (e.g., working on complex and extremely varied data in a multi-disciplinary environment with specialists in machine learning, engineering and design) as part of the engagement team. Works effectively with cross-functional and complex teams and engages with senior-level stakeholders, both internal and external, to design the best solution and move people and organizations to act. Brings experience, best practices, knowledge, and expertise from private sector clients. Creates outputs and content for deliverables for regular client updates as well as intermediate and final deliverables. Strong proficiency in Excel, Word, PowerPoint, and relevant analytics/statistical packages (e.g., Tableau). Develops data science products and solutions and writes highly optimized code. Builds analytical models that are part of an end-to-end digital platform, including creating solutions from the initial minimum viable product (MVP) stage to a robust and mature product. Identifies key hypotheses, metrics, and insights, and defines and drives the analytical scope and method for projects, including formulating and shaping the models. Derives key insights and communicates complex analytics concepts in a clear and concise manner to clients. Strong proficiency in relevant programming languages (e.g., R).",
        "sin": "541611, 541990, 54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "499.94",
        "gsa_price_with_iff__d_": "499.94",
        "gsa_price_with_iff__e_": "519.94",
        "minimum_education": "Masters",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "A Terminal degree (e.g., JD, MD, PhD) or three years of additional experience may be substituted for the Master’s Degree. If a Terminal degree is used to meet the educational  requirement, it would also count as two additional years of experience. Once the minimum education requirements have been met, additional degrees count as the following equivalent years of experience: Additional Bachelor’s – 2 years; Additional Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "data science,solutions,analytics concepts",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Masters",
      "years_experience": "A Terminal degree (e.g., JD, MD, PhD) or three years of additional experience may be substituted for the Master’s Degree. If a Terminal degree is used to meet the educational  requirement, it would also count as two additional years of experience. Once the minimum education requirements have been met, additional degrees count as the following equivalent years of experience: Additional Bachelor’s – 2 years; Additional Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
      "security_clearance": "No",
      "contractor_id": 8182,
      "price_list_id": 71
    },
    {
      "contract_number": "47QRAA22D00E3",
      "labor_category": "Business Analyst - Data Science",
      "hourly_rate": 340.51,
      "source_sheet_name": "Price List",
      "source_row_number": 10,
      "raw_data": {
        "vendor_name": "MCKINSEY & COMPANY, INC. WASHINGTON D.C.",
        "unique_catalog_item_id": "8.0",
        "title": "Business Analyst - Data Science",
        "description": "Engages on urgent, highly complex, and/or high-impact opportunities for senior Government leaders, with an ability to deliver rapidly and to 'get it right the first time.’ Performs daily team activities under the direction of the project lead to complete project-specific tasks and presentations. Leads an engagement workstream independently, (e.g., works on various modelling assignments to derive actionable business insights and solve complex business problems in multi-disciplinary environments (e.g., optimizing workflows, forecasting supply and demand, increasing financial transparency, reducing supply chain risks, and improving workforce outcomes). Brings experience and best practices from private sector clients. Creates outputs and content for deliverables for regular client updates as well as intermediate and final deliverables. Strong proficiency in Excel, Word, PowerPoint, and relevant analytics/statistical packages (e.g., Tableau). Demonstrates depth of knowledge in using advanced statistics, optimization techniques and machine learning algorithms. Strong proficiency in relevant programming languages (e.g., R).",
        "sin": "541611, 541990, 54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "340.51",
        "gsa_price_with_iff__d_": "340.51",
        "gsa_price_with_iff__e_": "354.13",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "Once the minimum education requirements have been met, additional degrees count as the following additional equivalent years of experience: Additional Bachelor’s – 2 years; Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "optimization,modelling,business insights,statistics",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Once the minimum education requirements have been met, additional degrees count as the following additional equivalent years of experience: Additional Bachelor’s – 2 years; Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
      "security_clearance": "No",
      "contractor_id": 8182,
      "price_list_id": 71
    },
    {
      "contract_number": "47QRAA22D00E3",
      "labor_category": "Associate - Human-Centered Design",
      "hourly_rate": 499.94,
      "source_sheet_name": "Price List",
      "source_row_number": 11,
      "raw_data": {
        "vendor_name": "MCKINSEY & COMPANY, INC. WASHINGTON D.C.",
        "unique_catalog_item_id": "9.0",
        "title": "Associate - Human-Centered Design",
        "description": "Engages on urgent, highly complex, and/or high-impact opportunities for senior Government leaders, with an ability to deliver rapidly and to 'get it right the first time.’ Leads a more complex engagement workstream independently, (e.g., drives all aspects of the design process, guiding other members of the design team). Works effectively with cross-functional and complex teams and engages with senior-level stakeholders, both internal and external, to design the best solution and move people and organizations to act. Brings experience, best practices, knowledge, and expertise from private sector clients. Creates outputs and content for deliverables for regular client updates as well as intermediate and final deliverables. Strong proficiency in Excel, Word, PowerPoint, and relevant analytics/statistical packages (e.g., Tableau). Responsible for key design deliverables across a variety of stages and client priorities, from research and insight generation to concept and delivery. Performs task analysis and defines the User Interface Design through information architecture, wireframes and user flows and validate it through usability testing, to lead usability testing sessions, consolidate findings and iteratively integrate into design solutions. Applies conceptual thinking to create desirable and feasible digital solutions across multiple platforms, smartly bringing together user needs, business goals, and technical realities. Utilizes industry design standards and best practices to define and implement design criteria. Applies user centered design methodologies to ensure recommendations are based on customer needs, prepares research and testing, produces personas, maps customer journeys, and develops service blueprints for complex products and services. Participates in workshops, concept sprints, and hackathons to inject design thinking tools and methodologies to produce tangible results in a rapid and iterative way. Works closely with development teams to ensure that design specifications are implemented and communicates the product’s vision to clients. Effectively communicates research findings, conceptual ideas, detailed design, and design rationale both verbally and visually. Uses a variety of methods to convey ideas and concepts (e.g., storyboards, wireframes, prototypes, etc.). Uses narration and storytelling skills to bring product ideas to life, and constructs quick interactive prototypes with initial, low fidelity visual designs that illustrates user experience/user interface (UX/UI) design that present a realistic feel of the intended experience.",
        "sin": "541611, 541990",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "499.94",
        "gsa_price_with_iff__d_": "499.94",
        "gsa_price_with_iff__e_": "519.94",
        "minimum_education": "Masters",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "A Terminal degree (e.g., JD, MD, PhD) or three years of additional experience may be substituted for the Master’s Degree. If a Terminal degree is used to meet the educational requirement, it would also count as two additional years of experience. Once the minimum education requirements have been met, additional degrees count as the following equivalent years of experience: Additional Bachelor’s – 2 years; Additional Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "user experience,design,research,concepts",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Masters",
      "years_experience": "A Terminal degree (e.g., JD, MD, PhD) or three years of additional experience may be substituted for the Master’s Degree. If a Terminal degree is used to meet the educational requirement, it would also count as two additional years of experience. Once the minimum education requirements have been met, additional degrees count as the following equivalent years of experience: Additional Bachelor’s – 2 years; Additional Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
      "security_clearance": "No",
      "contractor_id": 8182,
      "price_list_id": 71
    },
    {
      "contract_number": "47QRAA22D00E3",
      "labor_category": "Business Analyst - Human-Centered Design",
      "hourly_rate": 340.51,
      "source_sheet_name": "Price List",
      "source_row_number": 12,
      "raw_data": {
        "vendor_name": "MCKINSEY & COMPANY, INC. WASHINGTON D.C.",
        "unique_catalog_item_id": "10.0",
        "title": "Business Analyst - Human-Centered Design",
        "description": "Engages on urgent, highly complex, and/or high-impact opportunities for senior Government leaders, with an ability to deliver rapidly and to 'get it right the first time.’ Performs daily team activities under the direction of the project lead to complete project-specific tasks and presentations. Leads an engagement workstream independently, (e.g., addresses all aspects of the design process to deliver inventive, durable, and thoughtful solutions from concept to launch). Brings experience and best practices from private sector clients. Creates outputs and content for deliverables for regular client updates as well as intermediate and final deliverables. Strong proficiency in Excel, Word, PowerPoint, and relevant analytics/statistical packages (e.g., Tableau). Creates desirable and feasible digital solutions across multiple platforms, bringing together user needs, business goals, and technical realities. Utilizes industry design standards and best practices to define and implement design criteria. Applies user centered design methodologies to ensure recommendations are based on customer needs. Prepares research and testing, produces personas, maps customer journeys, and develops service blueprints for complex products and services. Communicates research findings, conceptual ideas, detailed design, and design rationale both verbally and visually. Uses a variety of methods to convey ideas and concepts (e.g., storyboards, wireframes, prototypes). Constructs quick interactive prototypes with initial, low fidelity visual designs that illustrate the UX/UI design to present a realistic feel of the intended experience. Performs task analysis and defines the UI Design through information architecture, wireframes, and user flows, and validates it through usability testing, consolidated findings, and integration into design solutions.",
        "sin": "541611, 541990",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "340.51",
        "gsa_price_with_iff__d_": "340.51",
        "gsa_price_with_iff__e_": "354.13",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "Once the minimum education requirements have been met, additional degrees count as the following additional equivalent years of experience: Additional Bachelor’s – 2 years; Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "design,digital solutions,analytics,research",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Once the minimum education requirements have been met, additional degrees count as the following additional equivalent years of experience: Additional Bachelor’s – 2 years; Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
      "security_clearance": "No",
      "contractor_id": 8182,
      "price_list_id": 71
    },
    {
      "contract_number": "47QRAA22D00E3",
      "labor_category": "Associate - Implementation",
      "hourly_rate": 483.99,
      "source_sheet_name": "Price List",
      "source_row_number": 13,
      "raw_data": {
        "vendor_name": "MCKINSEY & COMPANY, INC. WASHINGTON D.C.",
        "unique_catalog_item_id": "11.0",
        "title": "Associate - Implementation",
        "description": "Engages on urgent, highly complex, and/or high-impact opportunities for senior Government leaders, with an ability to deliver rapidly and to 'get it right the first time.’ Leads a more complex engagement workstream independently (e.g., tracking metrics, handling complex analyses, and preparing communications to report back to client and internal leadership, developing practical recommendations, and contributing to team discussions on implications of analysis, identifying implementation challenges, supporting system analysis, design and implementation).Works effectively with cross-functional and complex teams and engages with senior-level stakeholders, both internal and external, to design the best solution and move people and organizations to act. Brings experience, best practices, knowledge, and expertise from private sector clients. Creates outputs and content for deliverables for regular client updates as well as intermediate and final deliverables. Strong proficiency in Excel, Word, PowerPoint, and relevant analytics/statistical packages (e.g., Tableau). Serves clients by working alongside the client’s staff and assisting with implementation tasks, including facilitating working sessions with front-line and supervisors, connecting with and motivating the client team, or developing skills of client team members when appropriate, principally through coaching. Develops practical recommendations and contributes to team discussions on implications of analysis, and identifies implementation challenges. Builds clients’ capabilities, systems, and processes to ensure they capture and sustain the anticipated results.",
        "sin": "541611, 541990, 541612HC, 54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "483.99",
        "gsa_price_with_iff__d_": "483.99",
        "gsa_price_with_iff__e_": "503.35",
        "minimum_education": "Masters",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "A Terminal degree (e.g., JD, MD, PhD) or three years of additional experience may be substituted for the Master’s Degree. If a Terminal degree is used to meet the educational requirement, it would also count as two additional years of experience. Once the minimum education requirements have been met, additional degrees count as the following equivalent years of experience: Additional Bachelor’s – 2 years; Additional Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "implementation,coaching,capabilities,systems,processes",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Masters",
      "years_experience": "A Terminal degree (e.g., JD, MD, PhD) or three years of additional experience may be substituted for the Master’s Degree. If a Terminal degree is used to meet the educational requirement, it would also count as two additional years of experience. Once the minimum education requirements have been met, additional degrees count as the following equivalent years of experience: Additional Bachelor’s – 2 years; Additional Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
      "security_clearance": "No",
      "contractor_id": 8182,
      "price_list_id": 71
    },
    {
      "contract_number": "47QRAA22D00E3",
      "labor_category": "Business Analyst - Implementation",
      "hourly_rate": 330.24,
      "source_sheet_name": "Price List",
      "source_row_number": 14,
      "raw_data": {
        "vendor_name": "MCKINSEY & COMPANY, INC. WASHINGTON D.C.",
        "unique_catalog_item_id": "12.0",
        "title": "Business Analyst - Implementation",
        "description": "Engages on urgent, highly complex, and/or high-impact opportunities for senior Government leaders, with an ability to deliver rapidly and to 'get it right the first time.’ Performs daily team activities under the direction of the project lead to complete project-specific tasks and presentations. Leads an engagement workstream, (e.g., tracking metrics, handling complex analyses, and preparing communications to report back to client and engagement leadership, supporting system analysis, design and implementation). Brings experience and best practices from private sector clients. Creates outputs and content for deliverables for regular client updates as well as intermediate and final deliverables. Strong proficiency in Excel, Word, PowerPoint, and relevant analytics/statistical packages (e.g., Tableau). Serves clients by helping them to build capabilities in delivery and execution. Provides coaching, guidance, and mentorship to clients to ensure the clients are able to deliver and sustain the full benefits of the recommended change in the client organization. Supports development of practical recommendations and contributes to team discussions on implications of analysis and assists in identification of implementation challenges.",
        "sin": "541611, 541990, 541612HC, 54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "330.24",
        "gsa_price_with_iff__d_": "330.24",
        "gsa_price_with_iff__e_": "343.45",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "Once the minimum education requirements have been met, additional degrees count as the following additional equivalent years of experience: Additional Bachelor’s – 2 years; Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "implementation,coaching,analyses,metrics,communications",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Once the minimum education requirements have been met, additional degrees count as the following additional equivalent years of experience: Additional Bachelor’s – 2 years; Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
      "security_clearance": "No",
      "contractor_id": 8182,
      "price_list_id": 71
    },
    {
      "contract_number": "47QRAA22D00E3",
      "labor_category": "Media Designer",
      "hourly_rate": 190.18,
      "source_sheet_name": "Price List",
      "source_row_number": 15,
      "raw_data": {
        "vendor_name": "MCKINSEY & COMPANY, INC. WASHINGTON D.C.",
        "unique_catalog_item_id": "13.0",
        "title": "Media Designer",
        "description": "Advises engagement teams on any media use and impact-related issues, including graphic design, illustration, and video. Assists engagement teams to create/develop concepts for the specific client communication situations and acts as a creative thought partner in designing communications materials. Provides creative guidance and shares knowledge of media, design, and communications best practices with engagement teams. Possesses a deep knowledge in chosen media or service specialization. Actively stays in touch with the latest design trends and applies all knowledge to design projects for engagement teams.",
        "sin": "541611, 541990, 541612HC, 54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "190.18",
        "gsa_price_with_iff__d_": "190.18",
        "gsa_price_with_iff__e_": "197.79",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "An Associate’s degree plus 2 additional years of experience may be substituted for the Bachelor’s degree. Once the minimum education requirements have been met, additional degrees count as the following additional equivalent years of experience: Additional Bachelor’s – 2 years; Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "media,communication,design,video,creative",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "An Associate’s degree plus 2 additional years of experience may be substituted for the Bachelor’s degree. Once the minimum education requirements have been met, additional degrees count as the following additional equivalent years of experience: Additional Bachelor’s – 2 years; Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
      "security_clearance": "No",
      "contractor_id": 8182,
      "price_list_id": 71
    },
    {
      "contract_number": "47QRAA22D00E3",
      "labor_category": "Graphics Project Manager",
      "hourly_rate": 178.8,
      "source_sheet_name": "Price List",
      "source_row_number": 16,
      "raw_data": {
        "vendor_name": "MCKINSEY & COMPANY, INC. WASHINGTON D.C.",
        "unique_catalog_item_id": "14.0",
        "title": "Graphics Project Manager",
        "description": "Ensures graphics and design projects receive optimal presentation solutions. Navigates services, products, and capacity with a specific need on graphics and design projects, including identifying milestones, understanding priority and timelines, and managing stakeholders. Plans and organizes work to support engagement teams. Creates clear documentation to keep track of the engagement’s major meetings, milestones, etc. Sets up action plans, if needed, and follows up with production processes to ensure quality and delivery needs are met. Manages stakeholders, including connecting across graphics teams and assisting with capacity planning and task allocation.",
        "sin": "541611, 541990, 541612HC, 54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "178.8",
        "gsa_price_with_iff__d_": "178.8",
        "gsa_price_with_iff__e_": "185.95",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "An Associate’s degree plus 2 additional years of experience may be substituted for the Bachelor’s degree. Once the minimum education requirements have been met, additional degrees count as the following additional equivalent years of experience: Additional Bachelor’s – 2 years; Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "graphics,design,presentation",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "An Associate’s degree plus 2 additional years of experience may be substituted for the Bachelor’s degree. Once the minimum education requirements have been met, additional degrees count as the following additional equivalent years of experience: Additional Bachelor’s – 2 years; Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
      "security_clearance": "No",
      "contractor_id": 8182,
      "price_list_id": 71
    },
    {
      "contract_number": "47QRAA22D00E3",
      "labor_category": "Business Presentation Designer",
      "hourly_rate": 168.55,
      "source_sheet_name": "Price List",
      "source_row_number": 17,
      "raw_data": {
        "vendor_name": "MCKINSEY & COMPANY, INC. WASHINGTON D.C.",
        "unique_catalog_item_id": "15.0",
        "title": "Business Presentation Designer",
        "description": "Formats and makes consistent high-impact PowerPoint presentations to support consulting teams. Works in accordance with visualization principles and ensures graphical accuracy and format consistency. Creates and makes edits to existing exhibits and charts in presentations. Possesses proficient skills in visual improvement, message optimization, imagery usage, and layout alternatives. Possesses knowledge of branding, sub brands, and variety of visual identities in PowerPoint.",
        "sin": "541611, 541990, 541612HC, 54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "168.55",
        "gsa_price_with_iff__d_": "168.55",
        "gsa_price_with_iff__e_": "175.29",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "2.0",
        "education_and_experience_substitution": "An Associate’s degree plus 2 additional years of experience may be substituted for the Bachelor’s degree. Once the minimum education requirements have been met, additional degrees count as the following additional equivalent years of experience: Additional Bachelor’s – 2 years; Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "visualization,message optimization,branding,presentation",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "An Associate’s degree plus 2 additional years of experience may be substituted for the Bachelor’s degree. Once the minimum education requirements have been met, additional degrees count as the following additional equivalent years of experience: Additional Bachelor’s – 2 years; Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
      "security_clearance": "No",
      "contractor_id": 8182,
      "price_list_id": 71
    },
    {
      "contract_number": "47QRAA22D00E3",
      "labor_category": "Capabilities & Insights Expert",
      "hourly_rate": 381.5,
      "source_sheet_name": "Price List",
      "source_row_number": 18,
      "raw_data": {
        "vendor_name": "MCKINSEY & COMPANY, INC. WASHINGTON D.C.",
        "unique_catalog_item_id": "16.0",
        "title": "Capabilities & Insights Expert",
        "description": "Serves engagement teams and clients by partnering with consultants and client teams to meet their complex needs, using deep content/capability knowledge, problem solving abilities, project management skills, advanced techniques and vast internal and external networks. Contributes expert knowledge and insights in solving complex client/engagement problems joining, or leading, workstreams. May manage small groups of analysts in client or knowledge/asset/capability development projects. Possesses deep expertise in industry/functional content, a thorough grasp of McKinsey’s consulting approach, and expert knowledge of relevant analytics/statistical tools and approaches, including as relevant to the project: Wide-ranging knowledge of one or more industry or function, expert navigator of firm knowledge ecosystem; knowledge of relevant analytics/statistical tools and approaches; Excellent analytical/quantitative skills, problem-solving capabilities, effective prioritization; Superior communications skills with ability to influence a range of stakeholders; and Highly proficient skills in Excel, Word, PowerPoint, and relevant analytics/statistical packages.",
        "sin": "541611, 541990, 541612HC, 54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "381.5",
        "gsa_price_with_iff__d_": "381.5",
        "gsa_price_with_iff__e_": "396.76",
        "minimum_education": "Masters",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "A Terminal degree (e.g., JD, MD, PhD) or three years of additional experience may be substituted for the Master’s Degree. If a Terminal degree is used to meet the educational  requirement, it would also count as two additional years of experience. Once the minimum education requirements have been met, additional degrees count as the following equivalent years of experience: Additional Bachelor’s – 2 years; Additional Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "analytics,statistical,insights,capability,communication",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Masters",
      "years_experience": "A Terminal degree (e.g., JD, MD, PhD) or three years of additional experience may be substituted for the Master’s Degree. If a Terminal degree is used to meet the educational  requirement, it would also count as two additional years of experience. Once the minimum education requirements have been met, additional degrees count as the following equivalent years of experience: Additional Bachelor’s – 2 years; Additional Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
      "security_clearance": "No",
      "contractor_id": 8182,
      "price_list_id": 71
    },
    {
      "contract_number": "47QRAA22D00E3",
      "labor_category": "Capabilities & Insights Analyst",
      "hourly_rate": 286.98,
      "source_sheet_name": "Price List",
      "source_row_number": 19,
      "raw_data": {
        "vendor_name": "MCKINSEY & COMPANY, INC. WASHINGTON D.C.",
        "unique_catalog_item_id": "17.0",
        "title": "Capabilities & Insights Analyst",
        "description": "Serves engagement teams by providing guidance on leveraging assets, tools, capabilities and insights. As relevant to role: Engages with teams to scope and prioritize project/request and business needs, for low-to-medium complexity situations with minimal guidance; helps teams to navigate the domain’s capabilities; Clarifies scope objectives to determine most relevant, cost-effective capabilities, insights, data, and solutions to deploy; Deploys standard tools, assets, solutions (with minimal guidance); interprets standard outputs of models/solutions to generate insights for engagement teams related to client business need; Conducts medium-complexity analyses and calculations. Prepares accurate, well-developed documents, databases, models, solution outputs, and ready to-use charts to present findings. Possesses business knowledge; basic understanding of research techniques, information sources, and statistical analysis/analytic techniques as relevant to role, including: Strong analytical/quantitative skills, solid problem-solving capabilities, effective prioritization; Intellectual curiosity, good team player, strong written/verbal communications skills; Strong proficiency in Excel, Word, PowerPoint, and relevant analytics/statistical packages.",
        "sin": "541611, 541990, 541612HC, 54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "286.98",
        "gsa_price_with_iff__d_": "286.98",
        "gsa_price_with_iff__e_": "298.46",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "1.0",
        "education_and_experience_substitution": "Once the minimum education requirements have been met, additional degrees count as the following additional equivalent years of experience: Additional Bachelor’s – 2 years; Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "insights,capabilities,data,solutions,analytics",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Once the minimum education requirements have been met, additional degrees count as the following additional equivalent years of experience: Additional Bachelor’s – 2 years; Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
      "security_clearance": "No",
      "contractor_id": 8182,
      "price_list_id": 71
    },
    {
      "contract_number": "47QRAA22D00E3",
      "labor_category": "Engagement Team Assistant",
      "hourly_rate": 125.27,
      "source_sheet_name": "Price List",
      "source_row_number": 20,
      "raw_data": {
        "vendor_name": "MCKINSEY & COMPANY, INC. WASHINGTON D.C.",
        "unique_catalog_item_id": "18.0",
        "title": "Engagement Team Assistant",
        "description": "Provides proactive, timely, and high-quality operations support to the strategy consulting team. Supports day-to-day operations of the team, including meeting, event, and conference planning; coordinating logistics and technology for Video Conferences of all sizes; arranging travel; organizing and maintaining client files within authorized systems. May interface directly with clients to ensure smooth collaboration. Provides additional related support as needed (e.g., overseeing production of materials to support large client meetings or workshops).",
        "sin": "541611, 541990, 541612HC, 54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "125.27",
        "gsa_price_with_iff__d_": "125.27",
        "gsa_price_with_iff__e_": "130.28",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "1.0",
        "education_and_experience_substitution": "An Associate’s degree plus 2 additional years of experience may be substituted for the Bachelor’s degree. Once the minimum education requirements have been met, additional degrees count as the following additional equivalent years of experience: Additional Bachelor’s – 2 years; Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "coordinating,organizing,collaboration,operations,support",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "An Associate’s degree plus 2 additional years of experience may be substituted for the Bachelor’s degree. Once the minimum education requirements have been met, additional degrees count as the following additional equivalent years of experience: Additional Bachelor’s – 2 years; Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
      "security_clearance": "No",
      "contractor_id": 8182,
      "price_list_id": 71
    },
    {
      "contract_number": "47QRAA22D00E3",
      "labor_category": "Partner- Executive/ Strategy",
      "hourly_rate": 114.86,
      "source_sheet_name": "Price List",
      "source_row_number": 22,
      "raw_data": {
        "vendor_name": "MCKINSEY & COMPANY, INC. WASHINGTON D.C.",
        "unique_catalog_item_id": "20.0",
        "title": "Partner- Executive/ Strategy",
        "description": "Engages on urgent, highly complex, and/or high-impact opportunities for senior Government leaders, with an ability to deliver rapidly and to 'get it right the first time.’ Responsible for ensuring the impact of the overall engagement including the content and the delivery. Possesses expert knowledge in one or more industries across commercial and public sector (e.g., information technology, healthcare and pharmaceuticals, commerce, finance, etc.) and/or functional practice areas (e.g., strategy, risk management, operations, organization, digital analytics, system analysis and design, supply chain management, etc.). Convenes firm resources and assets as necessary to meet task requirements, respond to emerging client needs, and ensure lasting client impact. Leads problem solving and solution development with the engagement team and clients and ensures that task requirements are considered and addressed. Serves as a senior client executive counselor, advising and coaching client organization leaders throughout the engagement. Brings commercial C-level best practices (Fortune 500) perspectives to senior Government counseling relationships. Maintains programmatic oversight and serves as issue resolution authority on contractual, management, and operational issues. Maintains budgetary and financial control. Acts as the change leader for the client and team, responsible for spurring a radical re-think of the operating model and conventional wisdom.",
        "sin": "541611, 541990, 541612HC, 54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "114.86",
        "gsa_price_with_iff__d_": "114.86",
        "gsa_price_with_iff__e_": "119.45",
        "minimum_education": "Masters",
        "minimum_years_of_education": "10.0",
        "education_and_experience_substitution": "A Terminal degree (e.g., JD, MD, PhD) or three years of additional experience may be substituted for the Master’s Degree. If a Terminal degree is used to meet the educational  requirement, it would also count as two additional years of experience. Once the minimum education requirements have been met, additional degrees count as the following equivalent years of experience: Additional Bachelor’s – 2 years; Additional Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "executive,strategy,advising,coaching,expert",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Masters",
      "years_experience": "A Terminal degree (e.g., JD, MD, PhD) or three years of additional experience may be substituted for the Master’s Degree. If a Terminal degree is used to meet the educational  requirement, it would also count as two additional years of experience. Once the minimum education requirements have been met, additional degrees count as the following equivalent years of experience: Additional Bachelor’s – 2 years; Additional Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
      "security_clearance": "No",
      "contractor_id": 8182,
      "price_list_id": 71
    },
    {
      "contract_number": "47QRAA22D00E3",
      "labor_category": "Business Analyst- Executive/ Strategy",
      "hourly_rate": 353.03,
      "source_sheet_name": "Price List",
      "source_row_number": 26,
      "raw_data": {
        "vendor_name": "MCKINSEY & COMPANY, INC. WASHINGTON D.C.",
        "unique_catalog_item_id": "24.0",
        "title": "Business Analyst- Executive/ Strategy",
        "description": "Engages on urgent, highly complex, and/or high-impact opportunities for senior Government executive leaders, with an ability to deliver rapidly and to 'get it right the first time.’ Performs daily team activities under the direction of the project lead to complete project-specific tasks and presentations. Leads an engagement workstream independently (e.g., interviewing clients, leading client teams, building financial and analytical models, supporting strategy and organizational development, analyzing and designing IT systems, creating and delivering presentations, and working with subject experts to develop perspectives and insights). Brings experience and best practices from private sector clients. Creates outputs and content for deliverables for regular client updates as well as intermediate and final deliverables. Strong proficiency in Excel, Word, PowerPoint, and relevant analytics/statistical packages (e.g., Tableau). Serves clients by gathering and analyzing information. Supports development, formulation, and testing of hypotheses and analytical models.",
        "sin": "541611, 541990, 541612HC, 54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "353.03",
        "gsa_price_with_iff__d_": "353.03",
        "gsa_price_with_iff__e_": "367.15",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "1.0",
        "education_and_experience_substitution": "Once the minimum education requirements have been met, additional degrees count as the following additional equivalent years of experience: Additional Bachelor’s – 2 years; Master’s – 3 years.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "execuive,strategy,models,insights,analytical",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Once the minimum education requirements have been met, additional degrees count as the following additional equivalent years of experience: Additional Bachelor’s – 2 years; Master’s – 3 years.",
      "security_clearance": "No",
      "contractor_id": 8182,
      "price_list_id": 71
    },
    {
      "contract_number": "47QRAA22D00E3",
      "labor_category": "Associate - Data Science",
      "hourly_rate": 499.94,
      "source_sheet_name": "Price List",
      "source_row_number": 27,
      "raw_data": {
        "vendor_name": "MCKINSEY & COMPANY, INC. WASHINGTON D.C.",
        "unique_catalog_item_id": "25.0",
        "title": "Associate - Data Science",
        "description": "Engages on urgent, highly complex, and/or high-impact opportunities for senior Government leaders, with an ability to deliver rapidly and to 'get it right the first time.’ Leads a more complex engagement workstream independently (e.g., working on complex and extremely varied data in a multi-disciplinary environment with specialists in machine learning, engineering and design) as part of the engagement team. Works effectively with cross-functional and complex teams and engages with senior-level stakeholders, both internal and external, to design the best solution and move people and organizations to act. Brings experience, best practices, knowledge, and expertise from private sector clients. Creates outputs and content for deliverables for regular client updates as well as intermediate and final deliverables. Strong proficiency in Excel, Word, PowerPoint, and relevant analytics/statistical packages (e.g., Tableau). Develops data science products and solutions and writes highly optimized code. Builds analytical models that are part of an end-to-end digital platform, including creating solutions from the initial minimum viable product (MVP) stage to a robust and mature product. Identifies key hypotheses, metrics, and insights, and defines and drives the analytical scope and method for projects, including formulating and shaping the models. Derives key insights and communicates complex analytics concepts in a clear and concise manner to clients. Strong proficiency in relevant programming languages (e.g., R).",
        "sin": "541611, 541990, 54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "499.94",
        "gsa_price_with_iff__d_": "499.94",
        "gsa_price_with_iff__e_": "519.94",
        "minimum_education": "Masters",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "A Terminal degree (e.g., JD, MD, PhD) or three years of additional experience may be substituted for the Master’s Degree. If a Terminal degree is used to meet the educational  requirement, it would also count as two additional years of experience. Once the minimum education requirements have been met, additional degrees count as the following equivalent years of experience: Additional Bachelor’s – 2 years; Additional Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "data science,solutions,analytics concepts",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Masters",
      "years_experience": "A Terminal degree (e.g., JD, MD, PhD) or three years of additional experience may be substituted for the Master’s Degree. If a Terminal degree is used to meet the educational  requirement, it would also count as two additional years of experience. Once the minimum education requirements have been met, additional degrees count as the following equivalent years of experience: Additional Bachelor’s – 2 years; Additional Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
      "security_clearance": "No",
      "contractor_id": 8182,
      "price_list_id": 71
    },
    {
      "contract_number": "47QRAA22D00E3",
      "labor_category": "Business Analyst - Data Science",
      "hourly_rate": 340.51,
      "source_sheet_name": "Price List",
      "source_row_number": 28,
      "raw_data": {
        "vendor_name": "MCKINSEY & COMPANY, INC. WASHINGTON D.C.",
        "unique_catalog_item_id": "26.0",
        "title": "Business Analyst - Data Science",
        "description": "Engages on urgent, highly complex, and/or high-impact opportunities for senior Government leaders, with an ability to deliver rapidly and to 'get it right the first time.’ Performs daily team activities under the direction of the project lead to complete project-specific tasks and presentations. Leads an engagement workstream independently, (e.g., works on various modelling assignments to derive actionable business insights and solve complex business problems in multi-disciplinary environments (e.g., optimizing workflows, forecasting supply and demand, increasing financial transparency, reducing supply chain risks, and improving workforce outcomes). Brings experience and best practices from private sector clients. Creates outputs and content for deliverables for regular client updates as well as intermediate and final deliverables. Strong proficiency in Excel, Word, PowerPoint, and relevant analytics/statistical packages (e.g., Tableau). Demonstrates depth of knowledge in using advanced statistics, optimization techniques and machine learning algorithms. Strong proficiency in relevant programming languages (e.g., R).",
        "sin": "541611, 541990, 54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "340.51",
        "gsa_price_with_iff__d_": "340.51",
        "gsa_price_with_iff__e_": "354.13",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "Once the minimum education requirements have been met, additional degrees count as the following additional equivalent years of experience: Additional Bachelor’s – 2 years; Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "optimization,modelling,business insights,statistics",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Once the minimum education requirements have been met, additional degrees count as the following additional equivalent years of experience: Additional Bachelor’s – 2 years; Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
      "security_clearance": "No",
      "contractor_id": 8182,
      "price_list_id": 71
    },
    {
      "contract_number": "47QRAA22D00E3",
      "labor_category": "Associate - Human-Centered Design",
      "hourly_rate": 499.94,
      "source_sheet_name": "Price List",
      "source_row_number": 29,
      "raw_data": {
        "vendor_name": "MCKINSEY & COMPANY, INC. WASHINGTON D.C.",
        "unique_catalog_item_id": "27.0",
        "title": "Associate - Human-Centered Design",
        "description": "Engages on urgent, highly complex, and/or high-impact opportunities for senior Government leaders, with an ability to deliver rapidly and to 'get it right the first time.’ Leads a more complex engagement workstream independently, (e.g., drives all aspects of the design process, guiding other members of the design team). Works effectively with cross-functional and complex teams and engages with senior-level stakeholders, both internal and external, to design the best solution and move people and organizations to act. Brings experience, best practices, knowledge, and expertise from private sector clients. Creates outputs and content for deliverables for regular client updates as well as intermediate and final deliverables. Strong proficiency in Excel, Word, PowerPoint, and relevant analytics/statistical packages (e.g., Tableau). Responsible for key design deliverables across a variety of stages and client priorities, from research and insight generation to concept and delivery. Performs task analysis and defines the User Interface Design through information architecture, wireframes and user flows and validate it through usability testing, to lead usability testing sessions, consolidate findings and iteratively integrate into design solutions. Applies conceptual thinking to create desirable and feasible digital solutions across multiple platforms, smartly bringing together user needs, business goals, and technical realities. Utilizes industry design standards and best practices to define and implement design criteria. Applies user centered design methodologies to ensure recommendations are based on customer needs, prepares research and testing, produces personas, maps customer journeys, and develops service blueprints for complex products and services. Participates in workshops, concept sprints, and hackathons to inject design thinking tools and methodologies to produce tangible results in a rapid and iterative way. Works closely with development teams to ensure that design specifications are implemented and communicates the product’s vision to clients. Effectively communicates research findings, conceptual ideas, detailed design, and design rationale both verbally and visually. Uses a variety of methods to convey ideas and concepts (e.g., storyboards, wireframes, prototypes, etc.). Uses narration and storytelling skills to bring product ideas to life, and constructs quick interactive prototypes with initial, low fidelity visual designs that illustrates user experience/user interface (UX/UI) design that present a realistic feel of the intended experience.",
        "sin": "541611, 541990",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "499.94",
        "gsa_price_with_iff__d_": "499.94",
        "gsa_price_with_iff__e_": "519.94",
        "minimum_education": "Masters",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "A Terminal degree (e.g., JD, MD, PhD) or three years of additional experience may be substituted for the Master’s Degree. If a Terminal degree is used to meet the educational requirement, it would also count as two additional years of experience. Once the minimum education requirements have been met, additional degrees count as the following equivalent years of experience: Additional Bachelor’s – 2 years; Additional Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "user experience,design,research,concepts",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Masters",
      "years_experience": "A Terminal degree (e.g., JD, MD, PhD) or three years of additional experience may be substituted for the Master’s Degree. If a Terminal degree is used to meet the educational requirement, it would also count as two additional years of experience. Once the minimum education requirements have been met, additional degrees count as the following equivalent years of experience: Additional Bachelor’s – 2 years; Additional Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
      "security_clearance": "No",
      "contractor_id": 8182,
      "price_list_id": 71
    },
    {
      "contract_number": "47QRAA22D00E3",
      "labor_category": "Business Analyst - Human-Centered Design",
      "hourly_rate": 340.51,
      "source_sheet_name": "Price List",
      "source_row_number": 30,
      "raw_data": {
        "vendor_name": "MCKINSEY & COMPANY, INC. WASHINGTON D.C.",
        "unique_catalog_item_id": "28.0",
        "title": "Business Analyst - Human-Centered Design",
        "description": "Engages on urgent, highly complex, and/or high-impact opportunities for senior Government leaders, with an ability to deliver rapidly and to 'get it right the first time.’ Performs daily team activities under the direction of the project lead to complete project-specific tasks and presentations. Leads an engagement workstream independently, (e.g., addresses all aspects of the design process to deliver inventive, durable, and thoughtful solutions from concept to launch). Brings experience and best practices from private sector clients. Creates outputs and content for deliverables for regular client updates as well as intermediate and final deliverables. Strong proficiency in Excel, Word, PowerPoint, and relevant analytics/statistical packages (e.g., Tableau). Creates desirable and feasible digital solutions across multiple platforms, bringing together user needs, business goals, and technical realities. Utilizes industry design standards and best practices to define and implement design criteria. Applies user centered design methodologies to ensure recommendations are based on customer needs. Prepares research and testing, produces personas, maps customer journeys, and develops service blueprints for complex products and services. Communicates research findings, conceptual ideas, detailed design, and design rationale both verbally and visually. Uses a variety of methods to convey ideas and concepts (e.g., storyboards, wireframes, prototypes). Constructs quick interactive prototypes with initial, low fidelity visual designs that illustrate the UX/UI design to present a realistic feel of the intended experience. Performs task analysis and defines the UI Design through information architecture, wireframes, and user flows, and validates it through usability testing, consolidated findings, and integration into design solutions.",
        "sin": "541611, 541990",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "340.51",
        "gsa_price_with_iff__d_": "340.51",
        "gsa_price_with_iff__e_": "354.13",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "Once the minimum education requirements have been met, additional degrees count as the following additional equivalent years of experience: Additional Bachelor’s – 2 years; Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "design,digital solutions,analytics,research",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Once the minimum education requirements have been met, additional degrees count as the following additional equivalent years of experience: Additional Bachelor’s – 2 years; Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
      "security_clearance": "No",
      "contractor_id": 8182,
      "price_list_id": 71
    },
    {
      "contract_number": "47QRAA22D00E3",
      "labor_category": "Associate - Implementation",
      "hourly_rate": 483.99,
      "source_sheet_name": "Price List",
      "source_row_number": 31,
      "raw_data": {
        "vendor_name": "MCKINSEY & COMPANY, INC. WASHINGTON D.C.",
        "unique_catalog_item_id": "29.0",
        "title": "Associate - Implementation",
        "description": "Engages on urgent, highly complex, and/or high-impact opportunities for senior Government leaders, with an ability to deliver rapidly and to 'get it right the first time.’ Leads a more complex engagement workstream independently (e.g., tracking metrics, handling complex analyses, and preparing communications to report back to client and internal leadership, developing practical recommendations, and contributing to team discussions on implications of analysis, identifying implementation challenges, supporting system analysis, design and implementation).Works effectively with cross-functional and complex teams and engages with senior-level stakeholders, both internal and external, to design the best solution and move people and organizations to act. Brings experience, best practices, knowledge, and expertise from private sector clients. Creates outputs and content for deliverables for regular client updates as well as intermediate and final deliverables. Strong proficiency in Excel, Word, PowerPoint, and relevant analytics/statistical packages (e.g., Tableau). Serves clients by working alongside the client’s staff and assisting with implementation tasks, including facilitating working sessions with front-line and supervisors, connecting with and motivating the client team, or developing skills of client team members when appropriate, principally through coaching. Develops practical recommendations and contributes to team discussions on implications of analysis, and identifies implementation challenges. Builds clients’ capabilities, systems, and processes to ensure they capture and sustain the anticipated results.",
        "sin": "541611, 541990, 541612HC, 54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "483.99",
        "gsa_price_with_iff__d_": "483.99",
        "gsa_price_with_iff__e_": "503.35",
        "minimum_education": "Masters",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "A Terminal degree (e.g., JD, MD, PhD) or three years of additional experience may be substituted for the Master’s Degree. If a Terminal degree is used to meet the educational requirement, it would also count as two additional years of experience. Once the minimum education requirements have been met, additional degrees count as the following equivalent years of experience: Additional Bachelor’s – 2 years; Additional Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "implementation,coaching,capabilities,systems,processes",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Masters",
      "years_experience": "A Terminal degree (e.g., JD, MD, PhD) or three years of additional experience may be substituted for the Master’s Degree. If a Terminal degree is used to meet the educational requirement, it would also count as two additional years of experience. Once the minimum education requirements have been met, additional degrees count as the following equivalent years of experience: Additional Bachelor’s – 2 years; Additional Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
      "security_clearance": "No",
      "contractor_id": 8182,
      "price_list_id": 71
    },
    {
      "contract_number": "47QRAA22D00E3",
      "labor_category": "Business Analyst - Implementation",
      "hourly_rate": 330.24,
      "source_sheet_name": "Price List",
      "source_row_number": 32,
      "raw_data": {
        "vendor_name": "MCKINSEY & COMPANY, INC. WASHINGTON D.C.",
        "unique_catalog_item_id": "30.0",
        "title": "Business Analyst - Implementation",
        "description": "Engages on urgent, highly complex, and/or high-impact opportunities for senior Government leaders, with an ability to deliver rapidly and to 'get it right the first time.’ Performs daily team activities under the direction of the project lead to complete project-specific tasks and presentations. Leads an engagement workstream, (e.g., tracking metrics, handling complex analyses, and preparing communications to report back to client and engagement leadership, supporting system analysis, design and implementation). Brings experience and best practices from private sector clients. Creates outputs and content for deliverables for regular client updates as well as intermediate and final deliverables. Strong proficiency in Excel, Word, PowerPoint, and relevant analytics/statistical packages (e.g., Tableau). Serves clients by helping them to build capabilities in delivery and execution. Provides coaching, guidance, and mentorship to clients to ensure the clients are able to deliver and sustain the full benefits of the recommended change in the client organization. Supports development of practical recommendations and contributes to team discussions on implications of analysis and assists in identification of implementation challenges.",
        "sin": "541611, 541990, 541612HC, 54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "330.24",
        "gsa_price_with_iff__d_": "330.24",
        "gsa_price_with_iff__e_": "343.45",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "Once the minimum education requirements have been met, additional degrees count as the following additional equivalent years of experience: Additional Bachelor’s – 2 years; Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "implementation,coaching,analyses,metrics,communications",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Once the minimum education requirements have been met, additional degrees count as the following additional equivalent years of experience: Additional Bachelor’s – 2 years; Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
      "security_clearance": "No",
      "contractor_id": 8182,
      "price_list_id": 71
    },
    {
      "contract_number": "47QRAA22D00E3",
      "labor_category": "Media Designer",
      "hourly_rate": 190.18,
      "source_sheet_name": "Price List",
      "source_row_number": 33,
      "raw_data": {
        "vendor_name": "MCKINSEY & COMPANY, INC. WASHINGTON D.C.",
        "unique_catalog_item_id": "31.0",
        "title": "Media Designer",
        "description": "Advises engagement teams on any media use and impact-related issues, including graphic design, illustration, and video. Assists engagement teams to create/develop concepts for the specific client communication situations and acts as a creative thought partner in designing communications materials. Provides creative guidance and shares knowledge of media, design, and communications best practices with engagement teams. Possesses a deep knowledge in chosen media or service specialization. Actively stays in touch with the latest design trends and applies all knowledge to design projects for engagement teams.",
        "sin": "541611, 541990, 541612HC, 54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "190.18",
        "gsa_price_with_iff__d_": "190.18",
        "gsa_price_with_iff__e_": "197.79",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "An Associate’s degree plus 2 additional years of experience may be substituted for the Bachelor’s degree. Once the minimum education requirements have been met, additional degrees count as the following additional equivalent years of experience: Additional Bachelor’s – 2 years; Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "media,communication,design,video,creative",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "An Associate’s degree plus 2 additional years of experience may be substituted for the Bachelor’s degree. Once the minimum education requirements have been met, additional degrees count as the following additional equivalent years of experience: Additional Bachelor’s – 2 years; Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
      "security_clearance": "No",
      "contractor_id": 8182,
      "price_list_id": 71
    },
    {
      "contract_number": "47QRAA22D00E3",
      "labor_category": "Graphics Project Manager",
      "hourly_rate": 178.8,
      "source_sheet_name": "Price List",
      "source_row_number": 34,
      "raw_data": {
        "vendor_name": "MCKINSEY & COMPANY, INC. WASHINGTON D.C.",
        "unique_catalog_item_id": "32.0",
        "title": "Graphics Project Manager",
        "description": "Ensures graphics and design projects receive optimal presentation solutions. Navigates services, products, and capacity with a specific need on graphics and design projects, including identifying milestones, understanding priority and timelines, and managing stakeholders. Plans and organizes work to support engagement teams. Creates clear documentation to keep track of the engagement’s major meetings, milestones, etc. Sets up action plans, if needed, and follows up with production processes to ensure quality and delivery needs are met. Manages stakeholders, including connecting across graphics teams and assisting with capacity planning and task allocation.",
        "sin": "541611, 541990, 541612HC, 54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "178.8",
        "gsa_price_with_iff__d_": "178.8",
        "gsa_price_with_iff__e_": "185.95",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "An Associate’s degree plus 2 additional years of experience may be substituted for the Bachelor’s degree. Once the minimum education requirements have been met, additional degrees count as the following additional equivalent years of experience: Additional Bachelor’s – 2 years; Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "graphics,design,presentation",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "An Associate’s degree plus 2 additional years of experience may be substituted for the Bachelor’s degree. Once the minimum education requirements have been met, additional degrees count as the following additional equivalent years of experience: Additional Bachelor’s – 2 years; Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
      "security_clearance": "No",
      "contractor_id": 8182,
      "price_list_id": 71
    },
    {
      "contract_number": "47QRAA22D00E3",
      "labor_category": "Business Presentation Designer",
      "hourly_rate": 168.55,
      "source_sheet_name": "Price List",
      "source_row_number": 35,
      "raw_data": {
        "vendor_name": "MCKINSEY & COMPANY, INC. WASHINGTON D.C.",
        "unique_catalog_item_id": "33.0",
        "title": "Business Presentation Designer",
        "description": "Formats and makes consistent high-impact PowerPoint presentations to support consulting teams. Works in accordance with visualization principles and ensures graphical accuracy and format consistency. Creates and makes edits to existing exhibits and charts in presentations. Possesses proficient skills in visual improvement, message optimization, imagery usage, and layout alternatives. Possesses knowledge of branding, sub brands, and variety of visual identities in PowerPoint.",
        "sin": "541611, 541990, 541612HC, 54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "168.55",
        "gsa_price_with_iff__d_": "168.55",
        "gsa_price_with_iff__e_": "175.29",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "2.0",
        "education_and_experience_substitution": "An Associate’s degree plus 2 additional years of experience may be substituted for the Bachelor’s degree. Once the minimum education requirements have been met, additional degrees count as the following additional equivalent years of experience: Additional Bachelor’s – 2 years; Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "visualization,message optimization,branding,presentation",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "An Associate’s degree plus 2 additional years of experience may be substituted for the Bachelor’s degree. Once the minimum education requirements have been met, additional degrees count as the following additional equivalent years of experience: Additional Bachelor’s – 2 years; Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
      "security_clearance": "No",
      "contractor_id": 8182,
      "price_list_id": 71
    },
    {
      "contract_number": "47QRAA22D00E3",
      "labor_category": "Capabilities & Insights Expert",
      "hourly_rate": 381.5,
      "source_sheet_name": "Price List",
      "source_row_number": 36,
      "raw_data": {
        "vendor_name": "MCKINSEY & COMPANY, INC. WASHINGTON D.C.",
        "unique_catalog_item_id": "34.0",
        "title": "Capabilities & Insights Expert",
        "description": "Serves engagement teams and clients by partnering with consultants and client teams to meet their complex needs, using deep content/capability knowledge, problem solving abilities, project management skills, advanced techniques and vast internal and external networks. Contributes expert knowledge and insights in solving complex client/engagement problems joining, or leading, workstreams. May manage small groups of analysts in client or knowledge/asset/capability development projects. Possesses deep expertise in industry/functional content, a thorough grasp of McKinsey’s consulting approach, and expert knowledge of relevant analytics/statistical tools and approaches, including as relevant to the project: Wide-ranging knowledge of one or more industry or function, expert navigator of firm knowledge ecosystem; knowledge of relevant analytics/statistical tools and approaches; Excellent analytical/quantitative skills, problem-solving capabilities, effective prioritization; Superior communications skills with ability to influence a range of stakeholders; and Highly proficient skills in Excel, Word, PowerPoint, and relevant analytics/statistical packages.",
        "sin": "541611, 541990, 541612HC, 54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "381.5",
        "gsa_price_with_iff__d_": "381.5",
        "gsa_price_with_iff__e_": "396.76",
        "minimum_education": "Masters",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "A Terminal degree (e.g., JD, MD, PhD) or three years of additional experience may be substituted for the Master’s Degree. If a Terminal degree is used to meet the educational  requirement, it would also count as two additional years of experience. Once the minimum education requirements have been met, additional degrees count as the following equivalent years of experience: Additional Bachelor’s – 2 years; Additional Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "analytics,statistical,insights,capability,communication",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Masters",
      "years_experience": "A Terminal degree (e.g., JD, MD, PhD) or three years of additional experience may be substituted for the Master’s Degree. If a Terminal degree is used to meet the educational  requirement, it would also count as two additional years of experience. Once the minimum education requirements have been met, additional degrees count as the following equivalent years of experience: Additional Bachelor’s – 2 years; Additional Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
      "security_clearance": "No",
      "contractor_id": 8182,
      "price_list_id": 71
    },
    {
      "contract_number": "47QRAA22D00E3",
      "labor_category": "Capabilities & Insights Analyst",
      "hourly_rate": 286.98,
      "source_sheet_name": "Price List",
      "source_row_number": 37,
      "raw_data": {
        "vendor_name": "MCKINSEY & COMPANY, INC. WASHINGTON D.C.",
        "unique_catalog_item_id": "35.0",
        "title": "Capabilities & Insights Analyst",
        "description": "Serves engagement teams by providing guidance on leveraging assets, tools, capabilities and insights. As relevant to role: Engages with teams to scope and prioritize project/request and business needs, for low-to-medium complexity situations with minimal guidance; helps teams to navigate the domain’s capabilities; Clarifies scope objectives to determine most relevant, cost-effective capabilities, insights, data, and solutions to deploy; Deploys standard tools, assets, solutions (with minimal guidance); interprets standard outputs of models/solutions to generate insights for engagement teams related to client business need; Conducts medium-complexity analyses and calculations. Prepares accurate, well-developed documents, databases, models, solution outputs, and ready to-use charts to present findings. Possesses business knowledge; basic understanding of research techniques, information sources, and statistical analysis/analytic techniques as relevant to role, including: Strong analytical/quantitative skills, solid problem-solving capabilities, effective prioritization; Intellectual curiosity, good team player, strong written/verbal communications skills; Strong proficiency in Excel, Word, PowerPoint, and relevant analytics/statistical packages.",
        "sin": "541611, 541990, 541612HC, 54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "286.98",
        "gsa_price_with_iff__d_": "286.98",
        "gsa_price_with_iff__e_": "298.46",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "1.0",
        "education_and_experience_substitution": "Once the minimum education requirements have been met, additional degrees count as the following additional equivalent years of experience: Additional Bachelor’s – 2 years; Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "insights,capabilities,data,solutions,analytics",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Once the minimum education requirements have been met, additional degrees count as the following additional equivalent years of experience: Additional Bachelor’s – 2 years; Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
      "security_clearance": "No",
      "contractor_id": 8182,
      "price_list_id": 71
    },
    {
      "contract_number": "47QRAA22D00E3",
      "labor_category": "Engagement Team Assistant",
      "hourly_rate": 125.27,
      "source_sheet_name": "Price List",
      "source_row_number": 38,
      "raw_data": {
        "vendor_name": "MCKINSEY & COMPANY, INC. WASHINGTON D.C.",
        "unique_catalog_item_id": "36.0",
        "title": "Engagement Team Assistant",
        "description": "Provides proactive, timely, and high-quality operations support to the strategy consulting team. Supports day-to-day operations of the team, including meeting, event, and conference planning; coordinating logistics and technology for Video Conferences of all sizes; arranging travel; organizing and maintaining client files within authorized systems. May interface directly with clients to ensure smooth collaboration. Provides additional related support as needed (e.g., overseeing production of materials to support large client meetings or workshops).",
        "sin": "541611, 541990, 541612HC, 54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "125.27",
        "gsa_price_with_iff__d_": "125.27",
        "gsa_price_with_iff__e_": "130.28",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "1.0",
        "education_and_experience_substitution": "An Associate’s degree plus 2 additional years of experience may be substituted for the Bachelor’s degree. Once the minimum education requirements have been met, additional degrees count as the following additional equivalent years of experience: Additional Bachelor’s – 2 years; Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "coordinating,organizing,collaboration,operations,support",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "An Associate’s degree plus 2 additional years of experience may be substituted for the Bachelor’s degree. Once the minimum education requirements have been met, additional degrees count as the following additional equivalent years of experience: Additional Bachelor’s – 2 years; Master’s – 3 years; Terminal (e.g., JD, PhD, MD) – 5 years.",
      "security_clearance": "No",
      "contractor_id": 8182,
      "price_list_id": 71
    }
  ],
  "parsed_at": "2025-11-06T11:52:20.749277"
}