{
  "contract_number": "47QRAA18D006G",
  "contractor_id": 12180,
  "price_list_id": 1446,
  "labor_categories": [
    {
      "contract_number": "47QRAA18D006G",
      "labor_category": "Supervisory Dispatch",
      "hourly_rate": 105.04,
      "source_sheet_name": "Price List",
      "source_row_number": 3,
      "raw_data": {
        "vendor_name": "TENICA AND ASSOCIATES LLC",
        "unique_catalog_item_id": "TEN101",
        "title": "Supervisory Dispatch",
        "description": "Supervises regional division activities. Manages labor to maximize productivity. Ensures that the work area is properly organized for efficiency. Schedules and controls employees to meet daily dispatch requirements. Ensures compliance with customer quality standards. Ensures on-time and accurate delivery of all load tenders. Conducts daily inspection reports and schedules equipment repairs as needed. Documents and follows up on all processes in order to implement improvements. Conducts daily manpower planning and adjust as necessary to ensure efficient allocation of labor. Guides, motivates and develops the division employees to enhance effectiveness of the team. Plans, implements and controls the cost budget; and initiates corrective actions in case of deviations. Monitors and ensures compliance with all government regulatory agencies standards, including Occupational Safety and Health Administration (OSHA) and Department of Transportation (DOT).",
        "sin": "541614",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "105.04",
        "minimum_education": "Associates",
        "minimum_years_of_education": "6.0",
        "education_and_experience_substitution": "none",
        "required_certifications_or_licenses": "none",
        "security_clearance_required": "No",
        "minimum_security_clearance_level": "T1",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Associates",
      "years_experience": "none",
      "security_clearance": "No",
      "contractor_id": 12180,
      "price_list_id": 1446
    },
    {
      "contract_number": "47QRAA18D006G",
      "labor_category": "Driver",
      "hourly_rate": 73.72,
      "source_sheet_name": "Price List",
      "source_row_number": 4,
      "raw_data": {
        "vendor_name": "TENICA AND ASSOCIATES LLC",
        "unique_catalog_item_id": "TEN102",
        "title": "Driver",
        "description": "Provides transportation services required for government personnel, packages, parcels, burn materials and boxes between various locations. Ensures the vehicles are clean and comfortable for their passengers. Presents and conducts him/herself in a professional manner at all times and maintains a professional appearance. Drivers must adhere to the required dress code. Arrives with the appropriate vehicle at the passenger’s originating location no less than ten minutes prior to the scheduled departure time, with the ultimate goal of having the passenger at their destination ahead of their scheduled meeting time. Performs daily inspection of the interior and exterior of the vehicles prior to their first assignment and again at the end of their shift. Must fully qualified, physically able to perform the work required. Provides services Monday through Friday, between the hours of 7:00 a.m. and 8:00 p.m. Must be proficient in English language communication. Must have a very good working knowledge",
        "sin": "541614",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "73.72",
        "minimum_education": "High_School",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "none",
        "required_certifications_or_licenses": "none",
        "security_clearance_required": "Yes",
        "minimum_security_clearance_level": "T3",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "High_School",
      "years_experience": "none",
      "security_clearance": "Yes",
      "contractor_id": 12180,
      "price_list_id": 1446
    },
    {
      "contract_number": "47QRAA18D006G",
      "labor_category": "Logistics Management Specialist",
      "hourly_rate": 118.01,
      "source_sheet_name": "Price List",
      "source_row_number": 5,
      "raw_data": {
        "vendor_name": "TENICA AND ASSOCIATES LLC",
        "unique_catalog_item_id": "TEN103",
        "title": "Logistics Management Specialist",
        "description": "The candidate is tasked with maintaining the “Supply Store and/or Warehouse.” The candidate must possess strong analytical and problem-solving skills, a strong attention to detail, excellent work standards, planning/organization and follow-up skills and strong interpersonal and communication skills. Duties: Assist with material management actions; update material management records; maintain asset visibility and equipment redistribution. Prepares and submits reports; assist with inventories; assist the inventory teams with redistribution, turn-ins and other related tasks. Responsibilities include: Open purchasing and procurement; shipping and receiving; and inventory management. Issues equipment, repairs parts, tools, consumable items (paper, pens, toilet paper, batteries, etc.), hazardous materials or anything else obtained through the supply system. Manages inventories and issuance of repair parts and of general supplies and specialized supplies. Is responsible for open-purchase, inventory, screening, procuring, receiving, storing and issuing other related items and materials. The candidate utilizes financial accounting and database systems to perform inventory and financial management functions. Additionally, sorts and distributes all official and personal mail, manages money orders and stamp inventories, and maintain financial and inventory reports. Reports to the Site Lead or Program Manager.",
        "sin": "541614, 541614SVC",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "118.01",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "6.0",
        "education_and_experience_substitution": "none",
        "required_certifications_or_licenses": "none",
        "security_clearance_required": "No",
        "minimum_security_clearance_level": "T1",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "none",
      "security_clearance": "No",
      "contractor_id": 12180,
      "price_list_id": 1446
    },
    {
      "contract_number": "47QRAA18D006G",
      "labor_category": "Logistics Support Specialist I",
      "hourly_rate": 89.18,
      "source_sheet_name": "Price List",
      "source_row_number": 6,
      "raw_data": {
        "vendor_name": "TENICA AND ASSOCIATES LLC",
        "unique_catalog_item_id": "TEN104",
        "title": "Logistics Support Specialist I",
        "description": "Performs specialized duties to support logistics operations and technical support functions to facilitate organizational objectives and daily operations. The work required is performed with a high degree of independence. The candidate must be knowledgeable of and can apply physical security and accountability measures to ensure 100 percent accountability of assets. The candidate must possess demonstrated knowledge of logistics handling procedures to include the receipt, storage, packing issue and transfer of property and material. The candidate must also can utilize relevant logistics information support systems. Must pass a physical exam and be capable of lifting 65 pounds. Additional duties include but is not limited to: Assisting in maintaining strict enforcement of the physical security related to task performed; ensures accountability is maintained at all times. Ensures proper storage of all property and material. Duties involve the receipt, storage, pacing, issue and transfer of items and associated equipment from the customer. Prepares orders by processing requests and supply orders; pulling materials; packing boxes; and placing orders in the delivery area. Maintains quality service by following organization standards. Makes recommendations to the customer to improve management, maintenance and accountability procedures.",
        "sin": "541614SVC",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "89.18",
        "minimum_education": "Associates",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "none",
        "required_certifications_or_licenses": "none",
        "security_clearance_required": "No",
        "minimum_security_clearance_level": "T1",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Associates",
      "years_experience": "none",
      "security_clearance": "No",
      "contractor_id": 12180,
      "price_list_id": 1446
    },
    {
      "contract_number": "47QRAA18D006G",
      "labor_category": "Logistics Support Specialist II",
      "hourly_rate": 100.5,
      "source_sheet_name": "Price List",
      "source_row_number": 7,
      "raw_data": {
        "vendor_name": "TENICA AND ASSOCIATES LLC",
        "unique_catalog_item_id": "TEN105",
        "title": "Logistics Support Specialist II",
        "description": "Performs specialized duties to support logistics operations and technical support functions to facilitate organizational objectives and daily operations. The work required is performed with a high degree of independence. The candidate must be knowledgeable of and can apply physical security and accountability measures to ensure 100 percent accountability of assets. The candidate must possess demonstrated knowledge of logistics handling procedures to include the receipt, storage, packing issue and transfer of property and material. The candidate must also have the ability to utilize relevant logistics information support systems. Must pass a physical exam and be capable of lifting 65 pounds. Additional duties include but is not limited to: Assisting in maintaining strict enforcement of the physical security related to task performed; ensures accountability is maintained at all times. Ensures proper storage of all property and material. Duties involve the receipt, storage, pacing, issue and transfer of items and associated equipment from the customer. Prepares orders by processing requests and supply orders; pulling materials; packing boxes; and placing orders in the delivery area. Completes reports by entering required information. Maintains technical knowledge by attending educational workshops; reviewing publications. Maintains quality service by following organization standards. Makes recommendations to the customer to improve management, maintenance and accountability procedures.",
        "sin": "541614, 541614SVC",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "100.5",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "4.0",
        "education_and_experience_substitution": "none",
        "required_certifications_or_licenses": "none",
        "security_clearance_required": "No",
        "minimum_security_clearance_level": "T1",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "none",
      "security_clearance": "No",
      "contractor_id": 12180,
      "price_list_id": 1446
    }
  ],
  "parsed_at": "2025-11-06T11:54:49.122520"
}