{
  "contract_number": "47QTCA25D002K",
  "contractor_id": 3170,
  "price_list_id": 1416,
  "labor_categories": [
    {
      "contract_number": "47QTCA25D002K",
      "labor_category": "Project Engineer",
      "hourly_rate": 140.49,
      "source_sheet_name": "Price List",
      "source_row_number": 3,
      "raw_data": {
        "vendor_name": "BUSHTEX INC",
        "unique_catalog_item_id": "LCAT-101-ProjectEngineer",
        "title": "Project Engineer",
        "description": "GENERAL SUMMARY: Working under direction of Program Manager, responsible for all aspects of system requirements and program management functions for various types and scope of satellite-based engineering projects. Participates in development and implementation of system specifications, designs, integration, testing, and documentation of various satellite-based systems and subsystems as well as program management functions. PRINCIPAL DUTIES AND RESPONSIBILITIES 1. Analyzes requirements and develops solutions. 2. Provides comprehensive definition of all aspects of system development from analysis of mission needs to verification of system performance. Evaluates alternatives and assesses risks and costs. 3. May perform other systems engineering duties and special studies and analyses as assigned. 4. Plans, directs, and coordinates project functions to meet project performance requirements and objectives. 5. Manages activities of personnel using various budget, schedule, and performance standards resources.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "140.49",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "education_and_experience_substitution": "Master’s degree in Electrical Engineering and 6 years of general engineering experience.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Engineer,Manage,Satellite,Planning",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Master’s degree in Electrical Engineering and 6 years of general engineering experience.",
      "security_clearance": "No",
      "contractor_id": 3170,
      "price_list_id": 1416
    },
    {
      "contract_number": "47QTCA25D002K",
      "labor_category": "Technical Staff",
      "hourly_rate": 98.35,
      "source_sheet_name": "Price List",
      "source_row_number": 4,
      "raw_data": {
        "vendor_name": "BUSHTEX INC",
        "unique_catalog_item_id": "LCAT-102-TechnicalStaff",
        "title": "Technical Staff",
        "description": "GENERAL SUMMARY: Performs a variety of engineering tasks under supervision of higherlevel Engineers/Analysts, which are broad in nature and are concerned with the design, development, testing, implementation and operation/sustainment of complex systems, including consideration of hardware/software, personnel training, logistics support requirements, support facilities and/or specialized test/support equipment. May perform with some pre- defined latitude for un-reviewed actions and decisions. Experience applying in-depth subject knowledge to the design, development, installation, testing, and maintenance of satellite systems and subsystems. PRINCIPAL DUTIES AND RESPONSIBILITIES 1. Plans and performs engineering research, system design and development, and other assignments in conformance with industry design/engineering standards and best practices as well as customer-unique specifications and requirements. 2. Responsible for the technical/engineering part of a project or task of lesser complexity and importance than those normally assigned to Senior Engineers/Analysts. 3. Develop strategic and implementation plans and system architecture and design including software, hardware, communications and interface requirements for satellite systems. 4. Supports definition, trade-off and design including reviews, and evaluation of documentation, specifications, test plans and procedures. 5. Researches industry trends and changes in satellite and related technologies and identifies further areas of study. 6. Coordinates the activities of Junior Engineers/Analysts and Engineering Technicians assigned to specific engineering projects/tasks. 7. May perform other engineering duties and special studies and analyses as assigned.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "98.35",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "4.0",
        "education_and_experience_substitution": "Masters degree in Engineering and 2 years general engineering experience.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Technical,Engineering,Research,Coordinate",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Masters degree in Engineering and 2 years general engineering experience.",
      "security_clearance": "No",
      "contractor_id": 3170,
      "price_list_id": 1416
    },
    {
      "contract_number": "47QTCA25D002K",
      "labor_category": "Engineering Technician IV",
      "hourly_rate": 70.25,
      "source_sheet_name": "Price List",
      "source_row_number": 5,
      "raw_data": {
        "vendor_name": "BUSHTEX INC",
        "unique_catalog_item_id": "LCAT-103-EngineeringTechnician",
        "title": "Engineering Technician IV",
        "description": "GENERAL SUMMARY: Works under supervision of higher-level Engineer/Analysts to perform a variety of engineering support tasks which are broad in nature and are associated with the design, development, testing, implementation and operation/sustainment of complex systems, including consideration of hardware/software, personnel training, logistics support requirements, support facilities and/or specialized test/support equipment. PRINCIPAL DUTIES AND RESPONSIBILITIES 1. Supports the planning and performance of engineering support tasks in conformance with industry technical standards and best practices as well as customer-unique specifications and requirements and test planning and conduct, data recording and analysis, and identifies problems for solution by higher level technical staff. 2. Supports the technical/engineering activities related to the system design, development, testing, implementation and operation/sustainment tasks assigned to higher-level Engineers/Analysts. 3. Constructs experimental and prototype models to meet engineering requirements. 4. Works under the supervision of higher-level Engineers/Analysts or Program/Project Managers. 5. May perform other engineering support duties as assigned.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "70.25",
        "minimum_education": "Associates",
        "minimum_years_of_education": "4.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Engineer,Analyze,Technicial,Development",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Associates",
      "security_clearance": "No",
      "contractor_id": 3170,
      "price_list_id": 1416
    }
  ],
  "parsed_at": "2025-11-06T11:56:27.464786"
}