{
  "contract_number": "47QTCA18D007R",
  "contractor_id": 12485,
  "price_list_id": 1661,
  "labor_categories": [
    {
      "contract_number": "47QTCA18D007R",
      "labor_category": "Senior Business Consultant",
      "hourly_rate": 255.26,
      "source_sheet_name": "Price List",
      "source_row_number": 3,
      "raw_data": {
        "vendor_name": "TOTAL RESOURCE MANAGEMENT INC",
        "unique_catalog_item_id": "101.0",
        "title": "Senior Business Consultant",
        "description": "Minimum/General Experience:  Ten (10) years technical experience in an IT related field, such as infrastructure, engineering systems and/or asset management.  Requires expertise in information architectures involving one or more enterprise client/server software systems.  Functional Responsibility:  Manages the process of analyzing business and technology requirements and coordinates resources to design an IT architecture and/or build data models and working prototypes.  Conducts feasibility studies to determine new or changed IT procedures or applications.  Defines functional requirements and participates in system testing and implementation.  Additional duties include reviewing systems for effectiveness of internal controls and integrity of data by analyzing processing flows, integration of external system interfaces, and internal subsystem modules; and recommending improvements in control techniques to comply with system reporting and disclosure standards.  Minimum Education:  Bachelor’s degree in engineering, mathematics, physical science, or computer science.  Master’s degree in engineering, mathematics, physical science, or computer science may count for three (3) years of experience.  Fifteen (15) years’ experience in IT system deployment or business analysis may be substituted for formal education.",
        "sin": "54151S",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "255.26",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "education_and_experience_substitution": "Master’s degree in engineering, mathematics, physical science, or computer science may count for three (3) years of experience.  Fifteen (15) years’ experience in IT system deployment or business analysis may be substituted for formal education.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Master’s degree in engineering, mathematics, physical science, or computer science may count for three (3) years of experience.  Fifteen (15) years’ experience in IT system deployment or business analysis may be substituted for formal education.",
      "security_clearance": "No",
      "contractor_id": 12485,
      "price_list_id": 1661
    },
    {
      "contract_number": "47QTCA18D007R",
      "labor_category": "Maximo Consultant",
      "hourly_rate": 172.86,
      "source_sheet_name": "Price List",
      "source_row_number": 4,
      "raw_data": {
        "vendor_name": "TOTAL RESOURCE MANAGEMENT INC",
        "unique_catalog_item_id": "102.0",
        "title": "Maximo Consultant",
        "description": "Minimum/General Experience:  Requires 18 months of working experience in development, tech support, or consulting for Computerized Maintenance Management Systems (CMMS), Enterprise Asset Management Solutions (EAM), or Enterprise Resource Planning (ERP) Systems.  Must have strong communication, presentation, organization, planning, and interpersonal skills necessary to work as a team member and as a liaison with customers.  Proficient personal computer (PC) skills required.  Must have general knowledge of PC’s, handheld devices, Microsoft Project, Excel, Word, Access, e-mail, and other software applications as required.  General knowledge of data transfer tools and database platforms required. Functional Responsibility:  Analyzes, or assists in analyzing, customer business requirements and application objectives, develops or assists in developing designs to meet customer needs.  Works with appropriate services manager or client services representative to estimate time frames, quantity, and skill set of resources required to successfully implement projects.  Develops or assists in the development of project planning, incorporating all relevant variables.  May conduct weekly status meetings with customers to determine progress against plan.  Lead tasks and/or technical teams in the deployment of customer driven solutions. Minimum Education: Bachelor’s Degree in business, marketing, engineering, computer science or related field.  Application or project management certification or four (4) years relevant experience may be substituted for formal education.",
        "sin": "54151S",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "172.86",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "education_and_experience_substitution": "Application or project management certification or four (4) years relevant experience may be substituted for formal education.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Application or project management certification or four (4) years relevant experience may be substituted for formal education.",
      "security_clearance": "No",
      "contractor_id": 12485,
      "price_list_id": 1661
    },
    {
      "contract_number": "47QTCA18D007R",
      "labor_category": "MAXIMO Analyst I",
      "hourly_rate": 139.47,
      "source_sheet_name": "Price List",
      "source_row_number": 5,
      "raw_data": {
        "vendor_name": "TOTAL RESOURCE MANAGEMENT INC",
        "unique_catalog_item_id": "103.0",
        "title": "MAXIMO Analyst I",
        "description": "Minimum/General Experience:  Requires 3 months working with CMMS, departmental IT systems, or enterprise IT systems.  Must have strong communication, presentation, organization, planning, and interpersonal skills necessary to work as a team member and as a liaison with customers.  Proficient personal computer (PC) skills required.  Must have general knowledge of PC’s, handheld devices, Microsoft Project, Excel, Word, Access, e-mail, and other software applications as required.    Functional Responsibility:  Assists in developing designs, application configuration, and/or application customization to meet customer needs.  Attends weekly status meetings with customers to determine progress against plan.  Attends weekly status meetings with customers to determine progress against plan.  Assists with training.  Edits manuals.",
        "sin": "54151S",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "139.47",
        "minimum_education": "High_School",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "GED",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "High_School",
      "years_experience": "GED",
      "security_clearance": "No",
      "contractor_id": 12485,
      "price_list_id": 1661
    },
    {
      "contract_number": "47QTCA18D007R",
      "labor_category": "MAXIMO Analyst II",
      "hourly_rate": 154.63,
      "source_sheet_name": "Price List",
      "source_row_number": 6,
      "raw_data": {
        "vendor_name": "TOTAL RESOURCE MANAGEMENT INC",
        "unique_catalog_item_id": "104.0",
        "title": "MAXIMO Analyst II",
        "description": "Minimum/General Experience:  Requires 3 months working with CMMS, departmental IT systems, or enterprise IT systems. Must have strong communication, presentation, organization, planning, and interpersonal skills necessary to work as a team member and as a liaison with customers.  Proficient personal computer (PC) skills required.  Must have general knowledge of PC’s, handheld devices, Microsoft Project, Excel, Word, Access, e-mail, and other software applications as required.    Functional Responsibility:  Assists in developing designs, application configuration, and/or application customization to meet customer needs.  Attends weekly status meetings with customers to determine progress against plan.  Assists with training.  Edits manuals.  Minimum Education:  Associate or Bachelor’s Degree in business, marketing, engineering, computer science or related field.  Three (3) years relevant experience may be substituted for formal education.",
        "sin": "54151S",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "154.63",
        "minimum_education": "Associates",
        "minimum_years_of_education": "4.0",
        "education_and_experience_substitution": "Three (3) years relevant experience may be substituted for formal education.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Associates",
      "years_experience": "Three (3) years relevant experience may be substituted for formal education.",
      "security_clearance": "No",
      "contractor_id": 12485,
      "price_list_id": 1661
    },
    {
      "contract_number": "47QTCA18D007R",
      "labor_category": "Senior MAXIMO Consultant II",
      "hourly_rate": 222.81,
      "source_sheet_name": "Price List",
      "source_row_number": 7,
      "raw_data": {
        "vendor_name": "TOTAL RESOURCE MANAGEMENT INC",
        "unique_catalog_item_id": "105.0",
        "title": "Senior MAXIMO Consultant II",
        "description": "Minimum/General Experience:  Requires six (6) years of working experience in software development, technical support, solutions deployment, or consulting of Computerized Maintenance Management Systems (CMMS), Enterprise Asset Management Solutions (EAM), or Enterprise Resource Planning Systems (ERP).  Must have strong communication, presentation, organization, planning, and interpersonal skills necessary to work as a team member and as a liaison with customers.  Proficient personal computer (PC) skills required.  Must possess understanding of supply-chain management, procurement activities, maintenance, crafts, or industry specific business process.  Must have general knowledge of Oracle or SQL Server database platforms and data transfer tools and working knowledge of PC’s, handheld devices, Microsoft Project, Excel, Word, Access, e-mail, and other software applications as required.  Must be familiar with various client-server software, legacy systems, Internet technology, enterprise applications, and integration techniques and technology.  Functional Responsibility:  May serve as a project lead, task lead, or customer liaison.  Provides expert advice on product implementation, integration, enhancement, or other projects as applicable.  Analyzes customer business requirements and application objectives, develops configuration design, functional, and technical specifications to meet customer needs.  Leads or participates in periodic status checks with customers and team to assess progress against plan.  Works with appropriate personnel to estimate time frames, quantity, and skill set of resources required to successfully implement projects, and ensures that appropriate resources are assigned to the tasks defined.  Serves as lead or assistant for workshop facilitator, system deployment, and system upgrades.  Evaluates existing Maximo and other enterprise installations and recommends improvements.  General knowledge of data transfer tools and database platforms required. Creates and edits manuals.  Assists with training.      Minimum Education:  Bachelor’s Degree in Business, Marketing, Engineering, Computer Science, or related field.  Application or project management certification plus seven (7) years relevant experience may be substituted for formal education.  Four (4) years relevant experience plus project management or application certification may be substituted for working experience.",
        "sin": "54151S",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "222.81",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "6.0",
        "education_and_experience_substitution": "Application or project management certification plus seven (7) years relevant experience may be substituted for formal education.  Four (4) years relevant experience plus project management or application certification may be substituted for working experience.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Application or project management certification plus seven (7) years relevant experience may be substituted for formal education.  Four (4) years relevant experience plus project management or application certification may be substituted for working experience.",
      "security_clearance": "No",
      "contractor_id": 12485,
      "price_list_id": 1661
    },
    {
      "contract_number": "47QTCA18D007R",
      "labor_category": "Senior MAXIMO System Consultant",
      "hourly_rate": 176.44,
      "source_sheet_name": "Price List",
      "source_row_number": 8,
      "raw_data": {
        "vendor_name": "TOTAL RESOURCE MANAGEMENT INC",
        "unique_catalog_item_id": "106.0",
        "title": "Senior MAXIMO System Consultant",
        "description": "Minimum/General Experience:  Requires four (4) years of working experience in software development, technical support, solutions deployment, or consulting of Computerized Maintenance Management Systems (CMMS), Enterprise Asset Management Solutions (EAM), or Enterprise Resource Planning Systems (ERP).  Must have strong communication, presentation, organization, planning, and interpersonal skills necessary to work as a team member and as a liaison with customers.  Proficient personal computer (PC) skills required.  Must possess understanding of supply-chain management, procurement activities, maintenance, crafts, or industry specific business process.  Must have general knowledge of Oracle or SQLServer database platforms and data transfer tools and working knowledge of PC’s, handheld devices, Microsoft Project, Excel, Word, Access, e-mail, and other software applications as required.  Must be familiar with various client-server software, legacy systems, Internet technology, enterprise applications, and integration techniques and technology.  Functional Responsibility:  Works with appropriate project manager or clients to estimate time frames, quantity, and skill set of resources required to successfully implement projects.  Develops or assists in development of project planning, incorporating relevant variables.  May conduct weekly status meetings with customers to determine progress against the Plan.  Participates in development and refining of forecasts for the project and may serve as a task lead or execution lead.  Leads workshops.  Creates and edits reports.  Minimum Education:  Bachelor’s Degree in Business, Marketing, Engineering, Computer Science, or related field.  Application or project management certification plus seven (7) years relevant experience may be substituted for formal education.",
        "sin": "54151S",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "176.44",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "4.0",
        "education_and_experience_substitution": "Application or project management certification plus seven (7) years relevant experience may be substituted for formal education.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Application or project management certification plus seven (7) years relevant experience may be substituted for formal education.",
      "security_clearance": "No",
      "contractor_id": 12485,
      "price_list_id": 1661
    },
    {
      "contract_number": "47QTCA18D007R",
      "labor_category": "Senior Project Manager",
      "hourly_rate": 203.71,
      "source_sheet_name": "Price List",
      "source_row_number": 9,
      "raw_data": {
        "vendor_name": "TOTAL RESOURCE MANAGEMENT INC",
        "unique_catalog_item_id": "107.0",
        "title": "Senior Project Manager",
        "description": "Minimum/General Experience:  Ten (10) years technical IT experience in systems integration, software engineering or project management.  Utilizes extensive originality, ingenuity, independent judgment, and a sizable degree of self-direction and decision-making.  Experience with multiple large scale projects.  Functional Responsibility:  Independently performs studies, evaluations, and recommendations and solutions to highly complex and important engineering or technical objectives.  Works on complex application problems involving all phases of systems analysis to provide resolutions; provides technical and administrative direction for personnel performing IT related software development tasks, including review of work products for correctness, adherence to the design concept, and to user standards.  Conducts feasibility studies to determine new or changed IT procedures or applications.  Defines functional requirements and participates in system testing and implementation.  Planning, scheduling and staffing.  Project controls and project accounting.  Minimum Education:  Bachelor’s degree in engineering, mathematics, physical science, or computer science.  Master’s degree in engineering, mathematics, physical science, or computer science counts for three (3) years of experience.  Fifteen (15) years experience in IT system development or deployment may be substituted for formal education.  PMP certification may be substituted for five (5) years of experience.",
        "sin": "54151S",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "203.71",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "2.0",
        "education_and_experience_substitution": "Master’s degree in engineering, mathematics, physical science, or computer science counts for three (3) years of experience.  Fifteen (15) years experience in IT system development or deployment may be substituted for formal education.  PMP certification may be substituted for five (5) years of experience.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Master’s degree in engineering, mathematics, physical science, or computer science counts for three (3) years of experience.  Fifteen (15) years experience in IT system development or deployment may be substituted for formal education.  PMP certification may be substituted for five (5) years of experience.",
      "security_clearance": "No",
      "contractor_id": 12485,
      "price_list_id": 1661
    },
    {
      "contract_number": "47QTCA18D007R",
      "labor_category": "Technical Project Manager",
      "hourly_rate": 185.0,
      "source_sheet_name": "Price List",
      "source_row_number": 10,
      "raw_data": {
        "vendor_name": "TOTAL RESOURCE MANAGEMENT INC",
        "unique_catalog_item_id": "108.0",
        "title": "Technical Project Manager",
        "description": "Minimum/General Experience:  Seven (7) years technical IT experience in systems integration, software engineering or project management.  Utilizes extensive originality, ingenuity, independent judgment, and a sizable degree of self-direction and decision-making.  Experience with multiple large scale projects.  Functional Responsibility:  Independently performs studies, evaluations, and recommendations and solutions to highly complex and important engineering or technical objectives.  Works on complex application problems involving all phases of systems analysis to provide resolutions; provides technical and administrative direction for personnel performing IT related software development tasks, including review of work products for correctness, adherence to the design concept, and to user standards.  Conducts feasibility studies to determine new or changed IT procedures or applications.  Defines functional requirements and participates in system testing and implementation.  Planning, scheduling and staffing.  Project controls and project accounting.  Minimum Education:  Bachelor’s degree in engineering, mathematics, physical science, or computer science.  Master’s degree in engineering, mathematics, physical science, or computer science counts for three (3) years of experience.  Ten (10) years experience in IT system development or deployment may be substituted for formal education.  PMP certification may be substituted for five (5) years of experience.",
        "sin": "54151S",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "185.0",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "1.0",
        "education_and_experience_substitution": "Master’s degree in engineering, mathematics, physical science, or computer science counts for three (3) years of experience.  Ten (10) years experience in IT system development or deployment may be substituted for formal education.  PMP certification may be substituted for five (5) years of experience.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Master’s degree in engineering, mathematics, physical science, or computer science counts for three (3) years of experience.  Ten (10) years experience in IT system development or deployment may be substituted for formal education.  PMP certification may be substituted for five (5) years of experience.",
      "security_clearance": "No",
      "contractor_id": 12485,
      "price_list_id": 1661
    },
    {
      "contract_number": "47QTCA18D007R",
      "labor_category": "Program Manager",
      "hourly_rate": 220.33,
      "source_sheet_name": "Price List",
      "source_row_number": 11,
      "raw_data": {
        "vendor_name": "TOTAL RESOURCE MANAGEMENT INC",
        "unique_catalog_item_id": "109.0",
        "title": "Program Manager",
        "description": "Independently performs studies, evaluations, and recommendations and solutions to highly complex and important engineering or technical objectives.  Works on complex application problems involving all phases of systems analysis to provide resolutions; provides technical and administrative direction for personnel performing IT related software development tasks, including review of work products for correctness, adherence to the design concept, and to user standards.  Conducts feasibility studies to determine new or changed IT procedures or applications.  Defines functional requirements and participates in system testing and implementation.  Manages the process of analyzing business and technology requirements and coordinates resources to design IT architecture and/or to build data models and working prototypes.  Planning, scheduling, and staffing.  Project controls and project accounting.",
        "sin": "54151S",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "220.33",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "7.0",
        "education_and_experience_substitution": "Master’s degree in engineering, mathematics, physical science, or computer science may be substituted for five (5) years of experience.  PMP certification may be substituted for 10 years of experience. Fifteen (15) years’ experience in IT system development or deployment may be substituted for formal education.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Master’s degree in engineering, mathematics, physical science, or computer science may be substituted for five (5) years of experience.  PMP certification may be substituted for 10 years of experience. Fifteen (15) years’ experience in IT system development or deployment may be substituted for formal education.",
      "security_clearance": "No",
      "contractor_id": 12485,
      "price_list_id": 1661
    },
    {
      "contract_number": "47QTCA18D007R",
      "labor_category": "Reliability Senior Consultant",
      "hourly_rate": 275.12,
      "source_sheet_name": "Price List",
      "source_row_number": 12,
      "raw_data": {
        "vendor_name": "TOTAL RESOURCE MANAGEMENT INC",
        "unique_catalog_item_id": "110.0",
        "title": "Reliability Senior Consultant",
        "description": "Lead client projects to improve business processes within reliability and maintenance. Business process improvements can use principals of Lean, Six Sigma, RCM, TPM and other quality management tools.  Gather requirements and design configuration changes based on the best practices and business process recommendations to align the CMMS (Maximo, SAP) with the intended KPIs, Metrics and Use Cases provided by the client to achieve the identified ROI for reliability and operational improvement.",
        "sin": "54151S",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "275.12",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "6.0",
        "education_and_experience_substitution": "A Master’s degree may count for three (3) years of experience.   Fifteen (15) years’ experience in business analysis, process enhancement, or productivity improvement may be substituted for formal education.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "A Master’s degree may count for three (3) years of experience.   Fifteen (15) years’ experience in business analysis, process enhancement, or productivity improvement may be substituted for formal education.",
      "security_clearance": "No",
      "contractor_id": 12485,
      "price_list_id": 1661
    }
  ],
  "parsed_at": "2025-11-06T11:54:55.503825"
}