{
  "contract_number": "47QTCA18D0099",
  "contractor_id": 2622,
  "price_list_id": 1950,
  "labor_categories": [
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Cloud Application and Data Developer (Senior)",
      "hourly_rate": 141.39,
      "source_sheet_name": "Price List",
      "source_row_number": 3,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-001",
        "title": "Cloud Application and Data Developer (Senior)",
        "description": "Services performed include, but are not limited to leading the design, development, and implementation of cloud-based applications and data solutions. This role involves working closely with cross-functional teams to gather requirements, design solutions, and ensure the successful deployment of applications in a cloud environment. Cloud Application Development responsibilities includes, design, develop, and deploy scalable cloud-based applications. Utilize cloud platforms such as AWS, Azure, or Google Cloud to build and manage application services. Implement microservices architecture and containerization technologies like Docker and Kubernetes. Data Management and Integration includes,  develop and implement strategies for data storage, data integration, and data migration to cloud platforms. Ensure data integrity and security across all cloud environments. Design and manage databases, data warehouses, and data lakes. Performance Optimization includes, monitor and optimize the performance, scalability, and cost-efficiency of cloud applications. Implement best practices for cloud architecture and DevOps to enhance application performance and reliability. Conduct regular performance tuning and optimization of cloud resources. Security and Compliance includes, ensure compliance with security policies and regulations in the cloud environment. Implement and manage security measures such as encryption, IAM, and network security. Conduct regular security audits and vulnerability assessments. Collaboration and Leadership includes, lead and mentor junior developers and engineers in best practices for cloud application development and data management. Collaborate with stakeholders to define project scope, requirements, and deliverables. Provide technical leadership and guidance throughout the project lifecycle. Continuous Improvement includes, stay updated with the latest trends and advancements in cloud computing and data technologies. Evaluate and recommend new tools, technologies, and processes to improve development efficiency and application performance. Participate in code reviews and contribute to the continuous improvement of coding standards and practices.",
        "sin": "518210C",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "141.39",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "education_and_experience_substitution": "PhD + 4 years' experience; Masters + 6 years' experience; Associates + 10 years' experience; High School + 12 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Cloud,Application,Data,Developer,Management",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 4 years' experience; Masters + 6 years' experience; Associates + 10 years' experience; High School + 12 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Cloud Application Software Developer (Senior)",
      "hourly_rate": 107.68,
      "source_sheet_name": "Price List",
      "source_row_number": 4,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-002",
        "title": "Cloud Application Software Developer (Senior)",
        "description": "Services performed include, but are not limited to, contributing to overall strategic vision and integrates a broad range of solutions in support of client requirements for cloud projects. Formulates and defines system scope and objectives, develops, or modifies processes to solve complex problems for cloud systems and business and electronic interfaces to achieve desired results through the use of innovative technologies. Develops and applies advanced engineering and design methods, theories, and research techniques in the investigation and solution of complex and advanced cloud requirements, hardware/software interfaces and applications, and solutions. Responsible for design, development, engineering, integration, and architecture. Senior staff manages, plans, and conducts major phases of significant projects. In general, work complexity and responsibility will be greater at higher levels.",
        "sin": "518210C",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "107.68",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "PhD + 0 years' experience; Masters + 1 year experience; Associates + 5 years' experience; High School + 7 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Cloud,Application,Software,Developer,Senior",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 0 years' experience; Masters + 1 year experience; Associates + 5 years' experience; High School + 7 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Cloud Architect and Engineer (Senior)",
      "hourly_rate": 149.65,
      "source_sheet_name": "Price List",
      "source_row_number": 5,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-003",
        "title": "Cloud Architect and Engineer (Senior)",
        "description": "Services performed include but are not limited to develop and implement cloud strategies, ensuring alignment with organizational goals and objectives. Design and architect cloud solutions, focusing on scalability, security, and cost-efficiency. Oversee the deployment, configuration, and maintenance of cloud infrastructure. Design, development, and implementation of cloud-based applications, cloud-based data management platforms, cloud infrastructure platforms, integration of network solution with multi-cloud ecosystem and on-premises infrastructures, implement DevOps, DevSecOps, CI/CD processes, and data solutions, Ensure optimal performance, availability, and reliability of cloud services. Implement robust security measures and ensure compliance with industry standards and regulations. Perform regular security assessments and audits to identify and mitigate risks. Lead the migration of on-premises applications and data to cloud environments. Integrate cloud services with existing systems, ensuring seamless operation and minimal disruption. Monitor cloud infrastructure performance and implement optimizations to enhance efficiency and reduce costs. Utilize tools and best practices for performance tuning and capacity planning. Provide technical leadership and guidance to engineering teams. Mentor junior engineers, fostering skill development and knowledge sharing. Collaborate with cloud service providers and vendors to evaluate and select appropriate solutions. Engage with stakeholders to understand requirements and ensure successful project delivery. Maintain comprehensive documentation of cloud architecture, configurations, and procedures. Prepare reports and presentations for management and stakeholders on cloud initiatives and performance metrics.",
        "sin": "518210C",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "149.65",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "education_and_experience_substitution": "PhD + 4 years' experience; Masters + 6 years' experience; Associates + 10 years' experience; High School + 12 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Cloud,Architect,Engineer,Senior,Develop",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 4 years' experience; Masters + 6 years' experience; Associates + 10 years' experience; High School + 12 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Cloud Architect SME",
      "hourly_rate": 160.27,
      "source_sheet_name": "Price List",
      "source_row_number": 6,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-004",
        "title": "Cloud Architect SME",
        "description": "Services performed include, but are not limited to designing, implementing, and overseeing the organization's cloud computing strategy. This includes cloud adoption plans, cloud application design, and cloud management and monitoring. The Cloud Architect SME will work closely with IT teams, business stakeholders, and external partners to ensure that cloud solutions meet business requirements and industry standards. Strategic Planning and Solution Design responsibilities includes develop and implement cloud architecture strategies to support business objectives. Design scalable, secure, and efficient cloud solutions using AWS, Azure, Google, and other Cloud platforms. Collaborate with stakeholders to comprehend business requirements and identify cloud solutions that enhance business processes. Technical Leadership includes, lead the design, deployment, and management of cloud infrastructure and applications. Provide technical guidance and mentorship to engineering and IT teams. Ensure that cloud solutions adhere to technical architecture standards and best practices. Cloud Management and Optimization includes, monitor cloud environments to ensure optimal performance, security, and cost-efficiency. Implement automation tools and frameworks (CI/CD pipelines) to streamline cloud operations. Manage cloud governance policies and compliance with industry regulations. Innovation and Continuous Improvement includes, stay updated with emerging cloud technologies and industry trends. Promote an environment of continuous learning and innovation within the team.Drive the development of proof-of-concepts and pilot projects to evaluate new cloud technologies. Security and Risk Management includes, ensure that cloud solutions are designed with robust security controls and comply with security standards. Identify and mitigate risks associated with cloud adoption and migration. Implement disaster recovery and business continuity plans for cloud environments.",
        "sin": "518210C",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "160.27",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "12.0",
        "education_and_experience_substitution": "PhD + 8 years' experience; Masters + 10 years' experience; Associates + 14 years' experience; High School + 16 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Cloud,Architect,Subject,Matter,Expert",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 8 years' experience; Masters + 10 years' experience; Associates + 14 years' experience; High School + 16 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Cloud Business Systems Analyst (Senior)",
      "hourly_rate": 108.43,
      "source_sheet_name": "Price List",
      "source_row_number": 7,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-005",
        "title": "Cloud Business Systems Analyst (Senior)",
        "description": "Works under the overall direction of the Program/Project Manager to align requirements, analyze designs, and assist in the implementation of the cloud system. Provides technical, managerial, and administrative direction for problem definition, analysis, requirements development, and requirements implementation for cloud migration and cloud implementation related projects. Provides recommendations and advises on organizational wide cloud system improvements, optimization or maintenance efforts for information systems in the following specialties: information systems architecture using various Cloud SaaS PaaS and IaaS Services; networking; telecommunications; software deployment automation; communications protocols; risk management or electronic analysis; web application; software; life-cycle management; software development methodologies; and modeling and simulation. Applies an enterprise-wide set of disciplines and processes for planning, analyzing, designing, constructing, and implementing information systems using various Cloud services. Develops analytical and computational techniques and methodology for problem resolutions. Performs process and data modeling in support of the systems planning and analysis efforts. Employs reverse engineering and reengineering disciplines to develop migration and planning documents. Excellent oral and written communication skills with all levels of management, contractors, and client agency representatives.;",
        "sin": "518210C",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "108.43",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "PhD + 0 years' experience; Masters + 1 year experience; Associates + 5 years' experience; High School + 7 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Cloud,Business,Systems,Analyst,Senior",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 0 years' experience; Masters + 1 year experience; Associates + 5 years' experience; High School + 7 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Cloud DevSecOps Engineer (Journeyman)",
      "hourly_rate": 139.96,
      "source_sheet_name": "Price List",
      "source_row_number": 8,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-006",
        "title": "Cloud DevSecOps Engineer (Journeyman)",
        "description": "Services performed include, but are not limited to design, deploy, and maintain cloud infrastructure using Infrastructure as a Service (IaaS) and Platform as a Service (PaaS) models. Implement cloud solutions that meet security and compliance requirements. DevSecOps Practices responsibilities include, integrate security practices into the DevOps workflow, ensuring that development, security, and operations are seamlessly aligned.; Automate security processes and configurations to enhance the security posture of applications and infrastructure. Develop and maintain DevOps and DevSecOps processes, CI/CD pipelines to facilitate automated testing, integration, and deployment of applications. Ensure that code deployments are performed smoothly and efficiently with minimal downtime. Implement monitoring, logging, and alerting solutions to track the performance and security of applications. Proactively identify and resolve issues to maintain high availability and performance standards. Manage and maintain container images and virtual machine (VM) images, ensuring they are up-to-date and secure. Automate patch management processes to ensure timely updates and vulnerability remediation. Work closely with development teams to ensure that security requirements are integrated into the software development lifecycle. Provide technical support and guidance to development teams on best practices for secure coding and infrastructure management. Ensure that all solutions comply with relevant regulations and standards. Maintain comprehensive documentation of cloud architectures, security practices, and operational procedures. Overall responsibility includes effectively contributing to the secure and efficient operation of cloud-based environments, aligning with best practices in DevSecOps and cloud infrastructure management.",
        "sin": "518210C",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "139.96",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "PhD + 1 year experience; Masters + 3 years' experience; Associates + 7 years' experience; High School + 9 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Cloud,DevSecOps,Engineer,Journeyman,Design",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 1 year experience; Masters + 3 years' experience; Associates + 7 years' experience; High School + 9 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Cloud DevSecOps Engineer (Senior)",
      "hourly_rate": 158.43,
      "source_sheet_name": "Price List",
      "source_row_number": 9,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-007",
        "title": "Cloud DevSecOps Engineer (Senior)",
        "description": "Services performed include but are not limited to integrating security practices into the DevOps pipeline and ensuring robust, scalable, and secure cloud environments. Develop and implement cloud infrastructure solutions using Infrastructure as Code (IaC) tools such as Terraform, CloudFormation, or Ansible. Design and maintain continuous integration and continuous deployment (CI/CD) pipelines to automate testing, building, and deployment processes. Embed security controls, processes, and tools in the CI/CD pipeline, including automated security testing, vulnerability assessments, and compliance checks. Ensure all cloud and DevOps practices align with organizational security policies and industry best practices. Implement and manage logging, monitoring, and alerting systems to ensure the health and security of cloud environments. Develop and maintain incident response and disaster recovery plans for cloud environments. Work closely with development, operations, and security teams to promote a culture of shared responsibility and continuous improvement.; Mentor junior engineers and provide technical guidance on cloud and DevSecOps best practices. Ensure compliance with relevant regulations and standards such as NIST, ISO 27001, and FedRAMP. Develop and enforce governance policies for cloud usage, including resource tagging, cost management, and access controls. Continuously identify opportunities for automation to improve efficiency, scalability, and reliability of cloud operations. Optimize cloud resources for performance and cost-effectiveness, leveraging tools for autoscaling, load balancing, and resource monitoring.",
        "sin": "518210C",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "158.43",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "education_and_experience_substitution": "PhD + 4 years' experience; Masters + 6 years' experience; Associates + 10 years' experience; High School + 12 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Cloud,DevSecOps,Engineer,Senior,Design",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 4 years' experience; Masters + 6 years' experience; Associates + 10 years' experience; High School + 12 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Cloud Information Assurance/Security Specialist (Master)",
      "hourly_rate": 138.13,
      "source_sheet_name": "Price List",
      "source_row_number": 10,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-008",
        "title": "Cloud Information Assurance/Security Specialist (Master)",
        "description": "Services performed include, but are not limited to, designing, developing, engineering, and implementing integrated cloud security solutions that will ensure proprietary/confidential data and systems are protected. Gathers and organizes technical information about an organization's mission goals and needs, existing security products, and ongoing programs in computer security in the strategic design process to translate security and business requirements into technical designs. Configures and validates secure cloud systems; tests security products and systems to detect security weakness. Conducts regular audits to ensure that systems are being operated securely, and computer security policies and procedures are being implemented as defined in security plans. Duties include architecture design, system/network analysis, vulnerability and risk assessments, and security assessment of hardware and software. Performs duties on tasks that require expertise in firewall, cyber, cloud computing, implementation/configuration, physical security analysis of facilities, security assessment/risk analysis, security design of local area networks and wide area networks, security analysis of network operating systems and applications, continuity of operations, planning, policy development and disaster recovery. In general, work complexity and responsibility will be greater at higher level.",
        "sin": "518210C",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "138.13",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "PhD + 1 year experience; Masters + 3 years' experience; Associates + 7 years' experience; High School + 9 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Cloud,Information,Assurance,Security,Specialist",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 1 year experience; Masters + 3 years' experience; Associates + 7 years' experience; High School + 9 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Cloud Information Systems Security Officer (Senior)",
      "hourly_rate": 108.43,
      "source_sheet_name": "Price List",
      "source_row_number": 11,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-009",
        "title": "Cloud Information Systems Security Officer (Senior)",
        "description": "Services performed include, but are not limited to, designing, developing, engineering, and implementing integrated cloud security solutions that will ensure proprietary/confidential data and systems are protected. Gathers and organizes technical information about an organization's mission goals and needs, existing security products, and ongoing programs in computer security in the strategic design process to translate security and business requirements into technical designs. Configures and validates secure cloud systems; tests security products and systems to detect security weakness. Conducts regular audits to ensure that systems are being operated securely, and computer security policies and procedures are being implemented as defined in security plans. Duties include architecture design, system/network analysis, vulnerability and risk assessments, and security assessment of hardware and software. Performs duties on tasks that require expertise in firewall, cyber, cloud computing, implementation/configuration, physical security analysis of facilities, security assessment/risk analysis, security design of local area networks and wide area networks, security analysis of network operating systems and applications, continuity of operations, planning, policy development and disaster recovery. In general, work complexity and responsibility will be greater at higher levels.;",
        "sin": "518210C",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "108.43",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "PhD + 0 years' experience; Masters + 1 year experience; Associates + 5 years' experience; High School + 7 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Cloud,Information,Systems,Security,Officer",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 0 years' experience; Masters + 1 year experience; Associates + 5 years' experience; High School + 7 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Cloud Network and Security Specialist",
      "hourly_rate": 127.9,
      "source_sheet_name": "Price List",
      "source_row_number": 12,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-010",
        "title": "Cloud Network and Security Specialist",
        "description": "Services performed include but are not limited to Design, implement, and maintain cloud network infrastructure, ensuring high availability, scalability, and performance. Configure and manage virtual networks, subnets, and network security groups. Develop and enforce security policies and procedures to protect cloud infrastructure and data. Implement and manage security measures, such as firewalls, intrusion detection/prevention systems, and encryption. Monitor network and security systems for performance, availability, and security incidents. Analyze logs and alerts to identify potential threats and vulnerabilities. Perform troubleshooting and resolution of network and security issues. Ensure compliance with relevant regulations and standards (e.g., GDPR, HIPAA, FISMA). Design, deploy, and maintain cloud infrastructure using Infrastructure as a Service (IaaS) and Platform as a Service (PaaS) models. Implement cloud solutions that meet security and compliance requirements. DevSecOps Practices responsibilities include, integrate security practices into the DevOps workflow, ensuring that development, security, and operations are seamlessly aligned. Automate security processes and configurations to enhance the security posture of applications and infrastructure. Develop and maintain DevOps and DevSecOps processes, CI/CD pipelines to facilitate automated testing, integration, and deployment of applications. Conduct risk assessments and vulnerability assessments to identify and mitigate security risks. Automation and Optimization: Develop and deploy automation scripts to streamline network and security operations. Optimize network and security configurations for efficiency and performance. Lead and coordinate response to security incidents, including investigation, mitigation, and recovery. Develop and maintain incident response plans and procedures. Work with cross-functional teams to integrate network and security solutions into overall IT infrastructure. Provide training and guidance to staff on network and security best practices. Maintain detailed documentation of network and security configurations, procedures, and incident response activities. These responsibilities ensure that the specialist can effectively manage and secure cloud network infrastructures, meeting the needs of modern enterprises.",
        "sin": "518210C",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "127.9",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "PhD + 1 year experience; Masters + 3 years' experience; Associates + 7 years' experience; High School + 9 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Cloud,Network,Specialist,Security,Operations",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 1 year experience; Masters + 3 years' experience; Associates + 7 years' experience; High School + 9 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Cloud Program Manager",
      "hourly_rate": 174.15,
      "source_sheet_name": "Price List",
      "source_row_number": 13,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-011",
        "title": "Cloud Program Manager",
        "description": "Services performed include, but are not limited to, responsible for the full life cycle development of Cloud applications including complex deployments requiring multi-cross functional team management. Exercises analytical techniques when gathering information from users, defining work problems, and developing procedures to resolve the problems. Provides support for structured analysis techniques. Manages large teams in cross project integration support, quality assurance services, implementation, and deployment. Provides management oversight of team members, scope of project, risk management, and issues management. Attends formal reviews of teamwork products to ensure completeness and correctness. Develops, manages, and maintains project plan, project scope, risk assessment, and budget. Contract Management responsibilities includes, serve as the primary interface with the Government Contracting Officer, the Contracting Officer’s Representative, government management personnel, and customer agency representatives. Manage and oversee contract execution to ensure compliance with all terms and conditions. Provide overall leadership and guidance to project teams, ensuring the successful delivery of projects within scope, schedule, and budget. Develop and implement project plans, work breakdown structures, and schedules. Lead and coordinate multi-disciplinary project teams, including technical, administrative, and support staff. Foster a collaborative team environment and facilitate effective communication across all project stakeholders. Identify potential risks and develop mitigation strategies. Monitor project progress and resolve issues that arise, ensuring minimal impact on project outcomes. Track project performance using appropriate tools and techniques. Measure project performance against objectives and deliverables, and implement necessary adjustments to keep projects on track. Prepare and deliver regular project status reports to government stakeholders and senior management. Ensure transparency and clear communication of project progress, challenges, and solutions. Ensure that all project activities comply with relevant regulations, standards, and best practices. Implement quality assurance processes to maintain high standards of project delivery.",
        "sin": "518210C",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "174.15",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "education_and_experience_substitution": "PhD + 6 years' experience; Masters + 8 years' experience; Associates + 12 years' experience; High School + 14 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Cloud,Program,Manager,Development,Applications",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 6 years' experience; Masters + 8 years' experience; Associates + 12 years' experience; High School + 14 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Cloud Project Manager",
      "hourly_rate": 151.56,
      "source_sheet_name": "Price List",
      "source_row_number": 14,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-012",
        "title": "Cloud Project Manager",
        "description": "Services performed include, but are not limited to, works under general supervision of overall program manager of higher level company/client management responsible for the management of a specific task, or for a particular portion of a larger, more complex cloud projects. Plan and implement activities by the project team to define and implement technical baseline and meet quality requirements for products and services; Direct project team personnel, manage cost and schedule, ensure contract compliance, and serve as principal customer interface for project delivery; Analyzes project related problems and creates innovative solutions involving finance, scheduling, technologies, methodologies, tools, and solution components; Provides the day-to-day management of technical projects and directs, organizes, and coordinates the planning and production of project deliverables; Excellent oral and written communication skills with all levels of management, contractors, and client agency representatives.",
        "sin": "518210C",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "151.56",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "education_and_experience_substitution": "PhD + 4 years' experience; Masters + 6 years' experience; Associates + 10 years' experience; High School + 12 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Cloud,Project,Manager,Supervise,Finance",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 4 years' experience; Masters + 6 years' experience; Associates + 10 years' experience; High School + 12 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Cloud Security Architect",
      "hourly_rate": 142.47,
      "source_sheet_name": "Price List",
      "source_row_number": 15,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-013",
        "title": "Cloud Security Architect",
        "description": "Services performed include but are not limited to develop and implement security architectures for cloud environments, including public, private, and hybrid clouds. Develop cloud adoption plans, cloud application design, and cloud management and monitoring. The Cloud Architect SME will work closely with IT teams, business stakeholders, and external partners to ensure that cloud solutions meet business requirements and industry standards. Strategic Planning and Solution Design responsibilities includes develop and implement cloud architecture strategies to support business objectives. Design scalable, secure, and efficient cloud solutions using AWS, Azure, Google, and other Cloud platforms. Design security solutions to meet the requirements of regulatory frameworks and industry best practices. Establish security policies and procedures that align with organizational goals and compliance requirements. Perform vulnerability assessments and penetration testing on cloud-based systems to identify security gaps. Collaborate with development and operations teams to remediate identified vulnerabilities. Ensure continuous monitoring and improvement of cloud security postures. Define and implement governance frameworks for cloud security, ensuring compliance with organizational policies and regulatory requirements. Provide strategic direction and oversight for cloud security initiatives and projects. Develop and maintain security documentation, including risk assessments, security plans, and incident response procedures. Lead and mentor security teams, providing technical guidance on cloud security best practices. Serve as a subject matter expert (SME) on cloud security to other IT teams and stakeholders. Advise on the selection and implementation of security tools and technologies. Develop and implement incident response plans tailored for cloud environments. Coordinate and lead responses to cloud security incidents, ensuring timely resolution and mitigation. Conduct post-incident analysis to identify root causes and implement preventive measures. Integrate security tools and processes into CI/CD pipelines to ensure secure code deployment. Work closely with DevOps teams to automate security controls and monitoring. Ensure secure configuration and management of cloud resources and services. Develop and deliver training programs to enhance cloud security awareness across the organization. Stay updated on the latest cloud security trends, threats, and technologies to inform training and policy updates. Promote a culture of security awareness and proactive risk management.",
        "sin": "518210C",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "142.47",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "PhD + 1 year experience; Masters + 3 years' experience; Associates + 7 years' experience; High School + 9 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Cloud,Security,Architect,Implement,Platforms",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 1 year experience; Masters + 3 years' experience; Associates + 7 years' experience; High School + 9 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Cloud SME - Computer Systems Analyst",
      "hourly_rate": 103.0,
      "source_sheet_name": "Price List",
      "source_row_number": 16,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-014",
        "title": "Cloud SME - Computer Systems Analyst",
        "description": "Services performed include, but are not limited to, applying management analysis processes, statistical methods, and advanced technical and analytical research techniques to determine cloud solutions based on client requirements. Analyzes operational activities to obtain a quantitative, rational basis for decision making and resource allocation. Employs process improvements and reengineering methodologies and principles for modernization of cloud-based systems and projects. Creates project plans to achieve performancebased objectives, enhancing cloud implementation, systems, and service. Provides integral support in mission requirements determination, conceptualization, design, development, testing, verification and validation, documentation, and implementation of system applications. Senior staff manages, plans, and conducts major phases of significant projects. In general, work complexity and responsibility will be greater at higher levels.;",
        "sin": "518210C",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "103.0",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "PhD + 0 years' experience; Masters + 1 year experience; Associates + 5 years' experience; High School + 7 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Cloud,SME,Computer,Systems,Analyst",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 0 years' experience; Masters + 1 year experience; Associates + 5 years' experience; High School + 7 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Cloud SME (Journeyman)",
      "hourly_rate": 123.32,
      "source_sheet_name": "Price List",
      "source_row_number": 17,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-015",
        "title": "Cloud SME (Journeyman)",
        "description": "Provides task-unique functional expertise and in-depth knowledge necessary to interpret requirements, ensure responsiveness and achieve successful performance in a business, operational, engineering, mathematics, or scientific area. Participates in all phases of the cloud project lifecycle, as needed, and advises IT consultants with the extensive knowledge needed from the specialist for effective implementation. This labor category is designed for other than Information Technology functional expertise, but the expertise is required to support a cloud task. This labor category is offered only in conjunction with cloud professional labor categories. In general, work complexity and responsibility will be greater at higher levels. ;",
        "sin": "518210C",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "123.32",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "PhD + 0 years' experience; Masters + 1 year experience; Associates + 5 years' experience; High School + 7 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Cloud,SME,Journeyman,Specialist,Project",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 0 years' experience; Masters + 1 year experience; Associates + 5 years' experience; High School + 7 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Cloud Systems Engineer",
      "hourly_rate": 108.52,
      "source_sheet_name": "Price List",
      "source_row_number": 18,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-016",
        "title": "Cloud Systems Engineer",
        "description": "Services performed include, but are not limited to, contributing to overall strategic vision and integrates a broad range of solutions in support of client requirements for cloud projects. Formulates and defines system scope and objectives, develops, or modifies processes to solve complex problems for cloud systems and business and electronic interfaces to achieve desired results through the use of innovative technologies. Develops and applies advanced engineering and design methods, theories, and research techniques in the investigation and solution of complex and advanced cloud requirements, hardware/software interfaces and applications, and solutions. Responsible for design, development, engineering, integration, and architecture. Senior staff manages, plans, and conducts major phases of significant projects. In general, work complexity and responsibility will be greater at higher levels. ;",
        "sin": "518210C",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "108.52",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "PhD + 0 years' experience; Masters + 1 year experience; Associates + 5 years' experience; High School + 7 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Cloud,System,Engineer,Solutions,Scope",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 0 years' experience; Masters + 1 year experience; Associates + 5 years' experience; High School + 7 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Cloud Web Developer (Journeyman)",
      "hourly_rate": 81.26,
      "source_sheet_name": "Price List",
      "source_row_number": 19,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-017",
        "title": "Cloud Web Developer (Journeyman)",
        "description": "The services performed for this role include, but are not limited to, employing process improvements and reengineering methodologies and principles for systems and projects using Cloud Computing. Creates project plans to achieve performance-based objectives, enhancing Cloud implementation, systems and service. Provides integral support in mission requirements determination, conceptualization, design, development, testing, verification and validation, documentation, implementation, and migration of Cloud system applications. Formulates and defines system scope and objectives, develops or modifies processes to solve complex problems for computer systems and business and system interfaces to achieve desired results through the use of innovative Cloud technologies. Develops software to implement business process using Cloud Services. Develops application programs in support of clients mission following software development lifecycle, including design of application using UI/UX, writes application program using various computer programming languages, develops scripts and automation for code deployment using DevSecOps processes. Develops plans for testing computer systems and applications that includes developing test cases, writing test scripts, automating the testing process using DevOps process and also conducts independent verification and validation (IV&V) testing.  Develops and applies advanced engineering and design methods, theories, and research techniques in the investigation and solution of complex and advanced system requirements, hardware/software interfaces and applications, and solutions. Responsible for design, development, engineering, integration, and architecture. Senior staff manages, plans, and conducts major phases of significant projects. The work complexity and responsibility will be greater at higher levels.",
        "sin": "518210C",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "81.26",
        "minimum_education": "Associates",
        "minimum_years_of_education": "4.0",
        "education_and_experience_substitution": "PhD + 0 years' experience; Masters + 0 year experience; Bachelors + 2 years' experience; High School + 6 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Cloud,Web,Developer,Journeyman,Reengineering",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Associates",
      "years_experience": "PhD + 0 years' experience; Masters + 0 year experience; Bachelors + 2 years' experience; High School + 6 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Cloud Web Developer (Senior)",
      "hourly_rate": 97.51,
      "source_sheet_name": "Price List",
      "source_row_number": 20,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-018",
        "title": "Cloud Web Developer (Senior)",
        "description": "Services performed include, but are not limited to, contributing to overall strategic vision and integrates a broad range of solutions in support of client requirements for IT projects that includes cloud solutions. Formulates and defines system scope and objectives, develops or modifies processes to solve complex problems for computer systems and business and system interfaces to achieve desired results through the use of innovative cloud technologies. Develops software to implement business process using cloud services. Develops application programs in support of clients mission following software development lifecycle, including design of application using UI/UX, writes application program using various computer programming languages, develops scripts and automation for code deployment using cloud Continuous Integration (CI), Continuous Development and Continuous Deployment (CD) processes using DevOps and DevSecOps processes. Develops plans for testing computer systems and applications that includes developing test cases, writing test scripts, automating the testing process using DevOps process and also conducts independent verification and validation (IV&V) testing.  Develops and applies advanced engineering and design methods, theories, and research techniques in the investigation and solution of complex and advanced system requirements, hardware/software interfaces and applications, and solutions. Responsible for design, development, engineering, integration, and architecture. Senior staff manages, plans, and conducts major phases of significant projects. The work complexity and responsibility will be greater at higher levels.",
        "sin": "518210C",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "97.51",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "PhD + 0 years' experience; Masters + 1 year experience; Associates + 5 years' experience; High School + 7 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Cloud,Web,Developer,Senior,Solutions",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 0 years' experience; Masters + 1 year experience; Associates + 5 years' experience; High School + 7 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "HACS Computer Security System Specialist – Level I",
      "hourly_rate": 91.63,
      "source_sheet_name": "Price List",
      "source_row_number": 21,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-019",
        "title": "HACS Computer Security System Specialist – Level I",
        "description": "Supports cybersecurity system planning, analysis, design, development, documentation, testing, training, operations, measurement/reporting, and administration across cloud and support infrastructure. Assists leadership in penetration testing and security assessments to remediate vulnerabilities and threats, ensuring compliance with regulatory standards and industry best practices. Analyzes user requirements to determine business, functional, and cross-functional needs, performing functional allocation to identify required tasks, interdependencies, and necessary resources. Defines and designs security requirements addressing cybersecurity concerns, gathering technical data on organizational missions, existing security solutions, and ongoing initiatives. Conducts risk analyses and assessments, providing technical oversight for secure software development, cloud security, and integration. Reviews deliverables for accuracy, adherence to design principles, and user standards. Demonstrates expertise in Security/IA solutions including PKI, VPN, firewalls, and intrusion detection systems. Recommends solutions for security/IA issues informed by comprehensive understanding of IA products, their limitations, and cybersecurity disciplines. Offers strategic advice on technology integration, capital investments, organizational structures, staffing, and lean performance methodologies.",
        "sin": "54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "91.63",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "2.0",
        "education_and_experience_substitution": "PhD + 0 years' experience; Masters + 0 years' experience; Associates + 4 years' experience; High School + 6 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Computer,Security,System,Specialist,Cloud",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 0 years' experience; Masters + 0 years' experience; Associates + 4 years' experience; High School + 6 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "HACS Computer Security System Specialist – Level II",
      "hourly_rate": 121.87,
      "source_sheet_name": "Price List",
      "source_row_number": 22,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-020",
        "title": "HACS Computer Security System Specialist – Level II",
        "description": "Provides cybersecurity planning, analysis, design, development, documentation, testing, training, operational support, measurement/reporting, and administration across cloud environments, processes, support infrastructure, capabilities, and programs. Assists leadership in penetration testing and security assessments to remediate identified vulnerabilities or threats, ensuring compliance with regulatory standards and best practices. Analyzes user requirements to determine business, functional, and cross-functional needs. Performs functional allocation, identifies required tasks, task interrelationships, and necessary resources. Defines and designs security requirements addressing cybersecurity issues, gathering and structuring technical information related to organizational mission objectives, existing security products, and ongoing programs. Conducts risk analyses and assessments, and provides technical guidance for secure software development, cloud security, and integration tasks, including rigorous reviews of deliverables for accuracy and adherence to design concepts and user standards. Possesses expertise in Security/Information Assurance (IA) tools and products, including PKI, VPN, firewalls, and intrusion detection systems. Evaluates and recommends solutions to security/IA issues leveraging deep understanding of IA products, awareness of their limitations, and comprehensive knowledge of cybersecurity disciplines. Offers strategic recommendations for technology integration, capital investment, organizational structuring, staffing, and the implementation of lean performance execution, processes, and metrics.",
        "sin": "54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "121.87",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "PhD + 1 year experience; Masters + 3 years' experience; Associates + 7 years' experience; High School + 9 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Computer,Security,System,Specialist,Cloud",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 1 year experience; Masters + 3 years' experience; Associates + 7 years' experience; High School + 9 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "HACS Computer Security System Specialist – Level III",
      "hourly_rate": 154.67,
      "source_sheet_name": "Price List",
      "source_row_number": 23,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-021",
        "title": "HACS Computer Security System Specialist – Level III",
        "description": "Leads cybersecurity planning, analysis, design, development, documentation, testing, training, operational management, measurement/reporting, and administration across cloud environments, processes, infrastructure, capabilities, and programs. Directs teams conducting penetration and security assessments, ensuring prompt remediation of identified vulnerabilities or threats and compliance with regulatory standards and best practices. Analyzes user requirements to determine comprehensive business, functional, and cross-functional needs. Oversees functional allocation activities, identifies necessary tasks, delineates interdependencies, and allocates required resources. Defines and designs robust security requirements addressing cybersecurity challenges, collecting and structuring technical information related to organizational mission objectives, existing security solutions, and ongoing initiatives. Performs and oversees risk analyses and assessments, providing advanced technical oversight and guidance for secure software development, cloud security, and integration tasks. Reviews deliverables rigorously for accuracy, alignment with design standards, and user expectations. Demonstrates extensive expertise in Security/Information Assurance (IA) tools including PKI, VPN, firewalls, and intrusion detection systems. Develops and recommends solutions for complex security/IA problems through comprehensive understanding of IA technologies, their constraints, and cybersecurity best practices. Provides strategic recommendations for technology adoption, capital investment decisions, organizational structuring, staffing models, and implementation of lean performance execution, processes, and metrics.",
        "sin": "54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "154.67",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "education_and_experience_substitution": "PhD + 4 years' experience; Masters + 6 years' experience; Associates + 10 years' experience; High School + 12 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Computer,Security,System,Specialist,Cloud",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 4 years' experience; Masters + 6 years' experience; Associates + 10 years' experience; High School + 12 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "HACS Cyber Analyst I",
      "hourly_rate": 93.85,
      "source_sheet_name": "Price List",
      "source_row_number": 24,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-022",
        "title": "HACS Cyber Analyst I",
        "description": "Researches and analyzes information systems to meet the cybersecurity needs of an organization including identifying, assessing, and documenting vulnerabilities across enterprise networks, systems, and applications. Assists in the collection and analysis of threat intelligence, security event data, and log files to detect potential cybersecurity incidents or anomalous behavior. Participates in security assessments, incident response activities, and baseline security configuration reviews under guidance from senior analysts. Consults with users to identify current operating procedures, problems, and requirements. Documents installation, maintenance, and operating procedures. May create coding and logic specifications for developers. This is an entry-level position intended to build foundational expertise across one or more HACS service areas such as Risk and Vulnerability Assessments, Cyber Hunt, and Incident Response.",
        "sin": "54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "93.85",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "0.0",
        "education_and_experience_substitution": "PhD + 0 years' experience; Masters + 0 years' experience; Associates + 2 years' experience; High School + 4 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Cyber,Analyst,Systems,Cybersecurity,Procedures",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 0 years' experience; Masters + 0 years' experience; Associates + 2 years' experience; High School + 4 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "HACS Cyber Analyst II",
      "hourly_rate": 109.84,
      "source_sheet_name": "Price List",
      "source_row_number": 25,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-023",
        "title": "HACS Cyber Analyst II",
        "description": "Performs advanced cybersecurity analysis and threat identification across enterprise systems in support of risk and vulnerability assessments, cyber hunt operations, and incident response. Supports the design and execution of security assessments, including analysis of network configurations, access controls, and security policies. Analyzes system and application logs to detect indicators of compromise (IOCs) and identify anomalous behavior or policy violations. Contributes to the development of technical documentation, including assessment reports, system security plans, and remediation plans. Assists in scoping the complexity, resources, and timelines for cybersecurity tasks. Utilizes threat modeling, vulnerability scanning, and other diagnostic tools to evaluate cybersecurity posture and provide recommendations for mitigation. Researches, analyzes, and designs information systems to meet the cybersecurity needs of an organization. Consults with users to identify current operational procedures, problems, and requirements. Designs models and utilizes analysis and solution development methods, including process maps, flow charts, and diagrams. Scopes project costs and timelines. Documents installation, maintenance, and operating procedures. May create coding and logic specifications for developers.",
        "sin": "54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "109.84",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "2.0",
        "education_and_experience_substitution": "PhD + 0 years' experience; Masters + 0 years' experience; Associates + 4 years' experience; High School + 6 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Cyber,Analyst,Systems,Cybersecurity,Procedures",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 0 years' experience; Masters + 0 years' experience; Associates + 4 years' experience; High School + 6 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "HACS Cyber Program Manager",
      "hourly_rate": 200.1,
      "source_sheet_name": "Price List",
      "source_row_number": 26,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-024",
        "title": "HACS Cyber Program Manager",
        "description": "Responsible for comprehensive management and successful execution of cybersecurity-related projects and programs in alignment with contractual requirements. Oversees tracking and reporting of cybersecurity project progress, performance metrics, and proactively ensures timely delivery of products and services meeting client expectations and standards. Accountable for ensuring all activities are executed in compliance with established IT and cybersecurity quality standards. Demonstrates extensive experience directing and managing complex cybersecurity program and project initiatives, ensuring delivery of high-quality technical products. Independently manages contract support operations, effectively coordinating multiple mid- to large-scale cybersecurity programs and projects, overseeing diverse teams and resources.",
        "sin": "54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "200.1",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "education_and_experience_substitution": "PhD + 6 years' experience; Masters + 8 years' experience; Associates + 12 years' experience; High School + 14 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Cyber,Program,Manager,Performance,Products",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 6 years' experience; Masters + 8 years' experience; Associates + 12 years' experience; High School + 14 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "HACS Cyber Project Manager",
      "hourly_rate": 136.91,
      "source_sheet_name": "Price List",
      "source_row_number": 27,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-025",
        "title": "HACS Cyber Project Manager",
        "description": "Coordinates comprehensive planning, organization, control, integration, and successful completion of cybersecurity projects. Manages cybersecurity-focused teams and directly supervises experienced specialists. Serves as the primary point of contact with government stakeholders, facilitating clear communication, monitoring workflow, and regularly reporting on project status and progress. Actively oversees project activities and proactively implements corrective actions to ensure project objectives are achieved. Performs critical quality assurance functions, ensuring deliverables meet high-quality standards, deadlines, and contractual specifications. Collaborates effectively with internal corporate units and resources to deliver seamless cybersecurity project support, ensuring alignment with organizational goals and compliance with security requirements.",
        "sin": "54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "136.91",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "PhD + 1 year experience; Masters + 3 years' experience; Associates + 7 years' experience; High School + 9 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Cyber,Project,Manager,Support,Compliance",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 1 year experience; Masters + 3 years' experience; Associates + 7 years' experience; High School + 9 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "HACS Cybersecurity Engineer I",
      "hourly_rate": 115.84,
      "source_sheet_name": "Price List",
      "source_row_number": 28,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-026",
        "title": "HACS Cybersecurity Engineer I",
        "description": "Demonstrates extensive experience supporting the comprehensive cybersecurity engineering, architecture, design, and operations of systems, websites, cloud environments, products, and processes from a holistic, integrated systems perspective. Provides specialized consultation and engages actively in cybersecurity planning, analysis, architectural design, system development, rigorous testing, quality assurance, configuration, secure installation, implementation, integration, maintenance, and operational management. Maintains diverse technical proficiency across multiple cybersecurity disciplines, including advanced expertise in mature and emerging security technologies. Operates effectively across organizational boundaries, aligning cybersecurity solutions closely with customer business objectives and security requirements. Analyzes, defines, and thoroughly documents cybersecurity-specific customer needs and functional requirements. Designs, develops, and validates theoretical and practical security models, ensuring that system designs comprehensively address operational impacts, security performance metrics, rigorous testing protocols, secure deployment practices, cost considerations, scheduling, training requirements, ongoing maintenance, and support. Conducts detailed cybersecurity design analyses, reviews, and approves system security specifications and documentation. Determines secure methodologies for system development, testing, and implementation, meticulously planning all cybersecurity development activities and ensuring adherence to appropriate security standards, policies, principles, and industry best practices. Performs security engineering tasks, including assessments of current cybersecurity postures, identifying vulnerabilities, and implementing mitigation strategies. Analyzes cybersecurity system capacity and performance, supports problem resolution, facilitates security enhancements, and oversees comprehensive system security testing. Provides expert technical consultation and responsive support, delivering recommendations to resolve complex cybersecurity challenges under moderate guidance from senior cybersecurity specialists and managers.;",
        "sin": "54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "115.84",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "PhD + 0 years' experience; Masters + 1 year experience; Associates + 5 years' experience; High School + 7 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Cybersecurity,Engineer,Technical,Analysis,Design",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 0 years' experience; Masters + 1 year experience; Associates + 5 years' experience; High School + 7 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "HACS Cybersecurity Engineer II",
      "hourly_rate": 132.83,
      "source_sheet_name": "Price List",
      "source_row_number": 29,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-027",
        "title": "HACS Cybersecurity Engineer II",
        "description": "Demonstrates extensive experience supporting the cybersecurity-focused development and management of systems, websites, cloud environments, products, and processes from a holistic systems perspective. Actively consults, plans, analyzes, designs, develops, tests, assures quality, configures, installs, securely implements, integrates, maintains, and manages cybersecurity systems and infrastructure. Possesses a diverse skill set with recognized expertise across multiple cybersecurity and technical disciplines, including advanced knowledge of mature and emerging cybersecurity technologies. Effectively collaborates across organizational boundaries internally and externally, aligning technical cybersecurity solutions with customer business and security needs. Analyzes, defines, and comprehensively documents cybersecurity-specific customer requirements and functionality. Designs, develops, and rigorously tests theoretical and physical cybersecurity models, carefully considering operational impacts, security performance, testing protocols, secure manufacturing, cost, schedule, training, maintenance, and ongoing support. Conducts detailed cybersecurity design trade analyses, reviews, and approves security specifications and system documentation. Determines secure methodologies for system development, testing, and implementation, and meticulously plans cybersecurity-related execution, ensuring compliance with established standards, policies, principles, and best practices. Performs critical security engineering tasks, including cybersecurity assessments and analyses of current security postures, capacity, and performance to identify vulnerabilities and recommend enhancements. Monitors comprehensive system security testing, proactively addresses complex cybersecurity inquiries, provides specialized technical assistance and consultation, and recommends strategic cybersecurity solutions. Operates effectively both independently and collaboratively within cybersecurity-focused teams, requiring moderate guidance from senior cybersecurity specialists and management.",
        "sin": "54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "132.83",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "PhD + 1 year experience; Masters + 3 years' experience; Associates + 7 years' experience; High School + 9 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Cybersecurity,Engineer,Technical,Analysis,Design",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 1 year experience; Masters + 3 years' experience; Associates + 7 years' experience; High School + 9 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "HACS Cybersecurity Engineer III",
      "hourly_rate": 159.08,
      "source_sheet_name": "Price List",
      "source_row_number": 30,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-028",
        "title": "HACS Cybersecurity Engineer III",
        "description": "Demonstrates robust experience supporting cybersecurity-focused development across systems, websites, cloud environments, products, and processes, ensuring an integrated, total-systems perspective. Provides comprehensive consulting, planning, analysis, design, development, testing, quality assurance, secure configuration, installation, implementation, integration, maintenance, and management of cybersecurity systems. Maintains extensive expertise across multiple technical and cybersecurity disciplines, with advanced knowledge of mature and emerging cybersecurity technologies. Effectively collaborates across internal and external organizational boundaries, aligning cybersecurity solutions closely with customer business requirements and security objectives. Analyzes, defines, and documents cybersecurity-specific user needs and functional requirements. Designs, develops, and tests theoretical and practical cybersecurity models, carefully considering operational impacts, security performance, testing protocols, secure manufacturing processes, cost efficiency, scheduling, training needs, ongoing maintenance, and support. Conducts detailed system-level cybersecurity trade analyses, reviews and approves system security specifications and documentation, determines secure methodologies for system development, testing, and deployment, and ensures adherence to relevant standards, policies, principles, and best practices. Performs critical security engineering tasks, including comprehensive cybersecurity assessments to evaluate current security postures, system capacity, and performance, facilitating effective problem resolution and security enhancements. Monitors rigorous cybersecurity system tests and promptly responds to inquiries, providing expert technical assistance, consultation, and actionable advice on complex cybersecurity issues. Capable of operating independently as well as collaboratively within cybersecurity-focused teams.",
        "sin": "54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "159.08",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "education_and_experience_substitution": "PhD + 4 years' experience; Masters + 6 years' experience; Associates + 10 years' experience; High School + 12 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Cybersecurity,Engineer,Technical,Analysis,Design",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 4 years' experience; Masters + 6 years' experience; Associates + 10 years' experience; High School + 12 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "HACS Cybersecurity SME I",
      "hourly_rate": 144.2,
      "source_sheet_name": "Price List",
      "source_row_number": 31,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-029",
        "title": "HACS Cybersecurity SME I",
        "description": "Provides and supports cybersecurity thought leadership, focusing on Governance, Risk, and Compliance (GRC), Security and Network Engineering, Cloud Security, and Security Operations. Operates with minimal supervision, effectively conducting complex analyses and evaluations. Delivers insightful consultation and analytical support to management-level personnel, assessing existing or proposed processes, applications, systems, security frameworks, and software solutions. Leads or participates actively in project planning, scope definition, control, management, tracking, and review processes. Expertly gathers functional requirements for cybersecurity-related projects, ensuring comprehensive analysis throughout all stages of the system, application, or software development life cycle. This includes detailed planning, requirements definition, architectural design, acquisition, development, secure integration, installation, deployment, performance optimization, rigorous testing, and training. Develops and directs the preparation of detailed documentation reflecting analytical outcomes and actionable cybersecurity recommendations throughout the project life cycle, from initial planning through implementation phases. Facilitates critical meetings, including Joint Application Development (JAD) sessions, effectively bridging the communication gap between functional and technical cybersecurity specialists. Provides robust support for cybersecurity testing activities. Employs advanced methodologies, modeling techniques, tools, and cybersecurity-specific applications, systems, software, and databases to accomplish tasks. Conducts strategic consulting initiatives, including cost-benefit analyses and aligning cybersecurity initiatives with organizational business objectives. Leverages specialized cybersecurity expertise to deliver strategic business consulting, ensures compliance with cybersecurity standards and organizational requirements, and provides staff supervision or management as needed.",
        "sin": "54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "144.2",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "PhD + 1 year experience; Masters + 3 years' experience; Associates + 7 years' experience; High School + 9 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Cybersecurity,SME,Subject,Matter,Expert",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 1 year experience; Masters + 3 years' experience; Associates + 7 years' experience; High School + 9 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "HACS Cybersecurity SME II",
      "hourly_rate": 172.17,
      "source_sheet_name": "Price List",
      "source_row_number": 32,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-030",
        "title": "HACS Cybersecurity SME II",
        "description": "Drives cybersecurity thought leadership, particularly in Governance, Risk, and Compliance (GRC), Security and Network Engineering, Cloud Security, and Security Operations. Independently manages complex analysis and evaluation tasks, providing strategic insights and consulting services to senior management. Conducts thorough evaluations of current and proposed cybersecurity processes, applications, systems, and software solutions. Leads and directs project planning, scope definition, management, tracking, control, and reviews. Actively performs functional requirements gathering for cybersecurity-focused projects and provides comprehensive analytical support throughout the full system, application, or software development lifecycle. This includes strategic planning, requirements analysis, architectural design, secure acquisition and development, integration, installation and deployment, performance optimization, rigorous testing, and training. Directs and performs detailed documentation at various stages of project lifecycles, clearly articulating analytical results and providing actionable cybersecurity recommendations. Facilitates critical meetings, including Joint Application Development (JAD) sessions, effectively bridging communication between functional teams and technical cybersecurity specialists. Supports comprehensive cybersecurity testing activities throughout the project lifecycle. Utilizes advanced methodologies, modeling techniques, estimation tools, and cybersecurity-specific systems, software, and databases to achieve objectives. Performs strategic consulting initiatives, cost-benefit analyses, and ensures alignment between cybersecurity strategies and organizational goals. Provides strategic business consulting based on deep cybersecurity expertise, ensuring compliance with established standards and organizational requirements, and actively manages or supervises cybersecurity teams.",
        "sin": "54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "172.17",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "education_and_experience_substitution": "PhD + 4 years' experience; Masters + 6 years' experience; Associates + 10 years' experience; High School + 12 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Cybersecurity,SME,Subject,Matter,Expert",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 4 years' experience; Masters + 6 years' experience; Associates + 10 years' experience; High School + 12 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "HACS Cybersecurity SME III",
      "hourly_rate": 238.78,
      "source_sheet_name": "Price List",
      "source_row_number": 33,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-031",
        "title": "HACS Cybersecurity SME III",
        "description": "Provides advanced cybersecurity thought leadership in key domains including Governance, Risk, and Compliance (GRC), Security and Network Engineering, Cloud Security, and Security Operations. Independently manages complex analysis and evaluation assignments, delivering expert consultation and strategic insights to senior management. Performs rigorous analysis and evaluation of both existing and proposed cybersecurity processes, applications, systems, and software. Leads or directs comprehensive cybersecurity project planning, scope definition, management, control, tracking, and reviews. Proactively gathers and analyzes functional cybersecurity requirements, guiding project lifecycle phases such as planning, requirements analysis, architecture design, secure acquisition and development, integration, installation/deployment, performance tuning, thorough testing, and targeted training initiatives. Directs and develops detailed documentation capturing analytical results and solution recommendations across all stages of the project lifecycle. Expertly facilitates critical meetings, including Joint Application Development (JAD) sessions, ensuring clear communication between technical specialists and functional teams. Provides senior-level support and oversight for cybersecurity testing throughout the lifecycle. Applies advanced methodologies, modeling techniques, estimation tools, and cybersecurity-specific systems, applications, software, and databases to accomplish objectives. Engages in strategic consulting initiatives, performing cost-benefit analyses and ensuring cybersecurity alignment with organizational business objectives. Leverages deep subject-matter expertise to provide strategic cybersecurity business consulting, ensures compliance with industry standards and organizational requirements, and manages cybersecurity teams and personnel.",
        "sin": "54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "238.78",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "education_and_experience_substitution": "PhD + 6 years' experience; Masters + 8 years' experience; Associates + 12 years' experience; High School + 14 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Cybersecurity,SME,Subject,Matter,Expert",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 6 years' experience; Masters + 8 years' experience; Associates + 12 years' experience; High School + 14 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Application and Data Developer (Journeyman)",
      "hourly_rate": 122.9,
      "source_sheet_name": "Price List",
      "source_row_number": 34,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-032",
        "title": "Application and Data Developer (Journeyman)",
        "description": "Services performed include, but are not limited to, design, develop, test, and deploy custom software applications. Ensure applications meet performance, security, and functional requirements. Write and maintain code using programming languages such as Java, C#, Python, or JavaScript. Integrate applications with existing systems and databases. Develop and maintain data models and databases to support application functionality. Implement data integration solutions to ensure seamless data flow between systems.  Perform data analysis to support application development and troubleshooting. System Design and Architecture support includes, participate in the design and architecture of software systems.; Collaborate with architects and senior developers to create scalable and robust systems. Ensure that system designs adhere to industry best practices and standards. Testing and Quality Assurance support includes, develop and execute unit, integration, and system tests to ensure software quality. Identify and fix defects in software applications. Participate in code reviews and provide feedback to peers. Documentation and Support includes, create and maintain technical documentation for applications and systems. Provide ongoing support and maintenance for deployed applications. Train end-users and provide technical support as needed. Project Collaboration includes, work closely with project managers, business analysts, and other stakeholders to understand project requirements. Contribute to project planning and estimation activities. Communicate progress and issues to project stakeholders regularly",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "122.9",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "PhD + 1 year experience; Masters + 3 years' experience; Associates + 7 years' experience; High School + 9 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Application,Data,Developer,Journeyman,Design",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 1 year experience; Masters + 3 years' experience; Associates + 7 years' experience; High School + 9 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Application Developer",
      "hourly_rate": 120.1,
      "source_sheet_name": "Price List",
      "source_row_number": 35,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-033",
        "title": "Application Developer",
        "description": "Perform highly complex analysis, design, development, testing, and debugging software/application/system. Develop solutions to address the unique mission of our clients through Leading-edge tools, forward leaning technologies, and flexible engineering labs. Develop system architecture (such as object-oriented software design use REST or SOAP Web Services), and develop solutions using various scripting languages such as Java, JavaScript, AngularJS, jQuery, Spring, RDMS, Weblogic, JPA/Hibernate, or Java EE.  Designs, codes, tests, debugs, and documents programs.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "120.1",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "PhD + 0 years' experience; Masters + 1 year experience; Associates + 5 years' experience; High School + 7 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Applications,Developer,Analysis,Design,Testing",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 0 years' experience; Masters + 1 year experience; Associates + 5 years' experience; High School + 7 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Business Analyst",
      "hourly_rate": 122.88,
      "source_sheet_name": "Price List",
      "source_row_number": 36,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-034",
        "title": "Business Analyst",
        "description": "Works under the overall direction of the Program/Project Manager to align requirements, analyze designs, and assist in the implementation of the system. Provides technical, managerial, and administrative direction for problem definition, analysis, requirements development, and requirements implementation. Provides recommendations and advises on organizational wide system improvements, optimization or maintenance efforts for information systems in the following specialties: information systems architecture; networking; telecommunications; software deployment automation; communications protocols; risk management or electronic analysis; web application; software; life-cycle management; software development methodologies; and modeling and simulation. Applies an enterprise-wide set of disciplines and processes for planning, analyzing, designing, constructing, and implementing information systems. Develops analytical and computational techniques and methodology for problem resolutions.  Performs process and data modeling in support of the systems planning and analysis efforts.  Employs reverse engineering and reengineering disciplines to develop migration and planning documents. Excellent oral and written communication skills with all levels of management, contractors, and client agency representatives.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "122.88",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "PhD + 1 year experience; Masters + 3 years' experience; Associates + 7 years' experience; High School + 9 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Business,Analyst,Design,Assist,Technical",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 1 year experience; Masters + 3 years' experience; Associates + 7 years' experience; High School + 9 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Computer Systems Analyst – Level II",
      "hourly_rate": 82.34,
      "source_sheet_name": "Price List",
      "source_row_number": 37,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-035",
        "title": "Computer Systems Analyst – Level II",
        "description": "The services performed for this role include, but are not limited to, applying management analysis processes, statistical methods, business models, and advanced technical, analytical research, and data-driven techniques to determine solutions based on client requirements with an IT services/solutions-based scope. Employs process improvements and reengineering methodologies and principles for modernization of systems and projects. Creates project plans to achieve performance-based objectives, enhancing implementation, systems and service. Provides integral support in mission requirements determination, conceptualization, design, development, testing, verification and validation, documentation, and implementation of system applications. Prepares and conducts business analyses and studies, needs assessments, requirements analysis/definition and cost/benefit analyses in an effort to align business systems, business process, business architecture, business reengineering, business Intelligence, business solutions and initiatives. Prepares forecasts and analyzes trends, reporting regulations and business conditions. Develops and analyzes metrics, performance measurements, requirements, reports and recommendations related to management, organizational structure, policy/procedures and business systems. Develops software to implement business process. Develops application programs following software development lifecycle, including design of application using UI/UX, writes application program using various computer programming languages, develops scripts and automation for code deployment using CI/CD processes using DevOps and DevSecOps processes. Develops plans for testing computer systems and applications.  Develops and applies advanced engineering and design methods, theories, and research techniques in the investigation and solution of complex and advanced system requirements, hardware/software interfaces and applications, and solutions. Responsible for design, development, engineering, integration, and architecture. The work complexity and responsibility will be greater at higher levels.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "82.34",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "1.0",
        "education_and_experience_substitution": "PhD + 0 years' experience; Masters + 0 years' experience; Associates + 3 years' experience; High School + 5 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "IT,Computer,Systems,Analyst,Processes",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 0 years' experience; Masters + 0 years' experience; Associates + 3 years' experience; High School + 5 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Enterprise Architect",
      "hourly_rate": 167.23,
      "source_sheet_name": "Price List",
      "source_row_number": 38,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-036",
        "title": "Enterprise Architect",
        "description": "Under the guidance of the Program/Project Manager, develop solutions for various IT projects who is responsibilities include organization, direction, coordination, and planning of all support activities and daily supervision and direction to staff.   Knowledgeable with information technology systems architecture and development, strategic data planning and information security. Knowledgeable in acquisition of hardware/software, software module integration and testing, system deployment, maintenance and repair, training, and preparation of system documentation. Proficient in the development of Internet applications, business process re-engineering, database systems design, evaluation of alternative implementation.  Establishes system information requirements using analysis of the information in the development of enterprise-wide or large-scale information systems. Designs architecture to include the software, hardware, and communications to support the total requirements as well as provide for present and future cross-functional requirements and interfaces.  Analytically and systematically evaluates problems of work flows, organization, and planning and develops appropriate corrective action. Excellent oral and written communication skills with all levels of management, contractors, and client agency representatives.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "167.23",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "education_and_experience_substitution": "PhD + 4 years' experience; Masters + 6 years' experience; Associates + 10 years' experience; High School + 12 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Enterprise,Architect,IT,Coordination,Organization",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 4 years' experience; Masters + 6 years' experience; Associates + 10 years' experience; High School + 12 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Enterprise Architect (Journeyman)",
      "hourly_rate": 123.81,
      "source_sheet_name": "Price List",
      "source_row_number": 39,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-037",
        "title": "Enterprise Architect (Journeyman)",
        "description": "Services performed include, but are not limited to, translating of business requirements and analysis information into enterprise architecture, technical system designs and the development and deployment of effective application systems based on those technical designs. Develops technical work products and provides technical leadership in enterprise architecture including business, data, application, and technology architectures as well as security and network/infrastructure architectures. Also provides technical leadership in full life cycle system development, system conversion, implementation support, system integration services. Provides support for structured development techniques. May create, modify, and maintain computer software programs. Schedules reviews of work products with the development team and addresses the consistency, maintainability, and reliability of the applications being development.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "123.81",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "PhD + 1 year experience; Masters + 3 years' experience; Associates + 7 years' experience; High School + 9 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Enterprise,Architect,Journeyman,Analysis,Information",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 1 year experience; Masters + 3 years' experience; Associates + 7 years' experience; High School + 9 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Information Assurance/Security Specialist (Master)",
      "hourly_rate": 129.41,
      "source_sheet_name": "Price List",
      "source_row_number": 40,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-038",
        "title": "Information Assurance/Security Specialist (Master)",
        "description": "The services performed for this role include, but are not limited to, applying management analysis processes, statistical methods, business models, and advanced technical, analytical research, and data-driven techniques to determine solutions based on client requirements with an IT services/solutions-based scope. Employs process improvements and reengineering methodologies and principles for modernization of systems and projects. Creates project plans to achieve performance-based objectives, enhancing implementation, systems and service. Provides integral support in mission requirements determination, conceptualization, design, development, testing, verification and validation, documentation, and implementation of system applications. Guides and assists clients through a wide range of management, organizational and business improvement and modernization initiatives by applying continuous process improvement strategies, methodologies and principles. Develops business methods for problem solving, process change and solutions implementation ensuring enterprise-wide integration. Contribute to overall strategic vision and integrates a broad range of solutions in support of client requirements for IT projects that includes cloud and onprem environments. Formulates and defines system scope and objectives, develops or modifies processes to solve complex problems for computer systems and business and system interfaces to achieve desired results through the use of innovative technologies and solutions. Performs day-to-day management of delivery order projects. Organizes, directs, and coordinates the planning and production of all activities associated with assigned delivery order projects using various software development methodologies. Conducts Cyber security reviews applying security standards, policies, and procedures to certify business application and systems for use. The work complexity and responsibility will be greater at higher levels.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "129.41",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "7.0",
        "education_and_experience_substitution": "PhD + 3 years' experience; Masters + 5 years' experience; Associates + 9 years' experience; High School + 11 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "IT,Information,Assurance,Security,Specialist",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 3 years' experience; Masters + 5 years' experience; Associates + 9 years' experience; High School + 11 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Information Assurance/Security Specialist (Senior)",
      "hourly_rate": 138.13,
      "source_sheet_name": "Price List",
      "source_row_number": 41,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-039",
        "title": "Information Assurance/Security Specialist (Senior)",
        "description": "The services performed for this role include, but are not limited to, applying management analysis processes, statistical methods, business models, and advanced technical, analytical research, and data-driven techniques to determine solutions based on client requirements with an IT services/solutions-based scope. Employs process improvements and reengineering methodologies and principles for modernization of systems and projects. Creates project plans to achieve performance-based objectives, enhancing implementation, systems and service. Provides integral support in mission requirements determination, conceptualization, design, development, testing, verification and validation, documentation, and implementation of system applications. Guides and assists clients through a wide range of management, organizational and business improvement and modernization initiatives by applying continuous process improvement strategies, methodologies and principles. Develops business methods for problem solving, process change and solutions implementation ensuring enterprise-wide integration. Contribute to overall strategic vision and integrates a broad range of solutions in support of client requirements for IT projects that includes cloud and onprem environments. Formulates and defines system scope and objectives, develops or modifies processes to solve complex problems for computer systems and business and system interfaces to achieve desired results through the use of innovative technologies and solutions. Performs day-to-day management of delivery order projects. Organizes, directs, and coordinates the planning and production of all activities associated with assigned delivery order projects using various software development methodologies. Conducts Cyber security reviews applying security standards, policies, and procedures to certify business application and systems for use. The work complexity and responsibility will be greater at higher levels.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "138.13",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "education_and_experience_substitution": "PhD + 4 years' experience; Masters + 6 years' experience; Associates + 10 years' experience; High School + 12 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "IT,Information,Assurance,Security,Specialist",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 4 years' experience; Masters + 6 years' experience; Associates + 10 years' experience; High School + 12 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Information Technology Consultant",
      "hourly_rate": 152.9,
      "source_sheet_name": "Price List",
      "source_row_number": 42,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-040",
        "title": "Information Technology Consultant",
        "description": "Works under general supervision of overall project manager to design, integrate, and implement the software/application/system.  Provides technical, managerial, and administrative direction for problem definition, analysis, requirements development, and requirements implementation. Provides recommendations and advises on organizational wide system improvements, optimization or maintenance efforts for information systems in the following specialties: information systems architecture; networking; telecommunications; software deployment automation; communications protocols; risk management or electronic analysis; web application; software; life-cycle management; software development methodologies; and modeling and simulation.  Applies an enterprise-wide set of disciplines and processes for planning, analyzing, designing, constructing, and implementing information systems.  Develops analytical and computational techniques and methodology for problem resolutions.  Performs process and data modeling in support of the systems planning and analysis efforts. Employs reverse engineering and reengineering disciplines to develop migration and planning documents.  Supervises information engineers assigned to support system development or analysis efforts.  Excellent oral and written communication skills with all levels of management, contractors, and client agency representatives.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "152.9",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "education_and_experience_substitution": "PhD + 4 years' experience; Masters + 6 years' experience; Associates + 10 years' experience; High School + 12 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Information,Technology,Consultant,Design,Integrate",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 4 years' experience; Masters + 6 years' experience; Associates + 10 years' experience; High School + 12 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "IT Security Assessor",
      "hourly_rate": 116.07,
      "source_sheet_name": "Price List",
      "source_row_number": 43,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-041",
        "title": "IT Security Assessor",
        "description": "The services performed for this role include, but are not limited to designing, developing, engineering, and implementing integrated security system solutions that will ensure proprietary/confidential data and systems are protected. Gathers and organizes technical information about an organization's mission goals and needs, existing security products, and ongoing programs in computer security in the strategic design process to translate security and business requirements into technical designs. Configures and validates secure systems; tests security products and systems to detect security weakness. Conducts system testing and verification, develops documentation to obtain Authority to Operate (ATO), aids in FISMA process. Supports FedRAMP review and audit process, also helps to obtain FedRAMP for cloud-based services. Conducts regular audits to ensure that systems are being operated securely, and computer security policies and procedures are being implemented as defined in security plans. Duties include architecture design, system/network analysis, vulnerability and risk assessments, and security assessment of hardware and software. Performs duties on tasks that require expertise in firewall, cyber, cyber engineering, security operations, secops, cloud computing, implementation/configuration, physical security analysis of facilities, security assessment/risk analysis, security design of local area networks and wide area networks, security analysis of network operating systems and applications, continuity of operations, planning, policy development and disaster recovery for cloud and on-prem environments. ; Services performed also include, but are not limited to, contributing to overall strategic vision and integrates a broad range of solutions in support of client requirements for IT projects that includes cloud and onprem environments.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "116.07",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "PhD + 1 year experience; Masters + 3 years' experience; Associates + 7 years' experience; High School + 9 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "IT,Security,Assessor,Technical,Analytical",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 1 year experience; Masters + 3 years' experience; Associates + 7 years' experience; High School + 9 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Mid-level Technical Architect",
      "hourly_rate": 117.04,
      "source_sheet_name": "Price List",
      "source_row_number": 44,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-042",
        "title": "Mid-level Technical Architect",
        "description": "The services performed for this role include, but are not limited to, applying management analysis processes, statistical methods, business models, and advanced technical, analytical research, and data-driven techniques to determine solutions based on client requirements with an IT services/solutions-based scope. Analyzes operational activities to obtain a quantitative, rational basis for decision making and resource allocation. Employs process improvements and reengineering methodologies and principles for modernization of systems and projects. Creates project plans to achieve performance-based objectives, enhancing implementation, systems and service. Provides integral support in mission requirements determination, conceptualization, design, development, testing, verification and validation, documentation, and implementation of system applications. Senior staff manages, plans, and conducts major phases of significant projects. The work complexity and responsibility will be greater at higher levels. Services performed also include, but are not limited to, contributing to overall strategic vision and integrates a broad range of solutions in support of client requirements for IT projects that includes cloud and onprem environments. Formulates and defines system scope and objectives, develops or modifies processes to solve complex problems for computer systems and business and system interfaces to achieve desired results through the use of innovative technologies. Develops software to implement business process. Develops application programs in support of clients mission following software development lifecycle, including design of application using UI/UX, writes application program using various computer programming languages, develops scripts and automation for code deployment using Continuous Integration (CI), Continuous Development and Continuous Deployment (CD) processes using DevOps and DevSecOps processes. Develops plans for testing computer systems and applications that includes developing test cases, writing test scripts, automating the testing process using DevOps process and also conducts independent verification and validation (IV&V) testing.  Develops and applies advanced engineering and design methods, theories, and research techniques in the investigation and solution of complex and advanced system requirements, hardware/software interfaces and applications, and solutions. Responsible for design, development, engineering, integration, and architecture. Senior staff manages, plans, and conducts major phases of significant projects. The work complexity and responsibility will be greater at higher levels.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "117.04",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "PhD + 0 years' experience; Masters + 1 year experience; Associates + 5 years' experience; High School + 7 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "IT,Mid-level,Technical,Architect,Models",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 0 years' experience; Masters + 1 year experience; Associates + 5 years' experience; High School + 7 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Project Manager II",
      "hourly_rate": 133.78,
      "source_sheet_name": "Price List",
      "source_row_number": 45,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-043",
        "title": "Project Manager II",
        "description": "Works under general supervision of overall program manager of higher-level company/client management responsible for the management of a specific task, or for a particular portion of a larger, more complex project.  Plan and implement activities by the project team to define and implement technical baseline and meet quality requirements for products and services;  Direct project team personnel, manage cost and schedule, ensure contract compliance, and serve as principal customer interface for project delivery; Analyzes project related problems and creates innovative solutions involving finance, scheduling, technologies, methodologies, tools, and solution components; Provides the day-to-day management of technical projects and directs, organizes, and coordinates the planning and production of project deliverables; Excellent oral and written communication skills with all levels of management, contractors, and client agency representatives.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "133.78",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "education_and_experience_substitution": "PhD + 4 years' experience; Masters + 6 years' experience; Associates + 10 years' experience; High School + 12 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Project,Manager,Plan,Implement,Team",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 4 years' experience; Masters + 6 years' experience; Associates + 10 years' experience; High School + 12 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Security Engineer (Journeyman)",
      "hourly_rate": 127.07,
      "source_sheet_name": "Price List",
      "source_row_number": 46,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-044",
        "title": "Security Engineer (Journeyman)",
        "description": "Services performed include, but are not limited to design, implement, and manage security measures for information systems to safeguard sensitive data and ensure compliance with industry standards and government regulations. Conduct risk assessments and vulnerability analysis to identify and mitigate potential security threats. Develop and maintain security policies, procedures, and protocols to protect information assets. Monitor security infrastructure and systems for anomalies, breaches, and incidents; respond to security events in a timely and effective manner. Collaborate with IT and network teams to integrate security controls into system architectures. Provide hands on development, testing, and automation of DevOps and DevSecOps processes including configuring tools, services, and infrastructure with system and applications to automate the development, testing, security, and deployment. Perform regular security audits and assessments and provide recommendations for improving security posture. Stay updated with the latest security trends, threats, and technology solutions to proactively address potential vulnerabilities.  Security Systems Management support includes, Configure, deploy, and manage security technologies such as firewalls, intrusion detection/prevention systems, and encryption solutions . Incident Response support includes, develop, and implement incident response plans; lead the investigation and resolution of security incidents and breaches. Compliance and Reporting includes, ensure compliance with relevant security standards and regulations; prepare detailed reports and documentation for security audits and regulatory reviews. Training and Awareness includes, conduct security training and awareness programs for staff to promote best practices and enhance the overall security culture within the organization.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "127.07",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "PhD + 1 year experience; Masters + 3 years' experience; Associates + 7 years' experience; High School + 9 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Security,Engineer,Journeyman,Design,Develop",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 1 year experience; Masters + 3 years' experience; Associates + 7 years' experience; High School + 9 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Senior Security Consultant",
      "hourly_rate": 143.27,
      "source_sheet_name": "Price List",
      "source_row_number": 47,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-045",
        "title": "Senior Security Consultant",
        "description": "The services performed include, but are not limited to, applying management analysis processes, statistical methods, business models, and advanced technical, analytical research, to determine solutions. Creates project plans to enhance implementation, systems and service. Provides integral support in mission requirements determination, conceptualization, design, development, testing, verification and validation, documentation, and implementation of system applications. Design, develop, engineer, and implement integrated security system solutions that will ensure proprietary/confidential data and systems are protected. Gathers and organizes technical information about an organization's mission goals and needs, existing security products, and ongoing programs in computer security in the strategic design process to translate security and business requirements into technical designs. Configures and validates secure systems; tests security products and systems to detect security weakness. Conducts system testing and verification, develops documentation to obtain Authority to Operate (ATO), aids in FISMA process. Supports FedRAMP review and audit process, helps to obtain FedRAMP for cloud-based services. Conducts regular audits to ensure that systems are operated securely, and computer security policies and procedures are being implemented as defined in security plans. Duties include architecture design, system/network analysis, vulnerability and risk assessments, and security assessment of hardware and software. Performs duties on tasks that require expertise in firewall, cyber, cyber engineering, security operations, cloud computing, implementation/configuration, physical security analysis of facilities, security assessment/risk analysis, security design of local area networks and wide area networks, security analysis of network operating systems and applications, continuity of operations, planning, policy development and disaster recovery for cloud and on-prem environments.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "143.27",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "education_and_experience_substitution": "PhD + 6 years' experience; Masters + 8 years' experience; Associates + 12 years' experience; High School + 14 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "IT,Senior,Security,Consultant,Management",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 6 years' experience; Masters + 8 years' experience; Associates + 12 years' experience; High School + 14 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Senior Technical Architect",
      "hourly_rate": 131.55,
      "source_sheet_name": "Price List",
      "source_row_number": 48,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-046",
        "title": "Senior Technical Architect",
        "description": "Services performed include, but are not limited to, contributing to overall strategic vision and integrates a broad range of solutions in support of client requirements for IT projects that includes cloud and onprem environments. Formulates and defines system scope and objectives, develops or modifies processes to solve complex problems for computer systems and business and system interfaces to achieve desired results through the use of innovative technologies. Develops software to implement business process. Develops application programs in support of clients mission following software development lifecycle, including design of application, writes application program using various computer programming languages, develops scripts and automation for code deployment. Develops and applies advanced engineering and design methods, theories, and research techniques in the investigation and solution of complex and advanced system requirements, hardware/software interfaces and applications, and solutions. Responsible for design, development, engineering, integration, and architecture. Gathers and organizes technical information about an organization's mission goals and needs, existing security products, and ongoing programs in computer security in the strategic design process to translate security and business requirements into technical designs. Duties include architecture design, system/network analysis, vulnerability and risk assessments, and security assessment of hardware and software. Performs duties on tasks that require expertise in firewall, cyber, cyber engineering, security operations, cloud computing, implementation/configuration, physical security analysis of facilities, security assessment/risk analysis, security design of local area networks and wide area networks, security analysis of network operating systems and applications, continuity of operations, planning, policy development and disaster recovery for cloud and on-prem environments.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "131.55",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "9.0",
        "education_and_experience_substitution": "PhD + 7 years' experience; Masters + 9 years' experience; Associates + 11 years' experience; High School + 13 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "IT,Senior,Technical,Architect,Processes",
        "domestic__overseas_or_domestic_and_overseas": "Domestic",
        "dol_occupation_code": "x",
        "dol_wage_determination": "x"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 7 years' experience; Masters + 9 years' experience; Associates + 11 years' experience; High School + 13 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "SME - Computer Systems Analyst",
      "hourly_rate": 103.0,
      "source_sheet_name": "Price List",
      "source_row_number": 49,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-047",
        "title": "SME - Computer Systems Analyst",
        "description": "The services performed for this role include, but are not limited to, applying management analysis processes, statistical methods, business models, and advanced technical, analytical research, and data-driven techniques to determine solutions based on client requirements with an IT services/solutions-based scope. Analyzes operational activities to obtain a quantitative, rational basis for decision making and resource allocation. Employs process improvements and reengineering methodologies and principles for modernization of systems and projects. Creates project plans to achieve performance-based objectives, enhancing implementation, systems and service. Provides integral support in mission requirements determination, conceptualization, design, development, testing, verification and validation, documentation, and implementation of system applications. Senior staff manages, plans, and conducts major phases of significant projects. The work complexity and responsibility will be greater at higher levels. Services performed also include, but are not limited to, engineering and scientific tasks in planning, development, production, operations and maintenance environments, which are broad in nature and are concerned with the design including user experience and wireframe design, development, layout, and testing of devices or systems. Plans and performs engineering/programming, scientific research, studies, and analysis that may include cloud based analytics and tool development; DevOps, DevSecOps, cloud operations, technology planning; applied systems architecture development and integration; applied requirements development; concept development; data structure design; systems and software design, application programming, script development, development and integration; test and evaluation; systems operation; control of systems and components; integrated logistics support; modeling and simulation; configuration management; systems and mission engineering; systems acquisition; and life-cycle management.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "103.0",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "PhD + 0 years' experience; Masters + 1 year experience; Associates + 5 years' experience; High School + 7 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "IT,SME,Computer,Systems,Analyst",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 0 years' experience; Masters + 1 year experience; Associates + 5 years' experience; High School + 7 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "SME (Journeyman)",
      "hourly_rate": 123.32,
      "source_sheet_name": "Price List",
      "source_row_number": 50,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-048",
        "title": "SME (Journeyman)",
        "description": "Provides task-unique functional expertise and in-depth knowledge necessary to interpret requirements, ensure responsiveness and achieve successful performance in a business, operational, engineering, technology,  mathematics, or scientific area. Participates in all phases of the project lifecycle, as needed, and advises IT consultants with the extensive knowledge needed from the specialist for effective implementation. This labor category is designed for other than Information Technology functional expertise, but the expertise is required to support an IT task. This labor category is offered only in conjunction with IT Professional labor categories. Contributing to overall strategic vision and integrates a broad range of solutions in support of client requirements for IT projects. Formulates and defines system scope and objectives, develops or modifies processes to solve complex problems for computer systems and business and system interfaces to achieve desired results through the use of innovative technologies. Develops software to implement business process. Develops application programs in support of clients mission. Develops plans for testing computer systems and applications.  Develops and applies advanced engineering and design methods, theories, and research techniques in the investigation and solution of complex and advanced system requirements, hardware/software interfaces and applications, and solutions. Responsible for design, development, engineering, integration, and architecture. Employs process improvements and reengineering methodologies and principles for modernization of systems and projects. Provides integral support in mission requirements determination, conceptualization, design, development, testing, verification and validation, documentation, and implementation of system applications.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "123.32",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "PhD + 1 year experience; Masters + 3 years' experience; Associates + 7 years' experience; High School + 9 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "IT,Subject,Matter,Expert,Journeyman",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 1 year experience; Masters + 3 years' experience; Associates + 7 years' experience; High School + 9 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Software Engineer",
      "hourly_rate": 133.78,
      "source_sheet_name": "Price List",
      "source_row_number": 51,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-049",
        "title": "Software Engineer",
        "description": "Works with senior application developer under the overall direction of the Program/Project Manager to design and implement the software/application/system. Formulates and defines specifications for complex operating software programming applications or modifies and maintains complex existing applications using engineering releases and utilities from the manufacturer.  Identifies, assesses, and presents options for meeting the functional and technical requirements including, but not limited to, hardware and software updates or upgrades, enhancements, or new capabilities.  Provides overall operating system, such as sophisticated file maintenance routines, large telecommunications networks, computer accounting, and advanced mathematical/scientific software packages. Provides recommendations, as needed, for process or product improvements.  Designs the overall system and formulates system specifications in accordance with applicable standards and regulations. Designs, codes, tests, debugs, and documents programs.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "133.78",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "6.0",
        "education_and_experience_substitution": "PhD + 2 years' experience; Masters + 4 years' experience; Associates + 8 years' experience; High School + 10 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Software,Engineer,Formulates,Defines,Applications",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 2 years' experience; Masters + 4 years' experience; Associates + 8 years' experience; High School + 10 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Solution Architect",
      "hourly_rate": 172.01,
      "source_sheet_name": "Price List",
      "source_row_number": 52,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-050",
        "title": "Solution Architect",
        "description": "Under the guidance of the Program/Project Manager, develop solutions for various IT projects. Designs and develops new software/system/application products or major enhancements to existing software/system/applications. Designs architecture to include the software, hardware, and communications to support the requirements. Develop applications using various web services and service-oriented architecture, and object-oriented analysis and designs. Develop solution architecture and conceptual and logical system designs for large-scale programs and projects. Analyze Big Data concepts, enterprise integration tools, and extract, transformation, and load (ETL) tools.  Identifies, assesses, and presents options for meeting the functional and technical requirements including, but not limited to, hardware and software updates or upgrades, enhancements, or new capabilities; Provide thought leadership in emerging web design technologies, integration, and prototyping, database-driven content, web-based user interfaces, and Agile or Scrum project methodologies; Provide guidance of web-based systems architecture, microservice architecture, service-based architecture, or enterprise application architecture and managing expectations while balancing alternatives against business and financial constraints; Addresses problems of software/system/application integration, compatibility, and multiple platforms; Excellent oral and written communication skills with all levels of management, contractors, and client agency representatives.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "172.01",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "education_and_experience_substitution": "PhD + 4 years' experience; Masters + 6 years' experience; Associates + 10 years' experience; High School + 12 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Solutions,Architect,IT,Design,Develop",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 4 years' experience; Masters + 6 years' experience; Associates + 10 years' experience; High School + 12 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Subject Matter Expert II",
      "hourly_rate": 153.73,
      "source_sheet_name": "Price List",
      "source_row_number": 53,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-051",
        "title": "Subject Matter Expert II",
        "description": "Works under general supervision of overall program/project manager of higher-level company/client management responsible for the management of a specific task, or for a particular portion of a larger, more complex project. Provides high-level consultation support to task personnel involved in performing tasking associated with software development, engineering, analytical, or acquisition projects.  Provides systems engineering support that includes requirements management, scheduling, life cycle management, such as readiness and risk management, or configuration management.  Designs, implements, and sustains complex multi-server environments with disciplines in networks, systems, virtualization, cloud, and IT infrastructure. Develops enterprise automation, monitoring, and configuration management tools, including, but not limited to, Puppet, Chef, or Ansible to manage configuration settings across various Cloud or virtual infrastructures or services. Develops systems maintenance concepts and plans and life-cycle software requirements and processes to meet agency and organizational requirements. Performs cost analyses associated with application systems and develops and reviews systems projects' operating plans and procedures to ensure operational support goals are met. Performs technical training, configuration management, and quality assurance.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "153.73",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "PhD + 1 year experience; Masters + 3 years' experience; Associates + 7 years' experience; High School + 9 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Subject,Matter,Expert,Consultation,Support",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 1 year experience; Masters + 3 years' experience; Associates + 7 years' experience; High School + 9 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "System Developer (Senior)",
      "hourly_rate": 133.29,
      "source_sheet_name": "Price List",
      "source_row_number": 54,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-052",
        "title": "System Developer (Senior)",
        "description": "Services performed include, but are not limited to, experience include the full software development lifecycle, including requirements analysis, design, coding, testing, deployment, and maintenance of complex systems. Experience with system design and architecture responsibilities includes, lead the design and architecture of software systems, ensuring that solutions meet business requirements and adhere to best practices and standards. Develop detailed system specifications, including data models, user interfaces, and integration points. Software Development responsibilities includes, oversee the coding, testing, and debugging of software applications, ensuring high-quality code and adherence to development standards. Utilize advanced programming techniques and languages to develop robust and scalable systems. Project Management responsibilities includes, manage the entire software development lifecycle, including project planning, resource allocation, risk management, and status reporting. Coordinate with stakeholders to ensure project goals are met and deliverables are on time and within budget. Provide technical leadership and mentorship to junior developers, fostering a collaborative and innovative development environment. Conduct code reviews and provide constructive feedback to team members to improve their coding skills and project contributions. Client Interaction responsibilities includes, act as the primary technical liaison with clients, understanding their needs and translating them into technical requirements. Present technical solutions and project updates to clients and gather feedback to ensure satisfaction with the delivered product. Stay updated with the latest industry trends, tools, and technologies to continuously improve development processes and tools.Implement best practices for software development, including Agile methodologies, DevOps practices, and continuous integration/continuous deployment (CI/CD), DevOps, and DevSecOps, AgileOps and Site Reliability Engineer (SRE) practices. Prepare and maintain comprehensive documentation for all developed systems, including technical specifications, user guides, and maintenance manuals. Ensure all software solutions comply with relevant regulations, standards, and security protocols.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "133.29",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "education_and_experience_substitution": "PhD + 4 years' experience; Masters + 6 years' experience; Associates + 10 years' experience; High School + 12 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "System,Developer,Senior,Development,Design",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 4 years' experience; Masters + 6 years' experience; Associates + 10 years' experience; High School + 12 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Web Developer (Journeyman)",
      "hourly_rate": 79.67,
      "source_sheet_name": "Price List",
      "source_row_number": 55,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-053",
        "title": "Web Developer (Journeyman)",
        "description": "The services performed for this role include, but are not limited to, employing process improvements and reengineering methodologies and principles for modernization of systems and projects. Creates project plans to achieve performance-based objectives, enhancing implementation, systems and service. Provides integral support in mission requirements determination, conceptualization, design, development, testing, verification and validation, documentation, and implementation of system applications. Contribute to overall strategic vision and integrates a broad range of solutions in support of client requirements for IT projects. Formulates and defines system scope and objectives, develops or modifies processes to solve complex problems for computer systems and business and system interfaces to achieve desired results through the use of innovative technologies. Develops software to implement business process. Develops application programs in support of clients mission following software development lifecycle, including design of application using UI/UX, writes application program using various computer programming languages, develops scripts and automation for code deployment using DevSecOps processes. Develops plans for testing computer systems and applications that includes developing test cases, writing test scripts, automating the testing process using DevOps process and also conducts independent verification and validation (IV&V) testing.  Develops and applies advanced engineering and design methods, theories, and research techniques in the investigation and solution of complex and advanced system requirements, hardware/software interfaces and applications, and solutions. Responsible for design, development, engineering, integration, and architecture. Senior staff manages, plans, and conducts major phases of significant projects. The work complexity and responsibility will be greater at higher levels.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "79.67",
        "minimum_education": "Associates",
        "minimum_years_of_education": "4.0",
        "education_and_experience_substitution": "PhD + 0 years' experience; Masters + 0 year experience; Bachelors + 2 years' experience; High School + 6 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "IT,Web,Developer,Journeyman,Design",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Associates",
      "years_experience": "PhD + 0 years' experience; Masters + 0 year experience; Bachelors + 2 years' experience; High School + 6 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    },
    {
      "contract_number": "47QTCA18D0099",
      "labor_category": "Web Developer (Senior)",
      "hourly_rate": 95.61,
      "source_sheet_name": "Price List",
      "source_row_number": 56,
      "raw_data": {
        "vendor_name": "BASECAMP CONSULTING AND SOLUTIONS LLC",
        "unique_catalog_item_id": "BCS-054",
        "title": "Web Developer (Senior)",
        "description": "Services performed include, but are not limited to, contributing to overall strategic vision and integrates a broad range of solutions in support of client requirements for IT projects that includes cloud and onprem environments. Formulates and defines system scope and objectives, develops or modifies processes to solve complex problems for computer systems and business and system interfaces to achieve desired results through the use of innovative technologies. Develops software to implement business process. Develops application programs in support of clients mission following software development lifecycle, including design of application using UI/UX, writes application program using various computer programming languages, develops scripts and automation for code deployment using Continuous Integration (CI), Continuous Development and Continuous Deployment (CD) processes using DevOps and DevSecOps processes. Develops plans for testing computer systems and applications that includes developing test cases, writing test scripts, automating the testing process using DevOps process and also conducts independent verification and validation (IV&V) testing.  Develops and applies advanced engineering and design methods, theories, and research techniques in the investigation and solution of complex and advanced system requirements, hardware/software interfaces and applications, and solutions. Responsible for design, development, engineering, integration, and architecture. Senior staff manages, plans, and conducts major phases of significant projects. The work complexity and responsibility will be greater at higher levels.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "95.61",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "PhD + 0 years' experience; Masters + 1 year experience; Associates + 5 years' experience; High School + 7 years' experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "IT,Web,Developer,Senior,Computer",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "PhD + 0 years' experience; Masters + 1 year experience; Associates + 5 years' experience; High School + 7 years' experience",
      "security_clearance": "No",
      "contractor_id": 2622,
      "price_list_id": 1950
    }
  ],
  "parsed_at": "2025-11-06T11:51:58.609834"
}