{
  "contract_number": "47QTCA20D003G",
  "contractor_id": 5134,
  "price_list_id": 1176,
  "labor_categories": [
    {
      "contract_number": "47QTCA20D003G",
      "labor_category": "Business Analyst/Data Modeler",
      "hourly_rate": 170.84,
      "source_sheet_name": "Price List",
      "source_row_number": 3,
      "raw_data": {
        "vendor_name": "ENTERPRISE SOLUTIONS INC",
        "unique_catalog_item_id": "BIZ AN/DATA MOD",
        "title": "Business Analyst/Data Modeler",
        "description": "Responsible for analyzing and validating functional requirements. Conducts process and data modeling utilizing process and data modeling tools, and other office automation products. Interviews clients and stakeholders to determine current and targeted business processes and environment. Responsible for data modeling effort from requirements to conceptual, logical and physical design. Provide hands-on data modeling and development support for the projects.  Develop Enterprise Data Dictionary. Prepares written reports on the results of analyses conducted and associated recommendations. Prepares presentation materials and conducts presentations for clients and stakeholders.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "170.84",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "6.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 5134,
      "price_list_id": 1176
    },
    {
      "contract_number": "47QTCA20D003G",
      "labor_category": "Enterprise Architect",
      "hourly_rate": 174.72,
      "source_sheet_name": "Price List",
      "source_row_number": 4,
      "raw_data": {
        "vendor_name": "ENTERPRISE SOLUTIONS INC",
        "unique_catalog_item_id": "ENT ARCH",
        "title": "Enterprise Architect",
        "description": "Responsible for analyzing, validating and implementing EA frameworks, Service Oriented Architecture (SOA), Component Architecture, and Technology Architecture. Participates as key contributor to running projects through the entire SDLC and to ensure requirements are met and/or exceeded. Provides expert technical consulting services on various technical disciplines including but not limited to database and client/server technologies, enterprise networking technologies, and business analytic/intelligence tools. Interviews clients and  stakeholders to determine current and targeted EA environment. Prepares written reports on the results of analyses conducted and associated recommendations. Prepares presentation materials and conducts presentations for clients and stakeholders.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "174.72",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "6.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 5134,
      "price_list_id": 1176
    },
    {
      "contract_number": "47QTCA20D003G",
      "labor_category": "Network Engineer I",
      "hourly_rate": 46.59,
      "source_sheet_name": "Price List",
      "source_row_number": 5,
      "raw_data": {
        "vendor_name": "ENTERPRISE SOLUTIONS INC",
        "unique_catalog_item_id": "NET ENGI",
        "title": "Network Engineer I",
        "description": "Under supervision, performs a variety of network engineering tasks which focuses network related problem resolutions, technical performance monitoring, and other system administrative issues. May assist in the prioritization of network control center or network support center tasks. Operates and maintains hardware such as routers, switches, hubs and network monitoring devices. Responsible for implementing and/or troubleshooting cable plants and architecture, communications transmission lines and all other attached devices.  Provides technical support to end users. May perform other duties as assigned.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "46.59",
        "minimum_education": "Associates",
        "minimum_years_of_education": "1.0",
        "required_certifications_or_licenses": "Microsoft CSE, Cisco CCIE, Novell CNE, RCCD, etc",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Associates",
      "security_clearance": "No",
      "contractor_id": 5134,
      "price_list_id": 1176
    },
    {
      "contract_number": "47QTCA20D003G",
      "labor_category": "Network Engineer II",
      "hourly_rate": 58.24,
      "source_sheet_name": "Price List",
      "source_row_number": 6,
      "raw_data": {
        "vendor_name": "ENTERPRISE SOLUTIONS INC",
        "unique_catalog_item_id": "NET ENGII",
        "title": "Network Engineer II",
        "description": "Under supervision, performs a variety of network engineering tasks which focuses on the design, integration, and implementation of LAN and/or WAN including hardware, software and support facilities, and/or equipment. Performs design, installation, troubleshooting, and support of LAN/MAN/WAN hardware, software and applications. Installs and configures hardware such as routers, switches, hubs and network monitoring devices. Responsible for implementating and maintaining cable plants and architecture, communications transmission lines and all other attached devices. Responsible for the technical/engineering part of a major project or a project of lesser complexity than those normally assigned to a higher-level engineer. Coordinates the activities of Network Technicians assigned to specific network engineering projects. Provides technical support to end users. May perform other duties as assigned.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "58.24",
        "minimum_education": "Associates",
        "minimum_years_of_education": "3.0",
        "required_certifications_or_licenses": "Microsoft CSE, Cisco CCIE, Novell CNE, RCCD, etc",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Associates",
      "security_clearance": "No",
      "contractor_id": 5134,
      "price_list_id": 1176
    },
    {
      "contract_number": "47QTCA20D003G",
      "labor_category": "Network Engineer III",
      "hourly_rate": 77.65,
      "source_sheet_name": "Price List",
      "source_row_number": 7,
      "raw_data": {
        "vendor_name": "ENTERPRISE SOLUTIONS INC",
        "unique_catalog_item_id": "NET ENGIII",
        "title": "Network Engineer III",
        "description": "Performs a variety of network engineering tasks, either independently   or under supervision, which focuses on the design, integration, and implementation of LAN and/or WAN including hardware, software, and support facilities and/or equipment. May supervise a team of Network Engineers in designing complex network architectures from inception through project completion. Performs design, installation, troubleshooting, and support of LAN/MAN/WAN hardware, software and applications. Installs and configures hardware such as routers, switches, hubs and network monitoring devices. Responsible for designing, implementating, and maintaining cable plants and architecture, communications transmission lines and all other attached devices. Analyzes Ethernet protocol packets and provide reports and recommendations on traffic analysis. Provides technical support to end users. Acts as point of contact for client needs. May perform other duties as assigned.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "77.65",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "required_certifications_or_licenses": "Microsoft CSE, Cisco CCIE, Novell CNE, RCCD, etc",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 5134,
      "price_list_id": 1176
    },
    {
      "contract_number": "47QTCA20D003G",
      "labor_category": "Project Advisor",
      "hourly_rate": 194.14,
      "source_sheet_name": "Price List",
      "source_row_number": 8,
      "raw_data": {
        "vendor_name": "ENTERPRISE SOLUTIONS INC",
        "unique_catalog_item_id": "PA",
        "title": "Project Advisor",
        "description": "Analyze business operations to determine opportunities to automate processes and functions if applicable. Translate high level business requirements into functional specifications for the IT organization and manage changes to such specifications. Identify business, operational and technical tasks, scope, time constraints and task interdependencies. Lead walkthroughs of business requirements. Coaches and mentors staff members. Responsible for end-to-end ownership of projects and project planning activities in an area of expertise and/or concurrent multiple initiatives for the assigned team. Participate in program design and code walkthroughs. Review test plans and results providing guidance with the development of test plans to assist the business with development of user acceptance criteria.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "194.14",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 5134,
      "price_list_id": 1176
    },
    {
      "contract_number": "47QTCA20D003G",
      "labor_category": "Project Manager I",
      "hourly_rate": 93.19,
      "source_sheet_name": "Price List",
      "source_row_number": 9,
      "raw_data": {
        "vendor_name": "ENTERPRISE SOLUTIONS INC",
        "unique_catalog_item_id": "PMI",
        "title": "Project Manager I",
        "description": "Serves as the contractor's single contract manager. Responsible for formulating and enforcing work standards, assigning contractor schedules, reviewing work discrepancies, supervising contractor personnel and communicating policies, purposes, and goals of the organization to subordinates. Directs the performance of a variety of related projects that may be organized by technology, program or client. Program areas typically represent more than three functional areas that may include engineering, systems analysis, quality control, administration, etc. Develops cost, technical, and schedule baselines and controls program(s) accordingly. Establishes individual performance criteria,hires appropriate people and oversees their application. May perform some or all of the duties of Subject Matter Specialists, engineers, or technologists to the extent qualified and appropriate. Responsible for the effective management of funds and personnel, and is accountable for the quality and timely delivery of all contractual items. May perform other duties as assigned.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "93.19",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 5134,
      "price_list_id": 1176
    },
    {
      "contract_number": "47QTCA20D003G",
      "labor_category": "Project Manager II",
      "hourly_rate": 104.84,
      "source_sheet_name": "Price List",
      "source_row_number": 10,
      "raw_data": {
        "vendor_name": "ENTERPRISE SOLUTIONS INC",
        "unique_catalog_item_id": "PMII",
        "title": "Project Manager II",
        "description": "Manages multiple projects, manages, and mentors two or more level 1 Project Managers, and may serve as the contractor's single contract manager. Responsible for instituting effective project management processes and providing project management guidance and training for less experienced project managers or task leaders. Conducts periodic project reviews with clients to ensure high quality work is performed on the program. Able to perform any or all of the Functional Responsibilities of Project Manager I and may serve as a backup to any Project Manager 1. May perform other duties as assigned.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "104.84",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 5134,
      "price_list_id": 1176
    },
    {
      "contract_number": "47QTCA20D003G",
      "labor_category": "Programmer/Analyst III",
      "hourly_rate": 77.65,
      "source_sheet_name": "Price List",
      "source_row_number": 11,
      "raw_data": {
        "vendor_name": "ENTERPRISE SOLUTIONS INC",
        "unique_catalog_item_id": "PROG/AN",
        "title": "Programmer/Analyst III",
        "description": "Develops standards-compliant software utilizing industry-leading operating systems, languages, protocols, and relational databases. Supports and develops programs/tools associated with client's software. Maintains and enhances source code management/release management activities. Analyzes problems. Designs, codes, and tests batch reporting processes. Provides technical leadership. Assists in new development and product support. Assist in the preparation of project plans and schedules for application systems development efforts. Ensures consistency and satisfaction of interface requirements for specific newly developing programs with other new and existing programs and systems within designated application systems. Creates and maintains source code management tools. Prepares application program unit test data. Coordinates testing activities for designated programs within assigned project(s), as required. Archives code and packages releases. Analyzes embedded programs for performance, and recommends ways to improve them. Reviews performance recommendations of others. Executes performance tests of programs. Writes and tests programs to benchmark performance. Creates job schedule and interfaces with users. Performs enhancements, fixes bugs, and resolves coding issues for existing applications. Assist in monitoring assigned organization development projects to ensure consistency and satisfaction of interface requirements for specific newly developing systems. May perform other duties as assigned.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "77.65",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 5134,
      "price_list_id": 1176
    },
    {
      "contract_number": "47QTCA20D003G",
      "labor_category": "Subject Matter Expert I",
      "hourly_rate": 101.72,
      "source_sheet_name": "Price List",
      "source_row_number": 12,
      "raw_data": {
        "vendor_name": "ENTERPRISE SOLUTIONS INC",
        "unique_catalog_item_id": "SMEI",
        "title": "Subject Matter Expert I",
        "description": "Responsible for maintaining up-to-date expertise in a specific subject area in order to evaluate customer program objectives and requirements and provides expert advice for program and/or process improvements. Recommends changes and participates in discussion of the depth and breadth of topic coverage in specific subject area or program. Collects, reviews, filters, and validates program data used for program evaluation and analysis. Subject matter functional expertise may be provided in areas including but not limited to education, health care, financial management, security, legal, engineering, science, and information technology. Interfaces with client program and management personnel and is adept in oral and written communications.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "101.72",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 5134,
      "price_list_id": 1176
    },
    {
      "contract_number": "47QTCA20D003G",
      "labor_category": "Senior Business Analyst/Data Modeler",
      "hourly_rate": 186.37,
      "source_sheet_name": "Price List",
      "source_row_number": 13,
      "raw_data": {
        "vendor_name": "ENTERPRISE SOLUTIONS INC",
        "unique_catalog_item_id": "SR-BIZ AN/DATA MOD",
        "title": "Senior Business Analyst/Data Modeler",
        "description": "Responsible for defining, identifying, analyzing, and validating functional requirements. Conducts value chain as well as Strengths, Weaknesses, Opportunities, and Threats (SWOT) analyses. Conducts process and data modeling utilizing process and data modeling tools and other office automation products. Interviews clients and stakeholders to determine current and targeted business processes and environment. Prepares written reports on the results of analyses conducted and associated recommendations with appropriate plan of actions and milestones (POA&M).  Responsible for data modeling effort from requirements to conceptual, logical and physical design.  Provide hands-on data modeling and development support for the projects. Develop Enterprise Data Dictionary. Prepares presentation materials and conducts presentations for clients and stakeholders.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "186.37",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 5134,
      "price_list_id": 1176
    },
    {
      "contract_number": "47QTCA20D003G",
      "labor_category": "Sr. Designer/Programmer",
      "hourly_rate": 112.59,
      "source_sheet_name": "Price List",
      "source_row_number": 14,
      "raw_data": {
        "vendor_name": "ENTERPRISE SOLUTIONS INC",
        "unique_catalog_item_id": "SR-DES/PROG",
        "title": "Sr. Designer/Programmer",
        "description": "Lead electronic and print designer. Responsible to outline creative concepts and computer manipulation of information. Writes code, develops motion concepts and authors complex computer renders into visual and aural presentations. Manages and coordinated creative efforts  including video, print, still and graphic elements and aural segments. Responsible to perform quality  control and code integrity.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "112.59",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "4.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 5134,
      "price_list_id": 1176
    },
    {
      "contract_number": "47QTCA20D003G",
      "labor_category": "Senior Enterprise Architect",
      "hourly_rate": 194.14,
      "source_sheet_name": "Price List",
      "source_row_number": 15,
      "raw_data": {
        "vendor_name": "ENTERPRISE SOLUTIONS INC",
        "unique_catalog_item_id": "SR-ENT ARCH",
        "title": "Senior Enterprise Architect",
        "description": "Responsible for formulating, validating, and implementing EA frameworks, Service Oriented Architecture (SOA), Component Architecture, and Technology Architecture. Oversees projects through the entire SDLC and ensures requirements are met and/or exceeded. Provides expert technical consulting services on various technical disciplines including but not limited to database and client/server technologies, enterprise networking technologies, and business analytic/intelligence tools. Interviews clients and stakeholders to determine current and targeted EA environment. Prepares written reports on the results of analyses conducted and associated recommendations with appropriate plan of actions and milestones (POA&M). Prepares presentation materials and conducts presentations for clients and stakeholders.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "194.14",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 5134,
      "price_list_id": 1176
    },
    {
      "contract_number": "47QTCA20D003G",
      "labor_category": "Sr. Network Engineer",
      "hourly_rate": 104.84,
      "source_sheet_name": "Price List",
      "source_row_number": 16,
      "raw_data": {
        "vendor_name": "ENTERPRISE SOLUTIONS INC",
        "unique_catalog_item_id": "SR-NET ENG",
        "title": "Sr. Network Engineer",
        "description": "Plans and performs network engineering research, design, development, and other assignments in conformance with network design, engineering, and customer specifications. Supervises team of Network Engineers in designing complex network architectures from inception through project completion. Supervises and monitors all aspects of system design, implementation, and operation of the network to ensure optimum network system performance. Oversees the design, implementation, and maintenance of cable plants and architecture, communications transmission lines and all other attached devices. Works with the project manager in generating design documents and project implementation plans. Assist in the development of standards, policies, and procedures for effectively managing the network as well as identifying and implementing best practice solutions. Provides technical support to end users. May perform other duties as assigned.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "104.84",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "required_certifications_or_licenses": "Microsoft CSE, Cisco CCIE, Novell CNE, RCCD, etc",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 5134,
      "price_list_id": 1176
    },
    {
      "contract_number": "47QTCA20D003G",
      "labor_category": "Sr. Project Manager",
      "hourly_rate": 124.24,
      "source_sheet_name": "Price List",
      "source_row_number": 17,
      "raw_data": {
        "vendor_name": "ENTERPRISE SOLUTIONS INC",
        "unique_catalog_item_id": "SR-PM",
        "title": "Sr. Project Manager",
        "description": "Plans, directs, coordinates, and controls technical and administrative activities for an entire program. Plans and directs technological improvements and project management implementation. Manages a diverse group of functional activities, subordinate groups of technical and administrative personnel. Oversees the technology development and/or application, marketing, and resource allocation within program client base. Reviews and maintains the quality of technical work performed on the program. Makes technical judgments and provides advice on resolving technical problems. Ensures goals and objectives of program are accomplished within contract terms and conditions. Maintains the development and execution of business opportunities based on broad, general guidance. Interfaces with client management personnel and has excellent oral and written communications. May perform other duties as assigned.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "124.24",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "15.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 5134,
      "price_list_id": 1176
    },
    {
      "contract_number": "47QTCA20D003G",
      "labor_category": "Sr. Programmer/Analyst",
      "hourly_rate": 104.84,
      "source_sheet_name": "Price List",
      "source_row_number": 18,
      "raw_data": {
        "vendor_name": "ENTERPRISE SOLUTIONS INC",
        "unique_catalog_item_id": "SR-PROG/AN",
        "title": "Sr. Programmer/Analyst",
        "description": "Develops standards-compliant software utilizing industry-leading operating systems, languages, protocols, and relational databases. Directs and controls development of production application systems. Prepares project plans and schedules for significant application systems development efforts. Monitors assigned organization development projects to ensure consistency and satisfaction of interface requirements. Monitors and tracks application system development progress in order to appropriately recommend the deployment of resources in order to meet project deliverable schedules. Assist in monitoring the direction and growth of business to ensure the application of appropriate technologies and support resources. Codes, tests, and troubleshoots programs. Designs implementations of large projects and prepares programming assignments. Performs project/problem resolution and support activities. Coordinates system testing and programming assignments. Researches system problems. Code and compile programs. Performs full system tests. Designs, plans and supervises implementation of medium to large scale system projects. Performs unit and assembly testing. Performs problem resolution and support activities. Trains new employees on all aspects of an application or system project. May perform other duties as assigned.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "104.84",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 5134,
      "price_list_id": 1176
    },
    {
      "contract_number": "47QTCA20D003G",
      "labor_category": "Sr. Systems Analyst/Project Leader",
      "hourly_rate": 93.19,
      "source_sheet_name": "Price List",
      "source_row_number": 19,
      "raw_data": {
        "vendor_name": "ENTERPRISE SOLUTIONS INC",
        "unique_catalog_item_id": "SR-SYS AN/PL",
        "title": "Sr. Systems Analyst/Project Leader",
        "description": "Under the guidance of the Program Manager, will be responsible for the overall management of the specific task order(s) and insure that the technical solutions and schedules in the task order are implemented in a timely manner. Performs enterprise wide horizontal integration planning and interfaces to other functional systems. Leads individuals based upon performance criteria, and hiring authority of others. Performs functions of subject matter specialist, engineer, or technologist where qualified and appropriate. Accountable for all aspects of project performance. Demonstrates oral and written communication skills. Ensures that all required resources including manpower, production standards, computer time, and facilities are available for program implementation. May perform other duties as assigned.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "93.19",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 5134,
      "price_list_id": 1176
    },
    {
      "contract_number": "47QTCA20D003G",
      "labor_category": "Sr. Systems Engineer/Architect",
      "hourly_rate": 178.6,
      "source_sheet_name": "Price List",
      "source_row_number": 20,
      "raw_data": {
        "vendor_name": "ENTERPRISE SOLUTIONS INC",
        "unique_catalog_item_id": "SR-SYS ENG/ARCH",
        "title": "Sr. Systems Engineer/Architect",
        "description": "Responsible for analyzing, planning, designing, documenting, and managing the implementation of complex and secure information technology (IT) solutions. Responsible for architecture and delivery of systems, applications and processes underlying customer IS  infrastructure. This includes infrastructure planning, application support, analysis, assessment, studies, design, development, testing, setup, technical documentation and reporting.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "178.6",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 5134,
      "price_list_id": 1176
    },
    {
      "contract_number": "47QTCA20D003G",
      "labor_category": "Sr. Web Developer",
      "hourly_rate": 93.19,
      "source_sheet_name": "Price List",
      "source_row_number": 21,
      "raw_data": {
        "vendor_name": "ENTERPRISE SOLUTIONS INC",
        "unique_catalog_item_id": "SR-WEB DEV",
        "title": "Sr. Web Developer",
        "description": "Develops and/or leads effort to create requirements and specifications for complex or highly technical web applications. Performs and/or leads effort to create application design for complex web projects which may require extensive research and analysis. Assist in estimating programming resource requirements, project planning and scheduling. Codes and tests web applications using standard toolsets, reusable object oriented methodology, and robust edit and error checking processes. Designs and develops projects with professional level standards for site performance, usability, scalability, browser compatibility, and reliability. Reviews designs and maintain compliance with application and infrastructure architecture and security. Provides guidance for more junior developers in technical skillsets, design, coding best practices, etc. May perform other duties as assigned.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "93.19",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 5134,
      "price_list_id": 1176
    },
    {
      "contract_number": "47QTCA20D003G",
      "labor_category": "Systems Analyst III",
      "hourly_rate": 73.77,
      "source_sheet_name": "Price List",
      "source_row_number": 22,
      "raw_data": {
        "vendor_name": "ENTERPRISE SOLUTIONS INC",
        "unique_catalog_item_id": "SYS AN",
        "title": "Systems Analyst III",
        "description": "Leads a team that evaluates and recommends computer systems architecture in an organization. Confers with end-users and technical personnel to identify functional issues and types of data to be processed. Develops sufficient understanding of the organization’s current architecture, future IT plans, corporate standards, and emerging trends to recommend hardware and software infrastructure. Acts as highest-level technical expert, addressing problems of systems integration, compatibility and multiple platforms. Provides guidance to junior staff. May perform other duties as assigned.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "73.77",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 5134,
      "price_list_id": 1176
    },
    {
      "contract_number": "47QTCA20D003G",
      "labor_category": "Systems Engineer/Architect",
      "hourly_rate": 155.3,
      "source_sheet_name": "Price List",
      "source_row_number": 23,
      "raw_data": {
        "vendor_name": "ENTERPRISE SOLUTIONS INC",
        "unique_catalog_item_id": "SYS ENG-ARCH",
        "title": "Systems Engineer/Architect",
        "description": "Responsible for analyzing, planning, designing, documenting, and managing the implementation of complex and secure information technology (IT) solutions. Responsible for architecture and delivery of key systems, applications and processes underlying customer IS infrastructure. This includes infrastructure planning, application support, analysis, assessment, studies, design, development, testing, setup, technical documentation and reporting.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "155.3",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "6.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 5134,
      "price_list_id": 1176
    },
    {
      "contract_number": "47QTCA20D003G",
      "labor_category": "Transformation Project Manager",
      "hourly_rate": 213.55,
      "source_sheet_name": "Price List",
      "source_row_number": 24,
      "raw_data": {
        "vendor_name": "ENTERPRISE SOLUTIONS INC",
        "unique_catalog_item_id": "TRANSF-PM",
        "title": "Transformation Project Manager",
        "description": "Manages multiple projects, manages and mentors two or more level 1 Project Managers, and may serve as the contractor's single contract manager. Responsible for formulating, leading, and managing multiple organizational and change management and process transformation initiatives including but not limited to enterprise architecture frameworks, business process modeling, strategy development, customer relationship management, finance, operational systems, and knowledge management.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "213.55",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 5134,
      "price_list_id": 1176
    },
    {
      "contract_number": "47QTCA20D003G",
      "labor_category": "Web Developer III",
      "hourly_rate": 73.77,
      "source_sheet_name": "Price List",
      "source_row_number": 25,
      "raw_data": {
        "vendor_name": "ENTERPRISE SOLUTIONS INC",
        "unique_catalog_item_id": "WEB DEVIII",
        "title": "Web Developer III",
        "description": "Conducts analysis and develops specifications for complex or highly technical web applications. Conducts application design for complex web projects which may require extensive research and analysis. Codes and tests web applications using standard toolsets, reusable object oriented methodology, and robust edit and error checking processes. Designs and develops projects with professional level standards for site performance, usability, scalability, browser compatibility, and reliability. Reviews designs and maintain compliance with application and infrastructure architecture and security. Provides guidance for more junior developers in technical skillsets, design, coding best practices, etc. May perform other duties as assigned.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "73.77",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 5134,
      "price_list_id": 1176
    }
  ],
  "parsed_at": "2025-11-06T11:55:19.023768"
}