{
  "contract_number": "47QTCA19D0092",
  "contractor_id": 8672,
  "price_list_id": 878,
  "labor_categories": [
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Cybersecurity Accreditation and Certification Analyst",
      "hourly_rate": 129.75,
      "source_sheet_name": "Price List",
      "source_row_number": 3,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "101.0",
        "title": "Cybersecurity Accreditation and Certification Analyst",
        "description": "Serves as a Cybersecurity Subject Matter Expert (SME) with regards to Risk Management of information systems and all associated cybersecurity policies and procedures. Fully versed in the general tenets supporting the overall implementation of incident management and re incident management and response processes, to include supporting cybersecurity policy, procedures and processes. Performs cybersecurity process while serving as a SME for an information system. Must possess an understanding of how security controls identified in the NIST 800-53 apply to the process of assessing and authorizing a large organization’s IT infrastructure, and AIS applications and outsourced IT processes. Reviews audit trail logs and scans. Ensures systems maintenance by providing weekly Vulnerability Remediation Asset management (VRAM) compliance reports.  Familiar with performing automated security scans with the following tools: assured compliance assessment solutions, center for internet security benchmarks, security content automation protocol, and retina. Accurately analyze and document scan results and familiarity with following framework: DIACAO, DCID 6/3, ICD 503, NIST. Knowledgeable about IC tools, systems and reporting mechanisms. Knowledgeable of DoD, IC and National Level system security initiative and LAN/WAN technologies. Ability to Identify and classify attack vectors, malware, IDS/IPS rule writing development. Working knowledge of MS Office Suite. Must possess one of the following certifications: CISSP, CAP, GIAC, GSLC, CISM or Security +.",
        "sin": "54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "129.75",
        "gsa_price_with_iff__b_": "129.75",
        "gsa_price_with_iff__c_": "132.99",
        "gsa_price_with_iff__d_": "136.31",
        "gsa_price_with_iff__e_": "139.72",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "4.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic",
        "bureau_of_labor_statistics_standard_occupational_code": "11-3131",
        "level_of_expertise": "Junior"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Cybersecurity Auditor - Intermediate",
      "hourly_rate": 120.14,
      "source_sheet_name": "Price List",
      "source_row_number": 4,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "102.0",
        "title": "Cybersecurity Auditor - Intermediate",
        "description": "Performs incident response and complex security analysis of classified and unclassified applications, systems and enclaves for compliance with security requirements. Performs Command Cyber Readiness Inspections and cybersecurity vulnerability evaluations. Uses a variety of security techniques, technologies, and tools to evaluate security posture in highly complex computer systems and networks. Probes the safety and effectiveness of computer systems and their related security components. After conducting a security audit, issues a detailed report that outlines the effectiveness of the system, explains any security issues and suggests changes and improvements. Plan, execute, and lead security audits across an organization. Inspect and evaluate financial and information systems, management procedures and security controls. Evaluate the efficiency, effectiveness and compliance of operation processes with corporate security policies and related government regulations. Develop and administer risk-focused exams for IT systems. Review or interview personnel to establish security risks and complications. Execute and properly document the audit process on a variety of computing environments and computer applications. Assess the exposures resulting from ineffective or missing control practices. Accurately interpret audit results against defined criteria and weigh the relevancy, accuracy and perspective of conclusions against audit evidence. Provide a written and verbal report of audit findings. Develops rigorous “best practice” recommendations to improve security on all levels and works with management to ensure security recommendations comply with company procedure.",
        "sin": "54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "120.14",
        "gsa_price_with_iff__b_": "120.14",
        "gsa_price_with_iff__c_": "123.14",
        "gsa_price_with_iff__d_": "126.22",
        "gsa_price_with_iff__e_": "129.38",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Cybersecurity Auditor - Senior",
      "hourly_rate": 139.37,
      "source_sheet_name": "Price List",
      "source_row_number": 5,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "103.0",
        "title": "Cybersecurity Auditor - Senior",
        "description": "Senior SME. Leads a team of Cyber Security auditors as that team performs complex security analysis of classified and unclassified applications, systems and enclaves for compliance with security requirements. Performs Command Cyber Readiness Inspections and cybersecurity vulnerability evaluations. Uses a variety of security techniques, technologies, and tools to evaluate security posture in highly complex computer systems and networks. Probes the safety and effectiveness of computer systems and their related security components. After conducting a security audit, issues a detailed report that outlines the effectiveness of the system, explains any security issues and suggests changes and improvements. Plan, execute and lead security audits across an organization. Inspect and evaluate financial and information systems, management procedures and security controls. Evaluate the efficiency, effectiveness and compliance of operation processes with corporate security policies and related government regulations. Develop and administer risk-focused exams for IT systems. Review or interview personnel to establish security risks and complications. Execute and properly document the audit process on a variety of computing environments and computer applications. Assess the exposures resulting from ineffective or missing control practices. Accurately interpret audit results against defined criteria and weigh the relevancy, accuracy and perspective of conclusions against audit evidence. Provide a written and verbal report of audit findings. Develops rigorous “best practice” recommendations to improve security on all levels and works with management to ensure security recommendations comply with company procedure.",
        "sin": "54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "139.37",
        "gsa_price_with_iff__b_": "139.37",
        "gsa_price_with_iff__c_": "142.85",
        "gsa_price_with_iff__d_": "146.42",
        "gsa_price_with_iff__e_": "150.08",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Cybersecurity Compliance Analyst",
      "hourly_rate": 81.36,
      "source_sheet_name": "Price List",
      "source_row_number": 6,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "104.0",
        "title": "Cybersecurity Compliance Analyst",
        "description": "Evaluates, reviews, analyzes and recommends available products to support cyber security solutions. Performs a variety of Cybersecurity analysis tasks, independently, which are broad in nature and are concerned with the design, analysis and implementation, including personnel, hardware, software and support facilities and/or equipment. Perform security research, analysis, and design for the clients’ computing systems and network infrastructure. Facilitate security vulnerability assessments and support penetration tests. Work on security alerts, events, and security incidents, including forensics analysis. Contribute general consulting (risk analysis) and project support in the area of information security to IT infrastructure and projects as needed to support new business requirements. Participate in internal security audits and investigations.  Manage and maintain a library of security audit tools and corresponding processes. Monitor trends in information technology and security.  Research emerging technologies and maintain awareness of current security risks in support of security enhancement and development efforts.  Monitor security systems for anomalies and respond to potential security events. Perform periodic policy compliance reviews, risk assessments, and control testing.  Assist in the investigation of security incidents as required, and recommend corrective actions and process improvements. A deep knowledge of NIST and ISO standards as well as industry-specific regulatory requirements (e.g., financial, healthcare and manufacturing).  Ability to research solutions where required.",
        "sin": "54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "81.36",
        "gsa_price_with_iff__b_": "81.36",
        "gsa_price_with_iff__c_": "83.39",
        "gsa_price_with_iff__d_": "85.47",
        "gsa_price_with_iff__e_": "87.61",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Cybersecurity Engineer",
      "hourly_rate": 110.86,
      "source_sheet_name": "Price List",
      "source_row_number": 7,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "105.0",
        "title": "Cybersecurity Engineer",
        "description": "Works on various network types of equipment and related devices from a security protection emphasis to include installing; troubleshooting; modifying; testing. Can independently build test network or system prototypes, performing equipment set-up, testing, and participating in test report writing. Has the ability to develop attack programs to verify security assurance and weakness capability. Gathers and organizes technical information about an organization's missions, goals, and requirements, existing security products, and ongoing programs in the IA arena. Performs command and control functions in response to incidents. Aids and helps transform Federal Government cybersecurity risk management through effective collaboration, operational governance and training. Provides meaningful metrics and assessments in support of agency decision making. Assist in the development of innovative approaches to drive change in cybersecurity risk management across the federal government to prevent or minimize disruptions to critical information infrastructure. Works as a team member and contributes to the assessment of current cybersecurity systems, policies, and processes to enforce standards and identify vulnerabilities and capability gaps, and to synthesize this data to reduce cybersecurity risk of customer networks. Analyzes user needs to determine functional requirements and define problems. Develop plans and requirements in the subject matter area for moderately complex to complex systems related to information systems architecture, networking; telecommunications, automation, communications protocols, risk management/electronic analysis, software, lifecycle management, software development methodologies, and modeling and simulation.",
        "sin": "54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "110.86",
        "gsa_price_with_iff__b_": "110.86",
        "gsa_price_with_iff__c_": "113.63",
        "gsa_price_with_iff__d_": "116.47",
        "gsa_price_with_iff__e_": "119.38",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Cybersecurity Subject Matter Expert",
      "hourly_rate": 192.22,
      "source_sheet_name": "Price List",
      "source_row_number": 8,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "106.0",
        "title": "Cybersecurity Subject Matter Expert",
        "description": "Provide expert advice to senior leaders and stakeholders on the extent of an incident, impact analysis, recommends eradication strategies and plans to restore networks to a more secure state to resolve Cybersecurity related incidents. Ensures that all systems and data repositories maintain appropriate levels of confidentiality, security, and integrity.  Works with cybersecurity specialists to provide expert consultation across a wide range of cross-functional areas of cyber security. Provides project planning, guidance and technical expertise in the following areas: cyber security engineering program, policy, process, and planning; risk management, auditing, and assessments; Assessment and Authorization (A&A) using the NIST Risk Management Framework (RMF) guidelines; and quality control. Leads and manages cyber security team in an operations and maintenance environment. Uses industry best practices in cyber security and security engineering related to vulnerability management, intrusion. Assist with development and maintain Operational Level Agreements (OLAs) and end-to- end Standard Operating Procedures (SOPs) to identify collaborative responsibilities and support process interaction with other Government and contractor IT groups. Advises system owners on all matters, technical and otherwise, involving the security of assigned IT systems. Perform continuous monitoring of security controls to ensure that they continue to be implemented correctly, operating as intended and producing the desired outcome with respect for meeting the cyber security requirements for assigned IT systems. Work with technical teams to mitigate security control deficiencies for assigned IT systems. Assess the cybersecurity impact of changes to assigned IT systems. Develop, update and maintain the System Security Plan (SSP) for assigned systems.",
        "sin": "54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "192.22",
        "gsa_price_with_iff__b_": "192.22",
        "gsa_price_with_iff__c_": "197.03",
        "gsa_price_with_iff__d_": "201.96",
        "gsa_price_with_iff__e_": "207.01",
        "minimum_education": "Masters",
        "minimum_years_of_education": "6.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Masters",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Cybersecurity Technical Writer",
      "hourly_rate": 79.25,
      "source_sheet_name": "Price List",
      "source_row_number": 9,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "107.0",
        "title": "Cybersecurity Technical Writer",
        "description": "Works in collaboration with the Incident Management and Cyber Risk Team and  Federal Government clients to document cyber risk and threats.   Conduct relevant research, data analysis, and create reports. Maintain responsibility for completion and accuracy of work products. Design and develop documentation of highly technical IT products and deployments.  Serves as the lead author for risk management and security focused documents. Collaborates with infrastructure SMEs to define documentation requirements. Supports the development of cybersecurity presentation and policy guidance based on recommended eradication strategies and plans to restore networks to a more secure state. Knowledge of the Risk Management Framework (RMF) or NIST standards. Experience developing documents: IT Service Management (ITSM), IT Infrastructure Library (ITIL), or COBIT. Supports the development of cybersecurity presentation and policy guidance based on recommended eradication strategies and plans to restore networks to a more secure state.",
        "sin": "54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "79.25",
        "gsa_price_with_iff__b_": "79.25",
        "gsa_price_with_iff__c_": "81.23",
        "gsa_price_with_iff__d_": "83.26",
        "gsa_price_with_iff__e_": "85.34",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "1.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Data Control Clerk",
      "hourly_rate": 84.81,
      "source_sheet_name": "Price List",
      "source_row_number": 10,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "108.0",
        "title": "Data Control Clerk",
        "description": "Performs analysis, development, and review of program administrative operating procedures. Support tasks requiring the collecting, compiling, evaluating, and publishing of information and statistical data included in documents, records, forms, reports, plans, policies, and regulations. Also supports the technical, business, and administrative aspects of the program.",
        "sin": "ANCILLARY",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "84.81",
        "gsa_price_with_iff__b_": "84.81",
        "gsa_price_with_iff__c_": "86.93",
        "gsa_price_with_iff__d_": "89.1",
        "gsa_price_with_iff__e_": "91.33",
        "minimum_education": "High_School",
        "minimum_years_of_education": "2.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "High_School",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "DR/COOP SME",
      "hourly_rate": 145.03,
      "source_sheet_name": "Price List",
      "source_row_number": 11,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "109.0",
        "title": "DR/COOP SME",
        "description": "Supports development, testing, and maintenance of Continuity of Support/IT Contingency, Cyber Incident Response, and Information Technology Disaster Recovery Plans, develops Contingency Planning Guides for IT Systems.  Drafts contingency planning policy statements; conducts the business impact analysis (BIA); identifies preventive controls; develops recovery strategies; develops the IT Contingency Plan; conducts testing, training, and exercises of the plans; and updates plans as changes to the IT environment occur.  Requires a bachelor’s degree or equivalent (equivalent is 2 years’ experience per year of college), five to seven years of related experience, and the ability to obtain and maintain a security clearance.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "145.03",
        "gsa_price_with_iff__b_": "145.03",
        "gsa_price_with_iff__c_": "148.66",
        "gsa_price_with_iff__d_": "152.38",
        "gsa_price_with_iff__e_": "156.19",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "12.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Enterprise Architect",
      "hourly_rate": 137.71,
      "source_sheet_name": "Price List",
      "source_row_number": 12,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "110.0",
        "title": "Enterprise Architect",
        "description": "This Senior Level Architect will design, build and implement enterprise-class security solutions within a multi-tenant cloud environment to support federal agencies. This individual must be versatile and articulate with the ability to successfully convey Cyber Security risks and effectively position our solutions and delivery capabilities that address the cyber security challenges. Provides guidance on government architectures, lines of business, the Technical Reference Model (TRM) and threat intelligence specifically focused on incidents to identify attacks. Works with stakeholders to build a holistic view of the organization's strategy, processes, information, and IT assets.  Ensures business and IT are in alignment and protected from cyber threats. Assesses and links the business mission, strategy, and processes of the organization to its IT strategy, including security, and documents this using multiple architectural models or views that show how the current and future needs of an organization will be met.",
        "sin": "54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "137.71",
        "gsa_price_with_iff__b_": "137.71",
        "gsa_price_with_iff__c_": "141.15",
        "gsa_price_with_iff__d_": "144.68",
        "gsa_price_with_iff__e_": "148.3",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Functional Analyst",
      "hourly_rate": 163.07,
      "source_sheet_name": "Price List",
      "source_row_number": 13,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "111.0",
        "title": "Functional Analyst",
        "description": "Analyzes user needs to determine functional requirements, tasks and their interrelationships.  Identifies resources required for each task, Identifies technical problems, and risk areas.  Develops solutions and risk mitigation strategy. Prepares reports and presents interim and final task order results to all concerned.  Document procedures and processes for improvement. Provides daily supervision and direction to staff.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "163.07",
        "gsa_price_with_iff__b_": "163.07",
        "gsa_price_with_iff__c_": "167.15",
        "gsa_price_with_iff__d_": "171.33",
        "gsa_price_with_iff__e_": "175.61",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Information Assurance (IA) Management Analyst",
      "hourly_rate": 99.6,
      "source_sheet_name": "Price List",
      "source_row_number": 14,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "112.0",
        "title": "Information Assurance (IA) Management Analyst",
        "description": "Responsible for responding to all information systems incidents to restore them to be functional and secure; recommends information security assurance/security solutions. Performs scanning analysis. Provides technical planning and systems engineering for NIST compliance. Serves as the primary customer engagement point of contact. Provides onsite/remote offsite services and support during hours of operations. Provides Technical Knowledge Transfer. Perform security updates. Develop/Review/Maintain  artifacts and documentation. Documents and maintains system configurations. Instructs on security policies and procedures. Monitors network activity and ensures data is protected from unauthorized users. Identifies, reports and resolves security violations. Relies on knowledge and professional discretion to plan and achieve goals. Advises and assists Federal Government clients on incident response, security and privacy policy, trusted product assessment, enterprise security engineering, secure systems management, penetration and exploitation, insider threat analysis and protection, cyber situation awareness, attack sensing and warning, secure wireless networking and mobile computing, secure operating systems, secure workstations, secure data management, secure web technology, and secure protocols, authentication. Performs Incident Response analysis.",
        "sin": "54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "99.6",
        "gsa_price_with_iff__b_": "99.6",
        "gsa_price_with_iff__c_": "102.09",
        "gsa_price_with_iff__d_": "104.64",
        "gsa_price_with_iff__e_": "107.26",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Information Assurance (IA) Project Engineer",
      "hourly_rate": 112.71,
      "source_sheet_name": "Price List",
      "source_row_number": 15,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "113.0",
        "title": "Information Assurance (IA) Project Engineer",
        "description": "Provides Information Assurance, Cyber Security, and Systems Engineering support for critical processes and projects; Performs command and Control functions in response to incidents. Assesses and mitigates system security threats/risks throughout the program life cycle; validates system security requirements definition and analysis; establishes system security designs; implements security designs in hardware, software, data, and procedures; verifies security requirements; performs system certification and accreditation planning and testing and liaison activities and supports secure systems operations and maintenance. Responsible for safeguarding Government organization’s computer networks and systems by planning and carrying out security measures to monitor and protect sensitive data and systems from infiltration and cyber-attacks. Works in concert with a larger IT team. Developing Information Security plans and policies. Develops a set of security standards and best practices for the organization and recommends security enhancements to management as needed. Develops strategies to respond to and recover from a security breach. Information Assurance Security Engineers are also responsible for educating the workforce on information security through training and building awareness. Implement protections, installs and uses software, such as firewalls and data encryption programs, to protect organizations’ sensitive information, while also assisting computer users with installation or processing of new security products and procedures. Test for vulnerabilities; conducts periodic scans of networks to find any vulnerability; and conducts penetration testing. Monitor for security breaches.  Constantly monitors networks and systems for security breaches or intrusions. Installs software to notify of intrusions and watches out for irregular system behavior. Investigate security breaches; if a breach occurs, leads incident response activities to minimize the impact. Leads a post-incident technical and forensic investigation into how the breach happened and the extent of the damage. Prepares reports of findings to be reported to management.",
        "sin": "54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "112.71",
        "gsa_price_with_iff__b_": "112.71",
        "gsa_price_with_iff__c_": "115.53",
        "gsa_price_with_iff__d_": "118.42",
        "gsa_price_with_iff__e_": "121.38",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "4.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Information Assurance Security Engineer",
      "hourly_rate": 87.96,
      "source_sheet_name": "Price List",
      "source_row_number": 16,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "114.0",
        "title": "Information Assurance Security Engineer",
        "description": "Provides guidance on IA artifacts in the area of Cybersecurity and tooling to include vulnerability testing and related network and system test tools; e.g., Retina, NMap, Nessus, STIG compliance checker, ACAS, Klocwork, WASSP, SECSCN, Security Content Automation Protocol (SCAP). Responsible for safeguarding Government organization’s computer networks and systems by planning and carrying out security measures to monitor and protect sensitive data and systems from infiltration and cyber-attacks. Works in concert with a larger IT team. Developing Information Security plans and policies. Develops a set of security standards and best practices for the organization and recommends security enhancements to management as needed. Develops strategies to respond to and recover from a security breach. Information Assurance Security Engineers are also responsible for educating the workforce on information security through training and building awareness. Implement protections, installs and uses software, such as firewalls and data encryption programs, to protect organizations’ sensitive information, while also assisting computer users with installation or processing of new security products and procedures. Test for vulnerabilities; conducts periodic scans of networks to find any vulnerability; and conducts penetration testing. Monitor for security breaches.  Constantly monitors networks and systems for security breaches or intrusions. Installs software to notify of intrusions and watches out for irregular system behavior. Investigate security breaches; if a breach occurs, leads incident response activities to minimize the impact. Leads a post-incident technical and forensic investigation into how the breach happened and the extent of the damage. Prepares reports of findings to be reported to management.",
        "sin": "54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "87.96",
        "gsa_price_with_iff__b_": "87.96",
        "gsa_price_with_iff__c_": "90.16",
        "gsa_price_with_iff__d_": "92.41",
        "gsa_price_with_iff__e_": "94.72",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "2.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Intermediate Administrative Specialist",
      "hourly_rate": 86.67,
      "source_sheet_name": "Price List",
      "source_row_number": 17,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "115.0",
        "title": "Intermediate Administrative Specialist",
        "description": "Specializes in coordinating and planning office administration and support. Reports directly to a client, usually at the client location, to support its operations as required. Understands and provides documentation planning and support, project administration, general office support, executive secretarial support, human resource planning, event planning and administration, office relocation planning, etc. required in changing office environments.",
        "sin": "ANCILLARY",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "86.67",
        "gsa_price_with_iff__b_": "86.67",
        "gsa_price_with_iff__c_": "88.84",
        "gsa_price_with_iff__d_": "91.06",
        "gsa_price_with_iff__e_": "93.34",
        "minimum_education": "High_School",
        "minimum_years_of_education": "2.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "High_School",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Intermediate Communication Engineer",
      "hourly_rate": 134.81,
      "source_sheet_name": "Price List",
      "source_row_number": 18,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "116.0",
        "title": "Intermediate Communication Engineer",
        "description": "Performs systems engineering planning; performance management; capacity planning, testing and validation; benchmarking; information engineering. Develops and staffs a systems engineering management plan. Supports a Sr. Systems Engineer, as required. Analyzes and develops technical documentation detailing the integration and system performance. Coordinates the activities of Systems Engineers and Jr. Systems Engineers assigned to specific systems engineering projects.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "134.81",
        "gsa_price_with_iff__b_": "134.81",
        "gsa_price_with_iff__c_": "138.18",
        "gsa_price_with_iff__d_": "141.63",
        "gsa_price_with_iff__e_": "145.17",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Intermediate Information Engineer",
      "hourly_rate": 134.81,
      "source_sheet_name": "Price List",
      "source_row_number": 19,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "117.0",
        "title": "Intermediate Information Engineer",
        "description": "Applies business process improvement practices to re engineer methodologies/principles and business process modernization projects. Applies, as appropriate, activity and data modeling, transaction flow analysis, internal control and risk analysis and modern business methods and performance measurement techniques. Assist in establishing standards for information systems procedures. Develops and applies organization wide information models for use in designing and building integrated, shared software and database management systems. Constructs logical business improvement opportunities consistent with corporate information management guiding principles, cost savings, and open system architecture objectives.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "134.81",
        "gsa_price_with_iff__b_": "134.81",
        "gsa_price_with_iff__c_": "138.18",
        "gsa_price_with_iff__d_": "141.63",
        "gsa_price_with_iff__e_": "145.17",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Lead Business Systems Analyst",
      "hourly_rate": 139.37,
      "source_sheet_name": "Price List",
      "source_row_number": 20,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "118.0",
        "title": "Lead Business Systems Analyst",
        "description": "Top level technical contributor supporting Penetration Testing and other cybersecurity and Information Assurance tasks with expertise in Information Technology and Cybersecurity cradle to grave processes related to applications and infrastructure. Responsible for analyzing and documenting existing operations and practices and developing test plans to circumvent the security and features of applications, systems, networks, and processes. Acts as a member of the team responsible for providing technical guidance concerning the “business”. Supports analyzing site/enterprise Computer Network Defense policies and evaluates compliance with regulations and Enterprise Directives; Assists with the selection of cost-effective security controls to mitigate risks (e.g., protection of business information and processes.) Plans, designs, develops, and launches exercises to circumvent security features. Gathers and analyzes data in support of business cases, proposed projects, and systems requirements. Responsible for generating and compiling reports based on the findings, complete with probable causes and possible solutions. Meets with decision makers, systems owners, and end users to define business, financial, and operations requirements and systems goals, and identify and resolve systems issues. Reviews and analyzes the effectiveness and efficiency of existing systems and develops strategies for improvement. Identifies and establishes scope and parameters of systems analysis to define outcome criteria and measure-taking actions.  Supports Red and Blue Team activities.",
        "sin": "54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "139.37",
        "gsa_price_with_iff__b_": "139.37",
        "gsa_price_with_iff__c_": "142.85",
        "gsa_price_with_iff__d_": "146.42",
        "gsa_price_with_iff__e_": "150.08",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Lead Sr. Security Engineer",
      "hourly_rate": 260.49,
      "source_sheet_name": "Price List",
      "source_row_number": 21,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "119.0",
        "title": "Lead Sr. Security Engineer",
        "description": "Provides technical, managerial, and administrative direction for problem definition, analysis, requirements development and implementation for complex to extremely complex systems in the subject matter area. Makes recommendations and advises on organization-wide system improvements, optimization or maintenance efforts in the following specialties: information systems architecture; networking; telecommunications; automation; communications protocols; risk management/electronic analysis; software; life-cycle management; software development methodologies; and modeling and simulation.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "260.49",
        "gsa_price_with_iff__b_": "260.49",
        "gsa_price_with_iff__c_": "267",
        "gsa_price_with_iff__d_": "273.68",
        "gsa_price_with_iff__e_": "280.52",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "15.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Mid-Level Security Engineering",
      "hourly_rate": 128.07,
      "source_sheet_name": "Price List",
      "source_row_number": 22,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "120.0",
        "title": "Mid-Level Security Engineering",
        "description": "Develops requirements from a project’s inception to its conclusion in the subject matter area for simple to moderately complex systems. Assists other senior consultants with analysis and evaluation and with the preparation of recommendations for system improvements, optimization, development, and/or maintenance efforts in the following specialties: information systems architecture; networking; telecommunications; automation; communications protocols; risk management/electronic analysis; software; life-cycle management; software development methodologies; and modeling and simulation.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "128.07",
        "gsa_price_with_iff__b_": "128.07",
        "gsa_price_with_iff__c_": "131.27",
        "gsa_price_with_iff__d_": "134.55",
        "gsa_price_with_iff__e_": "137.91",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Network Engineer I",
      "hourly_rate": 69.03,
      "source_sheet_name": "Price List",
      "source_row_number": 23,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "121.0",
        "title": "Network Engineer I",
        "description": "Provides support monitoring the networks and systems for cyber threats and cyber vulnerabilities. Identifies security risks, threats and vulnerabilities of networks, systems, applications and other technologies. Design, support and troubleshoot for the client’s network within a team environment. Performs product evaluations, recommends and implements services for network security. Responsible for validating and testing complex security architecture. Performs Network Mapping including Wireless Access Point (WAP) detection to support penetration testing. Ascertains user needs and system requirements to design, monitor, and maintain computer networks. Utilizes prior experience with years of direct experience in hands on implementation of network backbone technology (Cisco routers, switches, and firewalls), experience creating cyber security architecture guidelines for multiple instances of technology, capability to explain and design technology on an engineering and management level, and concise understanding of complete technology requirements and underlying technology fundamentals. Provides thought leadership in the design of cyber network infrastructure services to meet business requirements and operational objectives. Delegate tasking to the network engineering team staff. Provides architect engineering and supervisory services in support of emerging technology integration into network backbone systems. Monitor and maintains computer systems. This may include troubleshooting wide area networks, servers and routers, local area networks, and switches. Installs or upgrades software and hardware.",
        "sin": "54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "69.03",
        "gsa_price_with_iff__b_": "69.03",
        "gsa_price_with_iff__c_": "70.76",
        "gsa_price_with_iff__d_": "72.53",
        "gsa_price_with_iff__e_": "74.34",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "1.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Network Engineer, Sr.",
      "hourly_rate": 113.7,
      "source_sheet_name": "Price List",
      "source_row_number": 24,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "122.0",
        "title": "Network Engineer, Sr.",
        "description": "Conducts assessments of threats and vulnerabilities, determines deviations from acceptable network configurations, network policies, and develops recommendations of mitigation countermeasure in operational and non-operational situations.  Provides high level support monitoring the networks and systems for cyber threats and works with leadership and stakeholders to mitigate and remediate the cyber vulnerabilities. Identifies security risks, threats and vulnerabilities of networks, systems, applications and other technologies. Performs highly complex product evaluations, recommends and implements services for network security. Responsible for validating and testing complex security architecture. Determines deviations from acceptable network configurations, network policies, and develops recommendations of mitigation countermeasure in operational and non-operational situations. Supports Ethical Hacking and Compliance Management on network appliances. Defines the problems and analyzes and develops plans and requirements in the subject matter area for moderately complex to complex systems. Coordinates and manages the preparation of analysis, evaluations, and recommendations for proper implementation of programs and systems specifications in the following specialties: information systems architecture, networking, telecommunications; automation, communications protocols, risk management/electronic analysis, software, life-cycle management, software development methodologies, and modeling and simulation, leads network tech and design engineers.",
        "sin": "54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "113.7",
        "gsa_price_with_iff__b_": "113.7",
        "gsa_price_with_iff__c_": "116.54",
        "gsa_price_with_iff__d_": "119.45",
        "gsa_price_with_iff__e_": "122.44",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "6.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Network Security Analyst",
      "hourly_rate": 110.53,
      "source_sheet_name": "Price List",
      "source_row_number": 25,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "123.0",
        "title": "Network Security Analyst",
        "description": "Provides continued operation of network and security enabled solutions. Strong knowledge of cyber security network monitoring principals, including vulnerability management, incident response, computer security forensics and vulnerability/penetration testing. Use various tools, techniques, and procedures.  Supports end point security, penetration testing, vulnerability assessments, and forensics.  Provides security assessments and architecture recommendations to management. Supports analyzing site/enterprise Computer Network Defense configurations and evaluates compliance with regulations and Enterprise Directives; Assists with the selection of cost-effective security controls to mitigate risks (e.g., systems and networks).",
        "sin": "54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "110.53",
        "gsa_price_with_iff__b_": "110.53",
        "gsa_price_with_iff__c_": "113.29",
        "gsa_price_with_iff__d_": "116.12",
        "gsa_price_with_iff__e_": "119.02",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Penetration Tester - II",
      "hourly_rate": 120.14,
      "source_sheet_name": "Price List",
      "source_row_number": 26,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "124.0",
        "title": "Penetration Tester - II",
        "description": "In furtherance of cyber security objectives, conducts and /or supports authorized manual penetration tests of networks, applications, web applications, servers, endpoints, wireless, mobile technologies and on enterprise network assets. Develops custom exploits.  Utilizes automated tools to conduct penetration testing. Analyze results to mitigate the risk of false positives.  Finds security vulnerabilities in target systems, networks, and applications to help enterprises improve their security; identification of flaws to cause business risk, provides crucial insights into the most pressing issues and suggests how to prioritize security resources; Works under general supervision and usually reports to a supervisor, though some ingenuity and flexibility is required.   Conducting and/or supporting authorized penetration testing on enterprise network assets.  Analyzing site/enterprise Computer Network Defense (CND) policies, configurations, and evaluate compliance with regulations and enterprise directives.  Assisting with the selection of cost-effective security controls to mitigate risk.",
        "sin": "54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "120.14",
        "gsa_price_with_iff__b_": "120.14",
        "gsa_price_with_iff__c_": "123.14",
        "gsa_price_with_iff__d_": "126.22",
        "gsa_price_with_iff__e_": "129.38",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Penetration Tester - III",
      "hourly_rate": 148.98,
      "source_sheet_name": "Price List",
      "source_row_number": 27,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "125.0",
        "title": "Penetration Tester - III",
        "description": "Possesses knowledge of industry-standard penetration testing components and processes including: reconnaissance, scanning, ranking/scoring vulnerabilities, selecting targets for exploit, escalation of privilege, removal of exploits/restoration of exploited targets, and reporting. Has knowledge of penetration testing applications or processes.  Performs penetration testing activities and prepares “Rules of Engagement” document, plans all activities, and provides direction to junior level penetration testers. Performs final analysis of testing results and prepares technical reports. Leads the effort to find cyber security vulnerabilities in target systems, networks, and applications in order to help enterprises improve their security; leads the identifying of which key flaws can be exploited to cause business risk, provides crucial insights into the most pressing issues and suggests how to prioritize security resources.   Conducts and/or supports authorized penetration testing on enterprise network assets.  Analyzes site/enterprise Computer Network Defense (CND) policies, configurations, and evaluates compliance with regulations and enterprise directives. Assist with the selection of cost-effective security controls to help mitigate risk.",
        "sin": "54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "148.98",
        "gsa_price_with_iff__b_": "148.98",
        "gsa_price_with_iff__c_": "152.7",
        "gsa_price_with_iff__d_": "156.52",
        "gsa_price_with_iff__e_": "160.43",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "6.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Program Manger",
      "hourly_rate": 181.06,
      "source_sheet_name": "Price List",
      "source_row_number": 28,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "126.0",
        "title": "Program Manger",
        "description": "Directs the performance of a variety of related projects, which may be organized by technology, program or client. Oversees the technology development and/or application, marketing, and resource allocation within program client base. Program areas typically represents more than three functional areas that may include engineering, systems analysis, quality control, administration, etc. Primary duties and responsibilities Responsible for the effective management of funds and personnel, and is accountable for the quality and timely delivery of all contractual items. Operates within client guidance, contractual limitations, and Company business and policy directives. Serves as focal point of contact with client regarding program activities. Ensures that all required resources including manpower, production standards, computer time, and facilities are available for program implementation. Manages program consisting of multiple projects including project identification, design, development and delivery. Maintains the development and execution of business opportunities based on broad, general guidance. Confers with project manager to provide technical advice and to assist with problem resolution. Responsible for marketing new technology and follow on business acquisitions. Performs other duties as assigned",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "181.06",
        "gsa_price_with_iff__b_": "181.06",
        "gsa_price_with_iff__c_": "185.59",
        "gsa_price_with_iff__d_": "190.23",
        "gsa_price_with_iff__e_": "194.99",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Project Manager",
      "hourly_rate": 167.57,
      "source_sheet_name": "Price List",
      "source_row_number": 29,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "127.0",
        "title": "Project Manager",
        "description": "Provides project oversight and reports to the Program Manager and the COTR. Provides competent leadership and responsible program direction through successful performance of a variety of detailed, diverse elements of project transitioning.  Directs completion of tasks within estimated time frames and budget constraints.  Schedules and assigns duties to subordinates and subcontractors and ensures assignments are completed as directed.  Enforces work standards and reviews/resolves work discrepancies to ensure compliance with contract requirements.  Interfaces with the Program Manager as well as Government Technical Management personnel including, but not limited to, the Contracting Officer and the Contracting Officer’s Technical Representative.  Reports in writing and orally to contractor management and Government representatives.  Defines and directs technical specification and tasks to be performed by team members and defines target dates of tasks and subtasks.  Provides guidance and assistance in coordinating output and ensuring the technical adequacy of the end product. Ability to work with Government contracts personnel. Provides competent leadership and responsible program direction through successful performance of a variety of details, diverse elements of project transitioning.  Directs completion of tasks within estimated timeframes and budget constraints.  Schedules and assigns duties to subordinates and subcontractors and ensures assignments are completed as directed.  Enforces work standards and reviews/resolves work discrepancies to ensure compliance with contract requirements. Reports in writing and orally to contractor management and Government representatives.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "167.57",
        "gsa_price_with_iff__b_": "167.57",
        "gsa_price_with_iff__c_": "171.76",
        "gsa_price_with_iff__d_": "176.05",
        "gsa_price_with_iff__e_": "180.45",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Risk Vulnerability Assessment Analyst/Specialist",
      "hourly_rate": 116.04,
      "source_sheet_name": "Price List",
      "source_row_number": 30,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "128.0",
        "title": "Risk Vulnerability Assessment Analyst/Specialist",
        "description": "Conducts vulnerability assessments and penetration tests for application (e.g., Web, application services, databases, etc.) and articulates security issues to technical and non-technical audience.  Provide support by leveraging analytic and technical skills to discover cyber risks, assess vulnerabilities, prioritize assets and remediate/mitigate. Management of daily assessment of vulnerabilities, evaluate, rate and perform risk assessments of assets. Provide advice and assistance to the client and leadership to ensure that the policies and procedures established by the client are met. Provide Cybersecurity and consulting throughout the security assessment and compliance life cycle process. Performs data gathering, research, and analysis while conducting threat, vulnerability, risk, and maturity assessments; works under the direct supervision of manager/supervisor.  Works under general supervision and usually reports to a supervisor, though some ingenuity and flexibility is required.  Maintaining applicable Computer Network Defense (CND) policies, regulations, and compliance documents specifically related to Computer Network Defense auditing.",
        "sin": "54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "116.04",
        "gsa_price_with_iff__b_": "116.04",
        "gsa_price_with_iff__c_": "118.94",
        "gsa_price_with_iff__d_": "121.91",
        "gsa_price_with_iff__e_": "124.96",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "4.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Risk Vulnerability Assessment Analyst/Specialist (Infrastructure)",
      "hourly_rate": 105.91,
      "source_sheet_name": "Price List",
      "source_row_number": 31,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "129.0",
        "title": "Risk Vulnerability Assessment Analyst/Specialist (Infrastructure)",
        "description": "Conduct vulnerability assessments and penetration tests for infrastructure and articulate security issues to technical and non-technical audience.  Provide support by leveraging analytic and technical skills to discover cyber risks, assess vulnerabilities, prioritize assets and remediate/mitigate. Management of daily assessment of vulnerabilities, evaluate, rate and perform risk assessments of assets. Provide advice and assistance to the client and leadership to ensure that the policies and procedures established by the client are met. Provide Cybersecurity and consulting throughout the security assessment and compliance life cycle process. Performs data gathering, research, and analysis while conducting threat, vulnerability, risk, and maturity assessments. May apply critical thinking, conduct gap analysis, and develop implementation plans for the improvement of the risk management-related program and contribute to constant innovation and improvement; Works under general supervision and usually reports to a supervisor, though some ingenuity and flexibility is required.  Maintaining applicable Computer Network Defense (CND) policies, regulations, and compliance documents specifically related to Computer Network Defense auditing.",
        "sin": "54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "105.91",
        "gsa_price_with_iff__b_": "105.91",
        "gsa_price_with_iff__c_": "108.56",
        "gsa_price_with_iff__d_": "111.27",
        "gsa_price_with_iff__e_": "114.05",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Security Specialist Journeyman",
      "hourly_rate": 72.6,
      "source_sheet_name": "Price List",
      "source_row_number": 32,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "130.0",
        "title": "Security Specialist Journeyman",
        "description": "Provide security liaison support that includes, but is not limited to developing, implementing, overseeing, and enforcing Cybersecurity policies and procedures; supports incident handling and incident response coordination. Develops capabilities that support the cyber mission at multiple levels through the use of technology demonstration, integration of existing solutions, and development of new tactics to employ solutions. Provide Information Assurance (IA), computer network defense (CND), and technical review support to the government and contract operations to include: Reviews of requirements for security related capabilities. Working CND and IA background and skills, analysis, correlation, and prioritization of vulnerabilities discovered in scans and vendor bulletins. Monitors intrusion detection systems and other CND tools. Provides vulnerability tracking and status reporting on vendor provided or DoD mandated patches. Contributes to the development of innovative principles and ideas. Routinely exercise independent judgment in developing methods, techniques, and criteria for achieving cybersecurity objectives.",
        "sin": "54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "72.6",
        "gsa_price_with_iff__b_": "72.6",
        "gsa_price_with_iff__c_": "74.42",
        "gsa_price_with_iff__d_": "76.28",
        "gsa_price_with_iff__e_": "78.19",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Senior Network Design Engineer",
      "hourly_rate": 158.14,
      "source_sheet_name": "Price List",
      "source_row_number": 33,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "131.0",
        "title": "Senior Network Design Engineer",
        "description": "Defines the problems and analyzes and develops plans and requirements in the subject matter area for moderately complex to complex systems. Coordinates and manages the preparation of analysis, evaluations, and recommendations for proper implementation of programs and systems specifications in the following specialties: information systems architecture; networking; telecommunications; automation; communications protocols; risk management/electronic analysis; software; life-cycle management; software development methodologies; and modeling and simulation, leads network tech and design engineers.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "158.14",
        "gsa_price_with_iff__b_": "158.14",
        "gsa_price_with_iff__c_": "162.09",
        "gsa_price_with_iff__d_": "166.14",
        "gsa_price_with_iff__e_": "170.29",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "12.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Senior Program Manager",
      "hourly_rate": 380.44,
      "source_sheet_name": "Price List",
      "source_row_number": 34,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "132.0",
        "title": "Senior Program Manager",
        "description": "Over twelve years’ experience is leading and providing technical direction of MOBIS projects.  Demonstrated ability to provide guidance and direction for multiple projects and in designing, implementing and managing MOBIS. Capabilities to manage multitask projects of high complexity.   Provides primary interface with client management personnel regarding strategic issues.  Directs the completion of projects within estimated time frames and budget constraints.  Coordinates all parties to tasks, reviews work products for completeness and adherence to customer requirements.  Delivers presentation and leads strategic level client meetings.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "380.44",
        "gsa_price_with_iff__b_": "380.44",
        "gsa_price_with_iff__c_": "389.95",
        "gsa_price_with_iff__d_": "399.7",
        "gsa_price_with_iff__e_": "409.69",
        "minimum_education": "Masters",
        "minimum_years_of_education": "12.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Masters",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Senior Systems Analyst",
      "hourly_rate": 163.73,
      "source_sheet_name": "Price List",
      "source_row_number": 35,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "133.0",
        "title": "Senior Systems Analyst",
        "description": "Performs systems engineering planning; performance management; capacity planning, testing and validation; benchmarking; information engineering. Develops and staffs a systems engineering management plan. Supports a Sr. Systems Engineer, as required. Analyzes and develops technical documentation detailing the integration and system performance. Coordinates the activities of Systems Engineers and Jr. Systems Engineers assigned to specific systems engineering projects",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "163.73",
        "gsa_price_with_iff__b_": "163.73",
        "gsa_price_with_iff__c_": "167.82",
        "gsa_price_with_iff__d_": "172.02",
        "gsa_price_with_iff__e_": "176.32",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Senior Systems Consultant",
      "hourly_rate": 330.88,
      "source_sheet_name": "Price List",
      "source_row_number": 36,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "134.0",
        "title": "Senior Systems Consultant",
        "description": "Oversees assignments involving novel approaches to conducting high-level studies and resolving complex management problems.  Individually or with assistants, develops, analyzes, and advises on methods and techniques to improve organization work processes, procedures, manpower, management functions. Conducts management and organizational studies involving analysis of broad programs, functions, and organizations of government agencies at multiple locations and including controversial relationships",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "330.88",
        "gsa_price_with_iff__b_": "330.88",
        "gsa_price_with_iff__c_": "339.15",
        "gsa_price_with_iff__d_": "347.63",
        "gsa_price_with_iff__e_": "356.32",
        "minimum_education": "Masters",
        "minimum_years_of_education": "12.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Masters",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Senior Systems Engineer",
      "hourly_rate": 171.41,
      "source_sheet_name": "Price List",
      "source_row_number": 37,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "135.0",
        "title": "Senior Systems Engineer",
        "description": "Performs systems engineering planning; performance management; capacity planning, testing and validation; benchmarking; information engineering.  Develops and staffs a systems engineering management plan.  Supports a Sr. Systems Engineer, as required.  Analyzes and develops technical documentation detailing the integration and system performance.  Coordinates the activities of Systems Engineers and Jr. Systems Engineers assigned to specific systems engineering projects.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "171.41",
        "gsa_price_with_iff__b_": "171.41",
        "gsa_price_with_iff__c_": "175.7",
        "gsa_price_with_iff__d_": "180.09",
        "gsa_price_with_iff__e_": "184.59",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Senior Technical Director",
      "hourly_rate": 321.73,
      "source_sheet_name": "Price List",
      "source_row_number": 38,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "136.0",
        "title": "Senior Technical Director",
        "description": "Over eight years of progressive experience in leading MOBIS projects.  Demonstrated ability to provide guidance and direction for specific projects or sub-tasks.  Capabilities to manage multitask projects of high complexity.  Increasing responsibility in design, implementation and management of MOBIS.  Interfaces with the client on project specific issues.  Directs the completion of projects within estimated time frames and budget constraints.  Coordinates project specific parties and reviews work products for completeness and adherence to customer requirements.  Delivers presentation and leads client meetings.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "321.73",
        "gsa_price_with_iff__b_": "321.73",
        "gsa_price_with_iff__c_": "329.77",
        "gsa_price_with_iff__d_": "338.01",
        "gsa_price_with_iff__e_": "346.46",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Subject Matter Expert (SME) II",
      "hourly_rate": 218.86,
      "source_sheet_name": "Price List",
      "source_row_number": 39,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "137.0",
        "title": "Subject Matter Expert (SME) II",
        "description": "Responds to crisis and/or urgent situations to mitigate cyber security threats and attacks with an in-depth understanding of cybersecurity architecture and technologies. Provides technical knowledge and analysis of highly specialized applications and operational environment, high-level functional systems analysis, design, integration, documentation and implementation advice on exceptionally complex problems that require graduate level knowledge of the subject matter for effective implementation. Ensures that the all systems and data repositories maintain appropriate levels of confidentiality, integrity, authentication, non-repudiation, and availability, balancing the importance and sensitivity of the information assets and the information itself. Watch for potential threats; develops threat vectors identifying potential threat actors, vulnerabilities, and risks.  Coordinates and provides expert technical support to enterprise wide Computer Network Defense Technicians.  Provides cyber threat analysis and mitigation recommendations and reports regarding cyber and information security related risks, threats, and vulnerabilities. Designing, configuring, integration, and deployment of open source and commercial applications and tools to support the cybersecurity role and mission. Perform customary cyber support functions, including: intrusion detection, penetration testing, incident response, and forensic analysis. Assist in the development, management, and operation of processes to support analysis of log files from a variety systems and sensors to include individual host logs, network traffic logs, firewall logs, and intrusion detection/prevention system logs. Investigate tools, technologies, and techniques appropriate to the examination and mitigation of potential cyber threats or risks. Recommend and utilize metrics to capture, measure and report potential cybersecurity risks and threats. Examine (audit), evaluate and report potential system / architecture vulnerabilities and propose mitigation strategies. Assess, interpret, and applying cybersecurity and Information Assurance (IA) guidance, regulations, and related documentation. Must be proficient in the evaluation and application of a variety of cybersecurity concepts, practices, and procedures.",
        "sin": "54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "218.86",
        "gsa_price_with_iff__b_": "218.86",
        "gsa_price_with_iff__c_": "224.33",
        "gsa_price_with_iff__d_": "229.94",
        "gsa_price_with_iff__e_": "235.69",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Subject Matter Expert (SME) III",
      "hourly_rate": 223.5,
      "source_sheet_name": "Price List",
      "source_row_number": 40,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "138.0",
        "title": "Subject Matter Expert (SME) III",
        "description": "Responds to crisis and/or urgent situations to mitigate cyber security threats and attacks with an in-depth understanding of cybersecurity architecture and technologies. Provides technical knowledge and analysis of highly specialized applications and operational environment, high-level functional systems analysis, design, integration, documentation and implementation advice on exceptionally complex problems that require graduate level knowledge of the subject matter for effective implementation. Ensures that the all systems and data repositories maintain appropriate levels of confidentiality, integrity, authentication, non-repudiation, and availability, balancing the importance and sensitivity of the information assets and the information itself. Watch for potential threats; develops threat vectors identifying potential threat actors, vulnerabilities, and risks.  Coordinates and provides expert technical support to enterprise wide Computer Network Defense Technicians. Responsible for applying knowledge and experience of a variety of cyber concepts, practices, and procedures to evaluate technical and operational cybersecurity alternatives for various systems and environments. Must possess the proper knowledge and technical expertise for the and possess the baseline skill sets, certifications, and experience as needed for the specific cybersecurity SME level and Cyber Network Defense (CND) / Cybersecurity Service Provider (CSSP) specialty, as required to meet U.S. Department of Defense (DoD) Information Assurance Workforce Improvement Program (DoD 8570.01-M) standards for IAT Level III. Providing cyber threat analysis and mitigation recommendations and reports regarding cyber and information security related risks, threats, and vulnerabilities. Designing, configuring, integration, and deployment of open source and commercial applications and tools to support the cybersecurity role and mission. Perform customary cyber support functions, including: intrusion detection, penetration testing, incident response, and forensic analysis. Assist in the development, management, and operation of processes to support analysis of log files from a variety systems and sensors to include individual host logs, network traffic logs, firewall logs, and intrusion detection/prevention system logs. Investigate tools, technologies, and techniques appropriate to the examination and mitigation of potential cyber threats or risks. Recommend and utilize metrics to capture, measure and report potential cybersecurity risks and threats. Examine (audit), evaluate and report potential system / architecture vulnerabilities and propose mitigation strategies. Assess, interpret, and applying cybersecurity and Information Assurance (IA) guidance, regulations, and related documentation. Must be proficient in the evaluation and application of a variety of cybersecurity concepts, practices, and procedures.",
        "sin": "54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "223.5",
        "gsa_price_with_iff__b_": "223.5",
        "gsa_price_with_iff__c_": "229.09",
        "gsa_price_with_iff__d_": "234.82",
        "gsa_price_with_iff__e_": "240.69",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Systems Architect",
      "hourly_rate": 171.41,
      "source_sheet_name": "Price List",
      "source_row_number": 41,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "139.0",
        "title": "Systems Architect",
        "description": "Plans and performs systems and networking engineering research, design, development, and other assignments in conformance with system and network design, engineering, and customer specifications. Supervises team of Sr. Systems Engineers, Systems Engineers, Sr. Network Engineers, and Network Engineers. Responsible for highly complex technical/engineering projects. Coordinates the activities of Sr. Systems Engineers, Systems Engineers, Sr. Network Engineers, and Network Engineers assigned to specific system and network engineering projects. Is the lead technical authority on the project.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "171.41",
        "gsa_price_with_iff__b_": "171.41",
        "gsa_price_with_iff__c_": "175.7",
        "gsa_price_with_iff__d_": "180.09",
        "gsa_price_with_iff__e_": "184.59",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Task Lead",
      "hourly_rate": 205.95,
      "source_sheet_name": "Price List",
      "source_row_number": 42,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "140.0",
        "title": "Task Lead",
        "description": "Serves as the Contactor’s contract manager, and shall be the Contractor’s authorized interface with the Government Contracting Officer (CO), the Contracting Officer’s Technical Representative (COTR), government management personnel, and customer agency representatives.  Responsible for formulating and enforcing work standards; assigning Contractor schedules; reviewing work discrepancies; supervising Contractor personnel; preparing, reviewing and submitting required reports; and communicating the policies, purpose, and goals of the organization to subordinates.  Responsible for overall contract performance and quality assurance.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "205.95",
        "gsa_price_with_iff__b_": "205.95",
        "gsa_price_with_iff__c_": "211.1",
        "gsa_price_with_iff__d_": "216.38",
        "gsa_price_with_iff__e_": "221.79",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "6.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Task Manager",
      "hourly_rate": 152.16,
      "source_sheet_name": "Price List",
      "source_row_number": 43,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "141.0",
        "title": "Task Manager",
        "description": "Responsible for all aspects of project performance (i.e., technical, contractual, administrative, financial). Manages and supervises personnel involved in all aspects of project activity, organizes and assigns responsibilities to subordinates, and oversees the successful completion of all assigned tasks. Must be familiar with the principles of regularly exercising independent judgment, as well as a high level of analytical skill, in solving complex technical, administrative, and managerial problems. Provides overall direction for all project level activities.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "152.16",
        "gsa_price_with_iff__b_": "152.16",
        "gsa_price_with_iff__c_": "155.96",
        "gsa_price_with_iff__d_": "159.86",
        "gsa_price_with_iff__e_": "163.86",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Technical Writer",
      "hourly_rate": 98.23,
      "source_sheet_name": "Price List",
      "source_row_number": 44,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "142.0",
        "title": "Technical Writer",
        "description": "Documentation development. Plans, manages and coordinates documentation of all aspects of the system engineering life cycle for projects. Writes, edits and rewrites material of a technical nature. Prepares manuals, user guides, and other technical documentation for presentations. Possesses excellent writing skills. Must be knowledgeable of ADP operations and be able to verbally communicate effectively.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "98.23",
        "gsa_price_with_iff__b_": "98.23",
        "gsa_price_with_iff__c_": "100.69",
        "gsa_price_with_iff__d_": "103.21",
        "gsa_price_with_iff__e_": "105.79",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "4.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "UNIX Specialist",
      "hourly_rate": 134.81,
      "source_sheet_name": "Price List",
      "source_row_number": 45,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "143.0",
        "title": "UNIX Specialist",
        "description": "Providing support for systems operating under UNIX, including monitoring performance, performing system rebuilds/disk allocation, identifying system failures, and executing diagnostic routines.  Understanding of UNIX file systems, UNIX communication software and protocols including TCP/IP and X.25. Experience with system accounting and system security. Detailed knowledge required maintaining the System 5 Version 4 operating system and succeeding versions.  Working knowledge of current versions of software packages.  Ability to provide assistance with questions on the use of special features, report formatting, graphics capability, and communication network.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "134.81",
        "gsa_price_with_iff__b_": "134.81",
        "gsa_price_with_iff__c_": "138.18",
        "gsa_price_with_iff__d_": "141.63",
        "gsa_price_with_iff__e_": "145.17",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Web Design/Developer",
      "hourly_rate": 127.13,
      "source_sheet_name": "Price List",
      "source_row_number": 46,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "144.0",
        "title": "Web Design/Developer",
        "description": "Web Development. Responsible for enhancing the image and communicating the mission, goals, and achievements of the Government organizations using the World-Wide-Web with stunning graphics and creative communication. The ability to design and develop a comprehensive site plan and style guidelines. Experience with the development of Intranet(s) that increase the efficiency and effectiveness of operations. Working knowledge of: computers for drawing, word processing (MS Word), graphing, photo manipulation, painting (Photoshop), and Web page layout (e.g. Page Mill) software; graphics file formats and color palettes for web applications (e.g. GIF, JPG); World Wide Web (WWW) applications (Netscape, MS Explorer) and languages (e.g. HTML, JavaScript, and/or Java); a variety of computing platforms; and knowledge of web-database interaction.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "127.13",
        "gsa_price_with_iff__b_": "127.13",
        "gsa_price_with_iff__c_": "130.31",
        "gsa_price_with_iff__d_": "133.57",
        "gsa_price_with_iff__e_": "136.91",
        "minimum_education": "Associates",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Associates",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Infrastructure Application and Database SME - Intermediate",
      "hourly_rate": 145.96,
      "source_sheet_name": "Price List",
      "source_row_number": 47,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "145.0",
        "title": "Infrastructure Application and Database SME - Intermediate",
        "description": "Provides expert support, analysis and research into exceptionally complex problems, and processes relating to the subject matter. Serves as technical expert on executive-level project teams providing technical direction, interpretation and alternatives. Thinks independently and demonstrates exceptional written and oral communications skills. Has strong command of the English language. Applies advanced technical principles, theories, and concepts. Contributes to the development of new principles and concepts. Works on unusually complex technical problems and provides solutions, which are highly innovative and ingenious. Works under consultative direction toward predetermined long-range goals and objectives. Assignments are often selfinitiated. Determines and pursues courses of action necessary to obtain desired results. Develops advanced technological ideas and guides their development into a final product. Provides IT services in multiple technical areas (e.g., Information Systems Architecture, Telecommunications Systems Design, Architecture, Implementation, Information Systems Integration, Software Development Methodologies, Security Engineering, Communications and Network Systems Management), or a specific functional area (e.g., finance, logistics, and operations research). Administers and troubleshoots Oracle EBS Financial ERP, Oracle Database, Service Oriented Architecture (SOA), Single Sign-On (SSO)/Oracle Access Manager (OAM), Oracle Business Intelligence Suite Enterprise Edition (OBIEE), Hyperion, Enterprise Data Quality (EDQ) software, Oracle User Productivity Kit (UPK), and Oracle Governance, Risk, Compliance tools, and cloning. Implements Oracle Real Application Cluster (RAC), Active Dataguard, Golden Gate, and database performance tuning within the Oracle EBS environment. Provides technical writing to ensure all reports and deliverables are delivered with timeliness and quality to the government. Supported DoD or Federal Oracle shared service providers on an Oracle EBS R12.2 platform or higher. Must possess IT-I security clearance or have a current SSBI at time of proposal submission. DoD 8570.01-M Certification: DFARS 252.239-7001 Information Assurance Contractor Training of IAT Level II and Certification is required for this position. CE Certification - Oracle Certified Associate (OCA), Oracle Certified Professional (OCP), or Oracle WebLogic Server 12c or higher and IA Certification – Security+ CE.",
        "sin": "54151S, 54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "145.96",
        "gsa_price_with_iff__b_": "145.96",
        "gsa_price_with_iff__c_": "149.61",
        "gsa_price_with_iff__d_": "153.35",
        "gsa_price_with_iff__e_": "157.18",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "7.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "support,analysis,research,implementation",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Infrastructure Application and Database SME - Senior",
      "hourly_rate": 164.8,
      "source_sheet_name": "Price List",
      "source_row_number": 48,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "146.0",
        "title": "Infrastructure Application and Database SME - Senior",
        "description": "Provides support, analysis and research into exceptionally complex problems, and processes relating to the subject matter. Serves as technical expert on executive-level project teams providing technical direction, interpretation and alternatives. Thinks independently and demonstrates exceptional written and oral communications skills. Has strong command of the English language. Applies advanced technical principles, theories, and concepts. Contributes to the development of new principles and concepts. Works on unusually complex technical problems and provides solutions, which are highly innovative and ingenious. Works under consultative direction toward predetermined long-range goals and objectives. Assignments are often self-initiated. Determines and pursues courses of action necessary to obtain desired results. Develops advanced technological ideas and guides their development into a final product. Provide IT services in multiple technical areas (e.g., Information Systems Architecture, Telecommunications Systems Design, Architecture, Implementation, Information Systems Integration, Software Development Methodologies, Security Engineering, Communications and Network Systems Management), or a specific functional area (e.g., finance, logistics, and operations research). Administers and troubleshoots Oracle EBS Financial ERP, Oracle Database, Service Oriented Architecture (SOA), Single Sign-On (SSO)/Oracle Access Manager (OAM), Oracle Business Intelligence Suite Enterprise Edition (OBIEE), Hyperion, Enterprise Data Quality (EDQ) software, Oracle User Productivity Kit (UPK), and Oracle Governance, Risk, Compliance tools, and cloning. Implements Oracle Real Application Cluster (RAC), Active Dataguard, Golden Gate, and database performance tuning within the Oracle EBS environment. Supported DoD or Federal Oracle shared service providers on an Oracle EBS R12.2 platform or higher. Must possess IT-I security clearance or have a current SSBI at time of proposal submission. DoD 8570.01-M Certification: DFARS 252.239-7001 Information Assurance Contractor Training of IAT Level II and Certification is required for this position. CE Certification - Oracle Certified Associate (OCA), Oracle Certified Professional (OCP), or Oracle WebLogic Server 12c or higher and IA Certification – Security+ CE.",
        "sin": "54151S, 54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "164.8",
        "gsa_price_with_iff__b_": "164.8",
        "gsa_price_with_iff__c_": "168.92",
        "gsa_price_with_iff__d_": "173.14",
        "gsa_price_with_iff__e_": "177.47",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "support,analysis,research,implementation",
        "domestic__overseas_or_domestic_and_overseas": "Domestic",
        "dol_occupation_code": "x",
        "dol_wage_determination": "x"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Infrastructure Application and Database SME - Lead",
      "hourly_rate": 188.33,
      "source_sheet_name": "Price List",
      "source_row_number": 49,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "147.0",
        "title": "Infrastructure Application and Database SME - Lead",
        "description": "Provides support, analysis and research into exceptionally complex problems, and processes relating to the subject matter. Serves as technical expert on executive-level project teams providing technical direction, interpretation and alternatives. Thinks independently and demonstrates exceptional written and oral communications skills. Has strong command of the English language. Applies advanced technical principles, theories, and concepts. Contributes to the development of new principles and concepts. Works on unusually complex technical problems and provides solutions, which are highly innovative and ingenious. Administers and troubleshoots Oracle EBS Financial ERP, Oracle Database, Service Oriented Architecture (SOA), Single Sign-On (SSO)/Oracle Access Manager (OAM), Oracle Business Intelligence Suite Enterprise Edition (OBIEE), Hyperion, Enterprise Data Quality (EDQ) software, Oracle User Productivity Kit (UPK), and Oracle Governance, Risk, Compliance tools, and cloning. Implements Oracle Real Application Cluster (RAC), Active Dataguard, Golden Gate, and database performance tuning within the Oracle EBS environment. Provides technical writing to ensure all reports and deliverables are delivered with timeliness and quality to the government. Supported DoD or Federal Oracle shared service providers on an Oracle EBS R12.2 platform or higher. Must possess IT-I security clearance or have a current SSBI at time of proposal submission. DoD 8570.01-M Certification: DFARS 252.239-7001 Information Assurance Contractor Training of IAT Level II and Certification is required for this position. CE Certification - Oracle Certified Associate (OCA), Oracle Certified Professional (OCP), or Oracle WebLogic Server 12c or higher and IA Certification – Security+ CE.",
        "sin": "54151S, 54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "188.33",
        "gsa_price_with_iff__b_": "188.33",
        "gsa_price_with_iff__c_": "193.04",
        "gsa_price_with_iff__d_": "197.87",
        "gsa_price_with_iff__e_": "202.82",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "support,analysis,research,implementation",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Data Visualization Specialist - Junior",
      "hourly_rate": 81.16,
      "source_sheet_name": "Price List",
      "source_row_number": 50,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "148.0",
        "title": "Data Visualization Specialist - Junior",
        "description": "Undergraduate degree required. Must have the minimum years’ experience that is directly related to the following duties and responsibilities: • Experience across both COTS and custom developed user interfaces for data visualization • Provides preparation of data in support of visual analysis objectives • Applies critical problem-solving skills and data analysis techniques to provide underlying data models in support of visualization efforts • Builds models within data visualization framework that supports key performance indicators (KPIs) and metrics • Independently designs and develops data visualizations to provide actionable insights for addressing strategic and tactical mission objectives • Develops visualizations to manipulate low complexity datasets in simple, intuitive, interactive formats • Experience with custom developed visualizations using D3, HTML, JavaScript, etc. • Experiences with COTS enterprise data visualization tools (e.g., Qlik, SAP Lumira) • Experience developing data visualizations against ERP transactional and analytical data models • Creates simple queries, stored procedures to deliver dynamic data visualizations",
        "sin": "54151S, 54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "81.16",
        "gsa_price_with_iff__b_": "81.16",
        "gsa_price_with_iff__c_": "83.19",
        "gsa_price_with_iff__d_": "85.27",
        "gsa_price_with_iff__e_": "87.4",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "2.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "data visualization,design,tactical,metrics",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Data Visualization Specialist - Mid-Level",
      "hourly_rate": 95.46,
      "source_sheet_name": "Price List",
      "source_row_number": 51,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "149.0",
        "title": "Data Visualization Specialist - Mid-Level",
        "description": "Undergraduate degree required. Must have the minimum years’ experience that is directly related to the following duties and responsibilities: • Experience across both COTS and custom developed user interfaces for data visualization • Develops visualizations to manipulate complex datasets in simple, intuitive, interactive formats 75 • Independently designs and develops data visualizations to provide actionable insights for addressing strategic and tactical mission objectives • Develops visualizations to manipulate medium complexity datasets in simple, intuitive, interactive formats • Experience with custom-developed visualizations using D3, HTML, JavaScript, etc. • Experiences with COTS enterprise data visualization tools (e.g., Qlik, SAP Lumira) • Ability to work iteratively with the business community to gather requirements and develop enterprise level visualizations using agile methods • Experience developing data visualizations against ERP transactional and analytical data models • Creates medium complexity queries, stored procedures to deliver dynamic data visualizations",
        "sin": "54151S, 54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "95.46",
        "gsa_price_with_iff__b_": "95.46",
        "gsa_price_with_iff__c_": "97.85",
        "gsa_price_with_iff__d_": "100.3",
        "gsa_price_with_iff__e_": "102.81",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "4.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "data visualization,design,tactical,metrics",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Data Visualization Specialist - Senior",
      "hourly_rate": 129.84,
      "source_sheet_name": "Price List",
      "source_row_number": 52,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "150.0",
        "title": "Data Visualization Specialist - Senior",
        "description": "Undergraduate degree required. Must have the minimum years’ experience that is directly related to the following duties and responsibilities: • Leads initiatives utilizing data visualization tools to provide actionable insights for addressing strategic and tactical mission objectives • Develops visualizations to manipulate complex datasets in simple, intuitive, interactive formats • Communicates information clearly and efficiently, enabling data-driven decisions and analysis • Experience with complex custom developed visualizations using D3, HTML, JavaScript, etc. • Experience with COTS enterprise data visualization tools (e.g., Qlik, SAP Lumira) • Ability to work iteratively with the business community to gather requirements and develop enterprise level visualizations using agile methods • Experience developing data visualizations against ERP transactional and analytical data models • Creates complex queries, stored procedures to deliver dynamic data visualizations",
        "sin": "54151S, 54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "129.84",
        "gsa_price_with_iff__b_": "129.84",
        "gsa_price_with_iff__c_": "133.09",
        "gsa_price_with_iff__d_": "136.42",
        "gsa_price_with_iff__e_": "139.83",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "data visualization,design,tactical,metrics",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Computer Security Systems Specialist - Basic",
      "hourly_rate": 73.88,
      "source_sheet_name": "Price List",
      "source_row_number": 53,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "151.0",
        "title": "Computer Security Systems Specialist - Basic",
        "description": "Provides specialized experience in determining computer security requirements for high-level applications, evaluating approved security product capabilities, and developing solutions to multilevel security (MLS) problems. Analyzes and defines security requirements for MLS issues. Designs, develops, engineers, and implements solutions to MLS requirements. Gathers and organizes technical information about an organization's mission goals and needs, existing security products, and ongoing programs in the MLS arena. Performs risk analysis, which includes risk assessment.",
        "sin": "54151S, 54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "73.88",
        "gsa_price_with_iff__b_": "73.88",
        "gsa_price_with_iff__c_": "75.73",
        "gsa_price_with_iff__d_": "77.62",
        "gsa_price_with_iff__e_": "79.56",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "designs,develops,engineers,implements,MLS",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Computer Security Systems Specialist - Senior",
      "hourly_rate": 123.13,
      "source_sheet_name": "Price List",
      "source_row_number": 54,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "152.0",
        "title": "Computer Security Systems Specialist - Senior",
        "description": "Provides specialized experience in determining computer security requirements for high-level applications, evaluating approved security product capabilities, and developing solutions to multilevel security (MLS) problems. Analyzes and defines security requirements for MLS issues. Designs, develops, engineers, and implements solutions to MLS requirements. Gathers and organizes technical information about an organization's mission goals and needs, existing security products, and ongoing programs in the MLS arena. Performs risk analysis, which includes risk assessment. Provides daily supervision of, and direction to, staff. Must possess IT-II security clearance or have a current National Agency Check with Local Agency Check and Credit Check (NACLC) at time of proposal submission. Relevant certification from a nationally recognized technical authority.",
        "sin": "54151S, 54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "123.13",
        "gsa_price_with_iff__b_": "123.13",
        "gsa_price_with_iff__c_": "126.21",
        "gsa_price_with_iff__d_": "129.37",
        "gsa_price_with_iff__e_": "132.6",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "designs,develops,engineers,implements,MLS",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Engineering SME",
      "hourly_rate": 125.54,
      "source_sheet_name": "Price List",
      "source_row_number": 55,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "153.0",
        "title": "Engineering SME",
        "description": "Provides technical knowledge and analysis of highly specialized applications and operational environment, highlevel functional systems analysis, design, integration, documentation, and implementation advice on exceptionally complex problems that necessitate high-level knowledge of the subject matter for effective implementation. Participates as needed in all phases of software development with emphasis on the planning, analysis, modeling, simulation, testing, integration, documentation and presentation phases. Must possess IT-II security clearance or have a current National Agency Check with Local Agency Check and Credit Check (NACLC) at time of proposal submission. Relevant certification from a nationally recognized technical authority.",
        "sin": "54151S, 54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "125.54",
        "gsa_price_with_iff__b_": "125.54",
        "gsa_price_with_iff__c_": "128.68",
        "gsa_price_with_iff__d_": "131.9",
        "gsa_price_with_iff__e_": "135.2",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "planning,modeling,testing,integration,documentation",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Software Architect",
      "hourly_rate": 139.23,
      "source_sheet_name": "Price List",
      "source_row_number": 56,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "154.0",
        "title": "Software Architect",
        "description": "Designs and develops new software products or major enhancements to existing software. Addresses problems of systems integration, compatibility, and multiple platforms. Responsible for project completion. Performs feasibility analysis on potential future projects for management. Must possess IT-II security clearance or have a current National Agency Check with Local Agency Check and Credit Check (NACLC) at time of proposal submission. Relevant certification from a nationally recognized technical authority.",
        "sin": "54151S, 54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "139.23",
        "gsa_price_with_iff__b_": "139.23",
        "gsa_price_with_iff__c_": "142.71",
        "gsa_price_with_iff__d_": "146.28",
        "gsa_price_with_iff__e_": "149.94",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "systems integration,compatibility,project completion,software",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Software Systems Engineer",
      "hourly_rate": 125.54,
      "source_sheet_name": "Price List",
      "source_row_number": 57,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "155.0",
        "title": "Software Systems Engineer",
        "description": "Formulates/defines specifications for complex operating software programming applications or modifies/maintains complex existing applications using engineering releases and utilities from the manufacturer. Designs, codes, tests, debugs, and documents those programs. Provides overall operating system maintenance, such as sophisticated file maintenance routines, large telecommunications networks, computer accounting, and advanced mathematical/scientific software packages. Assists all phases of software systems programming applications. Evaluates new and existing software products. Must possess IT-II security clearance or have a current National Agency Check with Local Agency Check and Credit Check (NACLC) at time of proposal submission. Relevant certification from a nationally recognized technical authority.",
        "sin": "54151S, 54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "125.54",
        "gsa_price_with_iff__b_": "125.54",
        "gsa_price_with_iff__c_": "128.68",
        "gsa_price_with_iff__d_": "131.9",
        "gsa_price_with_iff__e_": "135.2",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "designs,codes,tests,debugs,maintenance",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Computer Network Defense (CND) Analyst",
      "hourly_rate": 144.04,
      "source_sheet_name": "Price List",
      "source_row_number": 58,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "156.0",
        "title": "Computer Network Defense (CND) Analyst",
        "description": "Performs actions to protect, monitor, detect, analyze, and respond to unauthorized activity within assigned information systems and computer networks. Employs Cybersecurity capabilities and deliberate actions to respond to a CND alert or emerging situational awareness/threat. Serves as an expert on CND requirements and compliance to such requirements by using IA tools and techniques to perform compliance analysis and correlation, tracking and remediation coordination, and escalating CND non-compliance. Provides technical analysis and sustainment support for the enterprise for IA tools and applications, and assists with the application of Defense-In-Depth signatures and perimeter defense controls to diminish network threats. Must possess a current DOD Top Secret Clearance and be eligible for an IT-1 at time of proposal submission. Relevant certification from a nationally recognized technical authority meeting DOD 8570.01 IAT level II.",
        "sin": "54151S, 54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "144.04",
        "gsa_price_with_iff__b_": "144.04",
        "gsa_price_with_iff__c_": "147.64",
        "gsa_price_with_iff__d_": "151.33",
        "gsa_price_with_iff__e_": "155.11",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "protect,monitor,detect,analyze,cybersecurity",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Database Administrator",
      "hourly_rate": 86.64,
      "source_sheet_name": "Price List",
      "source_row_number": 59,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "157.0",
        "title": "Database Administrator",
        "description": "Provides all activities related to the administration of computerized databases. Projects long-range requirements for database administration and design in conjunction with other managers in the information systems function. Designs, creates, and maintains databases in a client/server environment. Conducts quality control and auditing of databases in a client/server environment to ensure accurate and appropriate use of data. Advises users on access to various client/server databases. Designs, implements, and maintains complex databases with respect to JCL, access methods, access time, device allocation, validation checks, organization, protection and security, documentation, and statistical methods. Applies knowledge and experience with database technologies, development methodologies, and front-end /back-end programming languages (e.g., SQL). Performs database programming and supports systems design. Includes maintenance of database dictionaries, overall monitoring of standards and procedures, file design and storage, and integration of systems through database design. Five (5) years progressive experience of database query languages such as Oracle, PL SQL, SQL Server, and MS Access. Also has at least three years hands-on experience and expertise in Relational Database Management Systems. Experience also shall include capability to work on various operating systems and additional programming languages. Has experience in at least two projects in a large organization responsible for administering, operating, maintaining, and securing a large-scale computer database. Sensitivity Level: IT-I – Critical Sensitive. Clearance: Secret. IA Level: IAT II. Computing Environment: OCP18 ; OCM18; GSOC; DB2; M2008 SQL 8; MCITP DBA; MCITP DBD; MCM: MS SQL Server 2008; MCA: MS SQL Server, MCSE:DP, MCSM:DP, MCSA:SQL2008, M2012 SQL",
        "sin": "54151S, 54151HACS",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "86.64",
        "gsa_price_with_iff__b_": "86.64",
        "gsa_price_with_iff__c_": "88.81",
        "gsa_price_with_iff__d_": "91.03",
        "gsa_price_with_iff__e_": "93.31",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "maintains complex databases,organization,protection,security,documentation",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Admin Support",
      "hourly_rate": 81.09,
      "source_sheet_name": "Price List",
      "source_row_number": 60,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "158.0",
        "title": "Admin Support",
        "description": "Performs administrative management tasks such as word processing, spreadsheet development administrative typing and filing. Helps produce and prepare deliverables. Maintains schedules, schedules meetings, take minutes and prepares meeting notes.",
        "sin": "541611",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "81.09",
        "gsa_price_with_iff__b_": "81.09",
        "gsa_price_with_iff__c_": "83.12",
        "gsa_price_with_iff__d_": "85.2",
        "gsa_price_with_iff__e_": "87.33",
        "minimum_education": "High_School",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Administrative Management,Production and Preparation",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "High_School",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Analyst",
      "hourly_rate": 114.37,
      "source_sheet_name": "Price List",
      "source_row_number": 61,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "159.0",
        "title": "Analyst",
        "description": "Analyzes user needs to determine functional tasks and their interrelationships. Identifies resources required for each task. Capable of using problem solving techniques to adequately resolve complex task. Experience, including developing functional requirements, provide analysis, assessment, technical or business areas",
        "sin": "541611",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "114.37",
        "gsa_price_with_iff__b_": "114.37",
        "gsa_price_with_iff__c_": "117.23",
        "gsa_price_with_iff__d_": "120.16",
        "gsa_price_with_iff__e_": "123.16",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Analysis,Resource Identification,Problem Resolution",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Business Process Consultant",
      "hourly_rate": 131.47,
      "source_sheet_name": "Price List",
      "source_row_number": 62,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "160.0",
        "title": "Business Process Consultant",
        "description": "Plans and conducts business reengineering engagements. Manages cost, schedule, and quality of Re-engineering tasks. Defines information needs, and develops business and data architectures. Provides input for technical architectures in the form of business requirements. Conducts interviews, GroupWare work sessions, and focus groups. Develops recommended solutions.",
        "sin": "541611",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "131.47",
        "gsa_price_with_iff__b_": "131.47",
        "gsa_price_with_iff__c_": "134.76",
        "gsa_price_with_iff__d_": "138.13",
        "gsa_price_with_iff__e_": "141.58",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Business Re-engineering,Management,Solution Development",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Business Systems Analyst",
      "hourly_rate": 89.03,
      "source_sheet_name": "Price List",
      "source_row_number": 63,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "161.0",
        "title": "Business Systems Analyst",
        "description": "This position requires a superior knowledge of process assessment and development, ability to obtain and document methods and procedures and process workload assessment. The individual has experience in assisting consultants, engineers, scientists and program officials in planning research project designs and managing progress of studies by reviewing proposals, estimating work hour requirements and advising on the most efficient sequencing of events. The SME must have demonstrated successful experience in the area of research, analysis, design, implementation, and testing as well as, the writing specifications and documentation; and the design of a business area system to support financial and program management of large-scale multi-user computer information and retrieval system.",
        "sin": "541611",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "89.03",
        "gsa_price_with_iff__b_": "89.03",
        "gsa_price_with_iff__c_": "91.26",
        "gsa_price_with_iff__d_": "93.54",
        "gsa_price_with_iff__e_": "95.88",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Analysis,Assistance,Design and Implementation",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Consultant",
      "hourly_rate": 185.15,
      "source_sheet_name": "Price List",
      "source_row_number": 64,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "162.0",
        "title": "Consultant",
        "description": "Directs activities to implement and manage projects. Possesses expertise to define problems, collect data, establish facts and draw valid conclusions. Provides leadership and technical expertise in the areas of delivering process and productivity improvement solutions, facilitation large and small groups, developing business and strategic plans, providing performance measurement and business process reengineering training, and conducting financial and cycle-time analysis.",
        "sin": "541611",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "185.15",
        "gsa_price_with_iff__b_": "185.15",
        "gsa_price_with_iff__c_": "189.78",
        "gsa_price_with_iff__d_": "194.52",
        "gsa_price_with_iff__e_": "199.38",
        "minimum_education": "Masters",
        "minimum_years_of_education": "15.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Consulting Direction,Expertise,Strategic Planning",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Masters",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Functional Analyst",
      "hourly_rate": 154.07,
      "source_sheet_name": "Price List",
      "source_row_number": 65,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "163.0",
        "title": "Functional Analyst",
        "description": "Analyzes user needs to determine functional requirements, tasks and their interrelationships. Identifies resources required for each task. Document procedures and processes for improvement. Provides daily supervision and direction to staff.",
        "sin": "541611",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "154.07",
        "gsa_price_with_iff__b_": "154.07",
        "gsa_price_with_iff__c_": "157.92",
        "gsa_price_with_iff__d_": "161.87",
        "gsa_price_with_iff__e_": "165.92",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "7.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Functional Requirement Analsys,Reource Identification",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "IT Subject Matter Specialist",
      "hourly_rate": 156.79,
      "source_sheet_name": "Price List",
      "source_row_number": 66,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "164.0",
        "title": "IT Subject Matter Specialist",
        "description": "Performs as an expert source of knowledge and expertise within a specialized functional or technical area. Provides specific technical and/or functional guidance reflecting detailed, expert knowledge of a specific area or function.  Develops benchmarks.",
        "sin": "541611",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "156.79",
        "gsa_price_with_iff__b_": "156.79",
        "gsa_price_with_iff__c_": "160.71",
        "gsa_price_with_iff__d_": "164.73",
        "gsa_price_with_iff__e_": "168.85",
        "minimum_education": "Masters",
        "minimum_years_of_education": "15.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Benchmarking,Analysis,Expert Knowledge",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Masters",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Management Consultant-Senior",
      "hourly_rate": 305.0,
      "source_sheet_name": "Price List",
      "source_row_number": 67,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "165.0",
        "title": "Management Consultant-Senior",
        "description": "Oversees assignments involving novel approaches to conducting high-level studies and resolving complex management problems.  Individually or with two assistants, develops, analyzes, and advises on methods and techniques to improve organization work processes, procedures, manpower, management functions. Conducts management and organizational studies involving analysis of broad programs, functions, and organizations of government agencies at multiple locations and including controversial relationships. Based upon study findings, develops detailed recommendations on methods, procedures to apply, alternative ways to organize efficiently and generate staff and dollar savings. Develops project plans, determines resource needs and allocates them. Determines information needed to perform in- depth analysis. Devises methods for securing the required information and develops survey data sources, on-site investigations, discussions with managers or specialists at the work site. Identifies problems and develops recommendations.  Participates in the procurement process, and conducts or coordinates related training. Coordinates actions with direct client and corporate headquarters staff. Keeps project manager and management aware of status, problems, and solutions.",
        "sin": "541611",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "305.0",
        "gsa_price_with_iff__b_": "305",
        "gsa_price_with_iff__c_": "312.63",
        "gsa_price_with_iff__d_": "320.45",
        "gsa_price_with_iff__e_": "328.46",
        "minimum_education": "Masters",
        "minimum_years_of_education": "15.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Oversight,Problem Resolution,Management,Coordination",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Masters",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Policy and Compliance Manager",
      "hourly_rate": 151.87,
      "source_sheet_name": "Price List",
      "source_row_number": 68,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "166.0",
        "title": "Policy and Compliance Manager",
        "description": "Subject Matter Expert-Policy and Compliance provides consulting, management, organizational subject matter technical expertise, functional expertise, or consultant expertise on advanced and state of art methods, theories and technical required in the investigation and solution of complex concepts, planning, design, and/or implementation problems related to the subject matter. The SME provides consulting services that may include some level of direct participation in all subject matter activities relating to government compliance.",
        "sin": "541611",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "151.87",
        "gsa_price_with_iff__b_": "151.87",
        "gsa_price_with_iff__c_": "155.67",
        "gsa_price_with_iff__d_": "159.56",
        "gsa_price_with_iff__e_": "163.55",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "6.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Technical SME,Consulting,Organization,Compliance",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Portfolio Manager",
      "hourly_rate": 166.56,
      "source_sheet_name": "Price List",
      "source_row_number": 69,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "167.0",
        "title": "Portfolio Manager",
        "description": "Senior level Strategic Planning/Portfolio Management (PfM) support personnel capable of assisting in the development and implementation of PfM methods, processes and tools. May assist in the development and implementation of continuous integrated activities to manage portfolios – analysis, selection, control, and evaluation processes. Will provide a balanced strategy for making decisions and recommendations based on enterprise strategic planning, integrated architectures, and outcome-based performance measures to achieve desired mission capabilities.",
        "sin": "541611",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "166.56",
        "gsa_price_with_iff__b_": "166.56",
        "gsa_price_with_iff__c_": "170.72",
        "gsa_price_with_iff__d_": "174.99",
        "gsa_price_with_iff__e_": "179.36",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Strategic Planning,Portfolio Management,Strategize",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Program Manager",
      "hourly_rate": 158.55,
      "source_sheet_name": "Price List",
      "source_row_number": 70,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "168.0",
        "title": "Program Manager",
        "description": "Serves as the Contactor s contract manager, and shall be the Contractor s authorized interface with the Government Contracting Officer (CO), the Contracting Officer s Technical Representative (COTR), government management personnel, and customer agency representatives. Responsible for formulating and enforcing work standards; assigning Contractor schedules; reviewing work discrepancies; supervising Contractor personnel; preparing, reviewing and submitting required reports; and communicating the policies, purpose, and goals of the organization to subordinates. Responsible for overall contract performance and quality assurance Minimum Education: Bachelor’s Degree in an Information Technology related discipline.",
        "sin": "541611",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "158.55",
        "gsa_price_with_iff__b_": "158.55",
        "gsa_price_with_iff__c_": "162.51",
        "gsa_price_with_iff__d_": "166.57",
        "gsa_price_with_iff__e_": "170.73",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Standards Formulation,Supervision,Report Preparation",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Program Manager-Sr.",
      "hourly_rate": 333.33,
      "source_sheet_name": "Price List",
      "source_row_number": 71,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "169.0",
        "title": "Program Manager-Sr.",
        "description": "Demonstrated ability to lead, provide technical direction of complex projects, provide guidance and direction for multiple projects and in designing, implementing and managing. Capabilities to manage multitask projects of high complexity. Provides primary interface with client management personnel regarding strategic issues. Directs the completion of projects within estimated time frames and budget constraints. Coordinates all parties to tasks, reviews work products for completeness and adherence to customer requirements. Delivers presentation and leads strategic level client meetings.",
        "sin": "541611",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "333.33",
        "gsa_price_with_iff__b_": "333.33",
        "gsa_price_with_iff__c_": "341.66",
        "gsa_price_with_iff__d_": "350.2",
        "gsa_price_with_iff__e_": "358.96",
        "minimum_education": "Masters",
        "minimum_years_of_education": "15.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Direction,Implementation Oversight,Coordination",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Masters",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Sr. Project Manager",
      "hourly_rate": 143.07,
      "source_sheet_name": "Price List",
      "source_row_number": 72,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "170.0",
        "title": "Sr. Project Manager",
        "description": "Senior level Project Management support personnel capable of providing methods, processes and tools to strive for cost, schedule and performance efficiencies. The individual shall provide management support in developing and responding to data calls, white papers and requests for information from multiple sources. The Project Management personnel will develop initial and final revisions within the time required to support scheduled deadlines. They will be able to analyze business and technical issues to gain an understanding of how the technology will be implemented and utilized with current processes. The Project Manager will also be able to determine and maintain a schedule of milestones and deliverables for IT projects.",
        "sin": "541611",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "143.07",
        "gsa_price_with_iff__b_": "143.07",
        "gsa_price_with_iff__c_": "146.65",
        "gsa_price_with_iff__d_": "150.32",
        "gsa_price_with_iff__e_": "154.08",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Project Management,Business Analysis,Technical Analysis",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Task Leader",
      "hourly_rate": 133.23,
      "source_sheet_name": "Price List",
      "source_row_number": 73,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "171.0",
        "title": "Task Leader",
        "description": "Serves as the Contactor’s contract manager, and shall be the Contractor’s authorized interface with the Government Contracting Officer (CO), the Contracting Officer’s Representative (COR), government management personnel and customer agency representatives. Responsible for formulating and enforcing work standards; assigning Contractor schedules; reviewing work discrepancies; supervising Contractor personnel; preparing, reviewing and submitting required reports and communicating policies, purpose and goals of the organization to subordinates. Responsible for the overall contract performance and quality assurance.",
        "sin": "541611",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "133.23",
        "gsa_price_with_iff__b_": "133.23",
        "gsa_price_with_iff__c_": "136.56",
        "gsa_price_with_iff__d_": "139.97",
        "gsa_price_with_iff__e_": "143.47",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Supervision,Review,Report Preparation,Quality Assurance",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    },
    {
      "contract_number": "47QTCA19D0092",
      "labor_category": "Technical Director-Senior",
      "hourly_rate": 352.12,
      "source_sheet_name": "Price List",
      "source_row_number": 74,
      "raw_data": {
        "vendor_name": "THE ONE 23 GROUP INC.",
        "unique_catalog_item_id": "172.0",
        "title": "Technical Director-Senior",
        "description": "Acts as principal lead on analytical, consulting, or assessment processes in support of technical, business & administrative goals of the program. Often performs analysis requiring advanced training and degrees. Offers advanced technical or practical knowledge of highly specialized task.  Prepares and organizes reports identifying results of study and evaluation. Make recommendations on appropriate actions. Types of personnel that are included in this category are senior managers that lead operation or support departments or programs and very senior level technical and operations staff.",
        "sin": "541611",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "352.12",
        "gsa_price_with_iff__b_": "352.12",
        "gsa_price_with_iff__c_": "360.92",
        "gsa_price_with_iff__d_": "369.94",
        "gsa_price_with_iff__e_": "379.19",
        "minimum_education": "Masters",
        "minimum_years_of_education": "15.0",
        "education_and_experience_substitution": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Lead,Analysis,Consulting,Technical Assessment",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Masters",
      "years_experience": "4 years of additional relevant experience equals Bachelors Degree. 6 years of additional relevant experience equals Masters Degree. 8 years of additional relevant experience equals Ph.D.",
      "security_clearance": "No",
      "contractor_id": 8672,
      "price_list_id": 878
    }
  ],
  "parsed_at": "2025-11-06T11:47:23.305716"
}