{
  "contract_number": "47QTCA22D006A",
  "contractor_id": 1316,
  "price_list_id": 1275,
  "labor_categories": [
    {
      "contract_number": "47QTCA22D006A",
      "labor_category": "Program Manager",
      "hourly_rate": 180.51,
      "source_sheet_name": "Price List",
      "source_row_number": 3,
      "raw_data": {
        "vendor_name": "ALL HANDS ON TECH LLC",
        "unique_catalog_item_id": "101.0",
        "title": "Program Manager",
        "description": "Minimum/General Experience: Minimum of 12 years of specialized experience which applies to systems development life cycle project planning, program management, and control. Requires competence in all phases of systems development and program support operations involving multiple IT projects and task orders. Good understanding of open source and proprietary information technologies. Functional Responsibility: Responsible for managing IT applications programs that include full life cycle development of applications including complex deployments requiring multi-cross functional team management. Serves as the contractor counterpart to the Government program/technical manager for the program. Manages substantial program/technical support operations involving multiple projects/task orders and personnel at diverse locations. Organizes, directs, and coordinates planning and execution of all program/technical support activities.Manages large teams in cross project integration support, quality assurance services, implementation, and deployment. Simultaneously plans and manages the transition of several highly technical projects including database migration (Oracle, PostgreSQL, MSSQL) and application replatforming (Angular, Angular JS, ReactJS, .NET, JAVA and comparable technologies). Establishes and alters (as required) management structure to effectively direct program/technical support activities. Meets and confers with Government management officials regarding the status of specific contractor program/technical activities and problems, issues, or conflicts regarding resolution. Leads and/or participates in phase, milestone, and final project reviews of mission critical projects. Accountable for ensuring that everyone on the team knows and executes his or her role, feels empowered and supported in the role, knows the roles of the other team members and acts upon the belief that those roles will be performed. Ensures that new programs and projects are consistent with the technology roadmap and strategic goals and objectives of the organization.  Minimum Education: Master’s degree in Computer Science, Computer Engineering, Software Engineering, Systems Engineering, Management Information System, or similar field. With fifteen years of experience of which at least fourteen years must be specialized, only a Bachelor’s degree is required, however Project Management Professional (PMP) certification from the Project Management Institute (PMI) is mandatory.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "180.51",
        "gsa_price_with_iff__d_": "180.51",
        "gsa_price_with_iff__e_": "187.74",
        "minimum_education": "Masters",
        "minimum_years_of_education": "12.0",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "Yes",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Management,Life Cycle,System Development,PMP,Agile",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Masters",
      "security_clearance": "Yes",
      "contractor_id": 1316,
      "price_list_id": 1275
    },
    {
      "contract_number": "47QTCA22D006A",
      "labor_category": "Project Specialist",
      "hourly_rate": 64.07,
      "source_sheet_name": "Price List",
      "source_row_number": 4,
      "raw_data": {
        "vendor_name": "ALL HANDS ON TECH LLC",
        "unique_catalog_item_id": "102.0",
        "title": "Project Specialist",
        "description": "Minimum/General Experience: Minimum of 6 years of work experience of which 4 years of specialized experience in all aspects of software development and management support of software development contracts. Requires competence in all phases of systems development life cycle and project management concepts and methods. This includes requirements analysis, project planning, technology assessment and post implementation review. Functional Responsibility: Responsible for developing work statements, scope/priority definitions, and creating budgets and schedules for complex IT projects. Assist the Project Manager and Program Managers in the requirements development and management efforts to establish a common understanding between the customer and the software/business process project team, which shall be addressed by the development team. Exercises analytical techniques when gathering information from users, defining work problems, and developing procedures to resolve the problems. Develop screen mockups, wireframes and user journey maps that accurately reflect user requirements. Provides support for structured analysis techniques. Participates in cross project integration support and quality assurance services. Provides day to day management and oversight of team members and scope of project. Research and evaluate new technology that could be exploited to better meet user requirements, support organizational goals and objectives. Perform feasibility studies and recommend alternatives that advance the goals and objectives of the IT CIO organization and IT Governance processes as required. Conduct Post-Implementation Reviews after major releases of systems to include surveying and interviewing users and management on the latest release. Minimum Education: A Bachelor's degree in Computer Science, Information Systems, Engineering, Business, or other related scientific or technical discipline with a minimum of 6 years of work experience of which 4 years of specialized experience. A Master of Sciences degree in the fields described in the above paragraph will be considered equivalent to one year specialized experience and two years general experience.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "64.07",
        "gsa_price_with_iff__d_": "64.07",
        "gsa_price_with_iff__e_": "66.63",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "6.0",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "Yes",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Management,Life Cycle,SystemDevelopment,PMP,Agile",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "Yes",
      "contractor_id": 1316,
      "price_list_id": 1275
    },
    {
      "contract_number": "47QTCA22D006A",
      "labor_category": "Business Process Engineer",
      "hourly_rate": 131.95,
      "source_sheet_name": "Price List",
      "source_row_number": 5,
      "raw_data": {
        "vendor_name": "ALL HANDS ON TECH LLC",
        "unique_catalog_item_id": "103.0",
        "title": "Business Process Engineer",
        "description": "Minimum/General Experience: Minimum of 8 years of specialized experience which applies to solid understanding of business process, organizational change management, analytical and structured analysis techniques, business process documentation, and systems development life cycle. Understands both open source and proprietary database and front end softwares to include Oracle, PostgreSQL, MSSQL, Angular, JAVA, React and comparable technologies. Functional Responsibility: Applies process improvement and reengineering methodologies and principles to conduct process modernization projects. Provides support for structured analysis techniques. Duties include activity and data modeling. Performs data mapping from source to target data source while performing data migration as part of the application re-platforming effort. Responsible for effective transitioning of existing project teams and the accomplishment of project activities and objectives. Provides interviewing, training, and additional forms of knowledge transfer. Coordinates between multiple project teams to ensure enterprise-wide integration of reengineering efforts.  Minimum Education: Must have a Bachelor's degree in Systems Engineering, Management Information Systems (MIS), Electrical Engineering, Information Science, Computer Science, Physics, Math, or other related disciplines. Business Process Modeling Notation (BPMN) certifications are preferred but not mandatory.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "131.95",
        "gsa_price_with_iff__d_": "131.95",
        "gsa_price_with_iff__e_": "137.23",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "Yes",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Business Process,Project Teams,PMP,Agile,Requirements",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "Yes",
      "contractor_id": 1316,
      "price_list_id": 1275
    },
    {
      "contract_number": "47QTCA22D006A",
      "labor_category": "Documentation Specialist",
      "hourly_rate": 112.83,
      "source_sheet_name": "Price List",
      "source_row_number": 6,
      "raw_data": {
        "vendor_name": "ALL HANDS ON TECH LLC",
        "unique_catalog_item_id": "104.0",
        "title": "Documentation Specialist",
        "description": "Minimum/General Experience: Minimum of 5 years of specialized experience which includes training and applies to good documentation organization and content capture related to IT applications and training needs. Functional Responsibility: Provides documentation on systems related to user training manuals, application documentation, helpdesk guides, operational manuals, installation instructions, help text, and other documentation required for the application. Ensures that the documentation matches the system specifications and is user-friendly for the general audience. Minimum Education: E3 level of education and experience. See section titled Grade Levels for Minimum Education and Work Experience Requirements for details on adjusting educational levels based on work experience.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "112.83",
        "gsa_price_with_iff__d_": "112.83",
        "gsa_price_with_iff__e_": "117.34",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "Yes",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Training,Documentation,Manuals,Applcation Technical Writing,Funcationl Writing",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "Yes",
      "contractor_id": 1316,
      "price_list_id": 1275
    },
    {
      "contract_number": "47QTCA22D006A",
      "labor_category": "Senior Manager / Principle",
      "hourly_rate": 187.4,
      "source_sheet_name": "Price List",
      "source_row_number": 7,
      "raw_data": {
        "vendor_name": "ALL HANDS ON TECH LLC",
        "unique_catalog_item_id": "105.0",
        "title": "Senior Manager / Principle",
        "description": "Minimum/General Experience: Minimum of 10 years of specialized experience which applies to systems development life cycle project planning, management, and control. Requires competence in all phases of building assessment management. Functional Responsibility: Responsible for plans, direction, management, and oversight of assigned repairs and alterations projects to ensure that milestones and objectives are accomplished within prescribed schedule and budget parameters. Effectively communicates with client, field staff, technical staff, contractors and management. Provides internal and external coordination and collaboration with project partners and stakeholders. Minimum Education: E11 level of education and experience. See section titled Grade Levels for Minimum Education and Work Experience Requirements for details on adjusting educational levels based on work experience.",
        "sin": "541330ENG",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "187.4",
        "gsa_price_with_iff__d_": "187.4",
        "gsa_price_with_iff__e_": "194.89",
        "minimum_education": "Masters",
        "minimum_years_of_education": "10.0",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "Yes",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Plans,Direction,Management,Project",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Masters",
      "security_clearance": "Yes",
      "contractor_id": 1316,
      "price_list_id": 1275
    },
    {
      "contract_number": "47QTCA22D006A",
      "labor_category": "Consultant",
      "hourly_rate": 159.92,
      "source_sheet_name": "Price List",
      "source_row_number": 8,
      "raw_data": {
        "vendor_name": "ALL HANDS ON TECH LLC",
        "unique_catalog_item_id": "106.0",
        "title": "Consultant",
        "description": "Minimum/General Experience: Minimum of 10 years of specialized experience which applies to technical expertise in providing property condition assessment and inspection of existing commercial properties. Functional Responsibility: Responsible for property condition assessments, evaluating the condition of building components/ systems, forensic assessment of building systems and distressed conditions for various commercial projects, and required to make recommendations for maintenance and remaining useful life for building systems. Expert in report writing clear and concise condition and status reports. Provide Cost estimation associated with the replacement of building components/ systems. Minimum Education: E10 level of education and experience. See section titled Grade Levels for Minimum Education and Work Experience Requirements for details on adjusting educational levels based on work experience.",
        "sin": "541330ENG",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "159.92",
        "gsa_price_with_iff__d_": "159.92",
        "gsa_price_with_iff__e_": "166.32",
        "minimum_education": "Masters",
        "minimum_years_of_education": "10.0",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "Yes",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Technical Expertise,Report Writing",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Masters",
      "security_clearance": "Yes",
      "contractor_id": 1316,
      "price_list_id": 1275
    }
  ],
  "parsed_at": "2025-11-06T11:51:39.552010"
}