{
  "contract_number": "47QTCA21D006E",
  "contractor_id": 7039,
  "price_list_id": 1054,
  "labor_categories": [
    {
      "contract_number": "47QTCA21D006E",
      "labor_category": "Legacy Analyst / Technical Subject Matter Specialist",
      "hourly_rate": 53.75,
      "source_sheet_name": "Price List",
      "source_row_number": 3,
      "raw_data": {
        "vendor_name": "J-3 PROFESSIONAL SERVICES, LLC",
        "unique_catalog_item_id": "1.0",
        "title": "Legacy Analyst / Technical Subject Matter Specialist",
        "description": "Works as an Analyst and Subject Matter Specialist performing Help Desk support f or Maintenance Product Directorate. Answers, researches, evaluates, and troubleshoots all requests for assistance from users experiencing problems with hardware, software, and other computer-related technologies. Logs and tracks all calls using Enterprise Management Information System and maintains history records and related documentation. Trains other employees on hardware, software, and other computer related technologies. Researches, evaluates, and finds solutions for all material problems and errors. Prepares reports and consults with programmers to explain software errors or to recommend changes. Familiar with USAF software systems.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "53.75",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "2.0",
        "required_certifications_or_licenses": "Security+ Certification",
        "security_clearance_required": "Yes",
        "minimum_security_clearance_level": "T3",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Analyst,Specialist,SME,Technical,IT",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "Yes",
      "contractor_id": 7039,
      "price_list_id": 1054
    },
    {
      "contract_number": "47QTCA21D006E",
      "labor_category": "Legacy Applications Systems Analyst",
      "hourly_rate": 55.9,
      "source_sheet_name": "Price List",
      "source_row_number": 4,
      "raw_data": {
        "vendor_name": "J-3 PROFESSIONAL SERVICES, LLC",
        "unique_catalog_item_id": "2.0",
        "title": "Legacy Applications Systems Analyst",
        "description": "Technical Lead applications systems Analyst and Cognos Subject Matter Expert for production and development environments. Plans and implements Cognos upgrades and security patches including the major upgrade from Cognos BI v8.4 to Cognos BI v 10.2.1. Performs in-depth maintenance on the Cognos Content Stores, identifying and eliminating obsolete reports and reducing the overall size. Audits and administers large user accounts. Supervises the upgrade conversion of reports, cubes, and dashboards. Serves as Cognos BI Developer and manages the design, development, deployment and operational maintenance of driven reports, dashboards and cubes using the Cognos BI suite of components. Serves as Metadata Model Developer utilizing IBM Cognos Framework Manager. Proficient in the design of multi-level performance enhanced data modeling packages for predictable reporting and analysis. Serves as an Oracle Database Analyst. Monitors, recovers, and validates daily ETL processes ensuring the successful data loads for 410 tables and views to ensure accurate daily report processing is executed. SQL codes and tests every new database table, view, procedure, and script on the data warehouse databases utilizing the database utilities Golden, TOAD and SQL Developer.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "55.9",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "required_certifications_or_licenses": "Security+ Certification",
        "security_clearance_required": "Yes",
        "minimum_security_clearance_level": "T3",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Analyst,Applications,IT,IS",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "Yes",
      "contractor_id": 7039,
      "price_list_id": 1054
    },
    {
      "contract_number": "47QTCA21D006E",
      "labor_category": "Legacy Systems Analyst",
      "hourly_rate": 57.09,
      "source_sheet_name": "Price List",
      "source_row_number": 5,
      "raw_data": {
        "vendor_name": "J-3 PROFESSIONAL SERVICES, LLC",
        "unique_catalog_item_id": "3.0",
        "title": "Legacy Systems Analyst",
        "description": "Supports the enhancement and upgrade of legacy applications by analyzing and developing change requirements; planning, coding, modifying, and implementing new software components and changes to applications; utilizing application configuration control systems; creating and updating application documentation; and testing and integrating application changes; and troubleshooting and following through with corrective actions. Also implements Cognos upgrades and security patches including the major upgrade from Cognos BI v8.4 to Cognos BI v 10.2.1. Performed in -depth maintenance on the Cognos Content Stores, identifying and eliminating obsolete reports, reducing the size. Manages the design, development, deployment, and operational maintenance of results driven reports, dashboards and cubes using the Cognos BI suite of components. Services as Metadata Model Developer utilizing IBM Cognos Framework Manager. Proficient in the design of multi-level performance enhanced data modeling packages for predictable reporting and analysis. Services as Oracle Database Analyst and monitors, recovers, and validates daily processes ensuring the successful data loads are accurate before daily report processing was executed. SQL codes and tests every new database table, view, procedure, and script on the data warehouse databases utilizing the database utilities Golden, TOAD and SQL Developer.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "57.09",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "required_certifications_or_licenses": "Security+ Certification",
        "security_clearance_required": "Yes",
        "minimum_security_clearance_level": "T3",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Analyst,IT,IS",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "Yes",
      "contractor_id": 7039,
      "price_list_id": 1054
    },
    {
      "contract_number": "47QTCA21D006E",
      "labor_category": "Motor Vehicle Operator",
      "hourly_rate": 34.25,
      "source_sheet_name": "Price List",
      "source_row_number": 6,
      "raw_data": {
        "vendor_name": "J-3 PROFESSIONAL SERVICES, LLC",
        "unique_catalog_item_id": "4.0",
        "title": "Motor Vehicle Operator",
        "description": "Provide vehicle operators to drive a bus or shuttle to safely transport WSM, designated non-medical attendants, and family members for scheduled medical appointments, rehabilitation programs, and in/out processing to and from all locations on JBSA necessary for rehabilitation, administrative and subsistence needs. Drivers must have a commercial drivers’ license with a Passenger endorsement.",
        "sin": "485",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "34.25",
        "minimum_education": "High_School_Equivalent",
        "minimum_years_of_education": "5.0",
        "security_clearance_required": "No",
        "catalog_item_type": "SCLS",
        "key_words": "Driver,Vehicle,Operator",
        "domestic__overseas_or_domestic_and_overseas": "Domestic",
        "dol_occupation_code": "31290",
        "dol_occupation_title": "Shuttle Bus Driver",
        "dol_wage_determination": "2015-4471"
      },
      "education_level": "High_School_Equivalent",
      "security_clearance": "No",
      "contractor_id": 7039,
      "price_list_id": 1054
    },
    {
      "contract_number": "47QTCA21D006E",
      "labor_category": "Shuttle Driver",
      "hourly_rate": 34.25,
      "source_sheet_name": "Price List",
      "source_row_number": 7,
      "raw_data": {
        "vendor_name": "J-3 PROFESSIONAL SERVICES, LLC",
        "unique_catalog_item_id": "5.0",
        "title": "Shuttle Driver",
        "description": "Operate a variety of motor vehicles including, sedans, minivans, carry-all vans, passenger vans with wheelchair harnesses, and shuttle buses. Transportation of residents; to include Ambulatory, Non-Ambulatory, and residents with disabilities; to and from scheduled medical appointments at designated sites. Assisting residents (Ambulatory, Non-Ambulatory, and residents with disabilities) in and out of vehicle to ensure safety of residents and care of vehicle. Safely and properly (operate and follow proper safety and equipment instructions) securing residents and if applicable, the residents’ wheelchair(s) or Personal Mobility Device(s) (PMD) in government provided vehicles. Operate vehicles that accommodate Persons with Disabilities. Must operate vehicles that have a Wheelchair Lift and requires operator to secure Wheelchairs and person Mobility Devices down with security tie down system. Accounting for all residents return to facility from medical appointments. Delivery of minor Medical Assistive Equipment (Wheelchair, PMD, small oxygen bottle etc.) and personal affects to residents that are temporarily placed in hospitals or rehab facilities in area. Delivery of government property, equipment, and medical items to facilities in support of residents in area as required. Obtain schedules from schedulers ahead of time and ensure timely transport of residents in accordance with provided schedules. Maintaining a log that captures the number of passengers assisted to and from appointments and their respective locations and provide that information to the COR. Performing all GSA-required daily vehicle maintenance requirements in a timely manner and ensure data pertaining to maintenance and utilization is documented in a maintenance log. Work according to flexible scheduling needs in support of the area assigned, as needed. Always remain punctual to ensure residents reach their destination in a timely manner. Perform preventive maintenance to government vehicles include cleaning of interior and exterior.",
        "sin": "485",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "34.25",
        "minimum_education": "High_School_Equivalent",
        "minimum_years_of_education": "5.0",
        "security_clearance_required": "No",
        "catalog_item_type": "SCLS",
        "key_words": "Shuttle,Driver,Vehicle",
        "domestic__overseas_or_domestic_and_overseas": "Domestic",
        "dol_occupation_code": "31290",
        "dol_occupation_title": "Shuttle Bus Driver",
        "dol_wage_determination": "2015-4471"
      },
      "education_level": "High_School_Equivalent",
      "security_clearance": "No",
      "contractor_id": 7039,
      "price_list_id": 1054
    },
    {
      "contract_number": "47QTCA21D006E",
      "labor_category": "Technical Subject Matter Specialist",
      "hourly_rate": 56.6841,
      "source_sheet_name": "Price List",
      "source_row_number": 8,
      "raw_data": {
        "vendor_name": "J-3 PROFESSIONAL SERVICES, LLC",
        "unique_catalog_item_id": "6.0",
        "title": "Technical Subject Matter Specialist",
        "description": "Perform contract program manager support and customer Service support. The program lead shall provide a single point of contact between company and government. Single point of contact for employee payroll reporting and other contract employee administrative functions. On the technical side, shall identify problems or potential problems affecting performance to the System PM, SCPL Management and the Contracting Officer's Representative (COR) as soon as such problems or potential problems are identified. Verbal reports shall be followed up with written reports when requested by the System PM or the COR. The contractor shall submit monthly status reports to include a status of work planned and work accomplished during the reporting period. The status report shall cover items such as status of tasks assigned, tasks completed, reason for delayed tasks; work planned for the next period, report of problems identified, and corrective actions taken; unusual problems handled; and significant meetings or lean events attended and contractor contribution. (CDRL A001, Status Report) The Contract PM shall participate in periodic meetings with SCP management and the user, with the primary focus to establish prioritized workload of approved requirements and ensure implemented requirements are satisfactory to the user community. The contractor shall participate in working groups, attend or lead meetings in preparations for delivering presentations. The contractor shall support the customer support operations of Legacy Systems by monitoring system operation, diagnosing cause of system problems, and taking corrective actions. Contractor will proactively communicate with users to identify and resolve issues. Contractor shall adapt to rapidly changing task and customer demands. The contractor shall process requests and establish accounts for users for approved and authorized user requests. This process involves the initiator submitting a DD2875 through the workflow approval routing. The contractor shall apply the correct user account roles and permissions based on the justification and ‘need to know’ on the approved DD2875. The contractor shall follow current DoD, AF and local policies and guidance governing user account management. Guidance recommends periodic audits, deletion of accounts exceeding non-usage thresholds, due diligence for account set-up and maintaining documentation of activities governing account management. The contractor shall respond to user inquiries on system status, accessing systems, and location of required data. The contractor shall lead users through diagnostic procedures to determine source of problems. There are currently approximately 8700 user accounts for DMAPS, 1200 user accounts for Cognos BI, 752 for FEM and 5000 for EMIS.",
        "sin": "541611",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "56.6841",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "SME,Specialist",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 7039,
      "price_list_id": 1054
    },
    {
      "contract_number": "47QTCA21D006E",
      "labor_category": "Program Manager",
      "hourly_rate": 57.9668,
      "source_sheet_name": "Price List",
      "source_row_number": 9,
      "raw_data": {
        "vendor_name": "J-3 PROFESSIONAL SERVICES, LLC",
        "unique_catalog_item_id": "7.0",
        "title": "Program Manager",
        "description": "Plans, analyzes, evaluates, and manages the project. Includes such duties as analyzing the objectives, policies, work operations and progress, identifying actual or potential problem areas, trends, significant project accomplishments, deficiencies, areas of imbalance, and similar factors in the project and evaluates alternatives or corrective actions in terms of effectiveness on the project and interrelated projects.",
        "sin": "541611",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "57.9668",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Program,Manager,Project",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 7039,
      "price_list_id": 1054
    },
    {
      "contract_number": "47QTCA21D006E",
      "labor_category": "Management Analyst",
      "hourly_rate": 39.2443,
      "source_sheet_name": "Price List",
      "source_row_number": 10,
      "raw_data": {
        "vendor_name": "J-3 PROFESSIONAL SERVICES, LLC",
        "unique_catalog_item_id": "8.0",
        "title": "Management Analyst",
        "description": "Knowledge and skill in applying analytical and evaluative techniques to the identification, consideration and resolution of issues or problem of a procedural nature. Knowledge of administrative regulations and operating procedures. Knowledge of established management principles, pertinent administrative regulations and organization programs, missions and functions in order to prepare a wide range of specific administrative documents. Ability to plan, coordinate and carry out successive steps in analysis, review and issues necessary to complete each phase of assigned projects. Uses judgment and discretion in determining intent, and in interpreting and revising existing materials to conform to new guidance. Responsible for providing the acquisition, management, and distribution of material, equipment, and resources necessary for the timely completion of projects. Familiar with procedures and regulations applicable to the organization and tasks performed. Ensures proper transfer, inventory, and control of GEE, GFM, and CFM. Basic knowledge of military and civilian position management in order to gather and assemble data for military, civilian and contractor workforce planning and completing associated data calls. Develop organization documentation including mission, functions and tasks statements, organization change requests and related technical support data. Develop and conduct training f or web-based applications relevant to the Command. Develop civilian personnel data and information such as developing positions descriptions, position cover sheets, security clearance information, performance plans, appraisals, awards, and training information.",
        "sin": "541611",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "39.2443",
        "minimum_education": "Associates",
        "minimum_years_of_education": "5.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Analyst,Management",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Associates",
      "security_clearance": "No",
      "contractor_id": 7039,
      "price_list_id": 1054
    },
    {
      "contract_number": "47QTCA21D006E",
      "labor_category": "Management Analyst - Junior",
      "hourly_rate": 33.1567,
      "source_sheet_name": "Price List",
      "source_row_number": 11,
      "raw_data": {
        "vendor_name": "J-3 PROFESSIONAL SERVICES, LLC",
        "unique_catalog_item_id": "9.0",
        "title": "Management Analyst - Junior",
        "description": "Knowledge and skill in applying analytical and evaluative techniques to the identification, consideration and resolution of issues or problem of a procedural nature. Knowledge of administrative regulations and operating procedures. Knowledge of established management principles, pertinent administrative regulations and organization programs, missions, and functions in order to prepare a wide range of specific administrative documents. Ability to plan, coordinate and carry out successive steps in analysis, review, and issues necessary to complete each phase of assigned projects. Uses judgment and discretion in determining intent, and in interpreting and revising existing materials to conform to new guidance.",
        "sin": "541611",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "33.1567",
        "minimum_education": "Associates",
        "minimum_years_of_education": "3.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Management,Analyst,Junior",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Associates",
      "security_clearance": "No",
      "contractor_id": 7039,
      "price_list_id": 1054
    },
    {
      "contract_number": "47QTCA21D006E",
      "labor_category": "Program Analyst",
      "hourly_rate": 54.2625,
      "source_sheet_name": "Price List",
      "source_row_number": 12,
      "raw_data": {
        "vendor_name": "J-3 PROFESSIONAL SERVICES, LLC",
        "unique_catalog_item_id": "10.0",
        "title": "Program Analyst",
        "description": "Knowledge of and skill in applying principles, concepts, and methods applicable to the organization for which tasks are being performed. Develop long-range program to ensure compliance with Safety policies as outlined in applicable safety regulations. Monitor required safety metrics to ensure compliance by the organization and its subordinate sites. Identify, evaluate, mitigate, and minimize risks associated with Safety vulnerabilities. Serves as the organizational representative at safety meetings. Knowledge of and skill in development and distribution of Standard Operating Procedures (SOPs) and Technical Repair Standards (TRSs). Applied knowledge of government standards for development of these publications. Ability to work with Subject Matter Experts to elicit all necessary information for inclusion in documentation. Skill in MS Office applications to compile documentation for publication. If IT related: Knowledge of and skill in applying IT systems security principles, concepts and methods, and the infrastructure protections environment sufficient to develop long-range plans for IT security systems that anticipate, identify, evaluate, mitigate, and minimize risks associated with IT systems vulnerabilities. Skill in analyzing a wide range of computer applications, services, techniques, requirements, methods, and procedures including familiarity with approaches used by other government agencies to support the mission of the organization. Familiarity with data systems used by the organizational management. May serves as the organizational Information Assurance Manager.",
        "sin": "541611",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "54.2625",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Program,Manager,Project",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 7039,
      "price_list_id": 1054
    }
  ],
  "parsed_at": "2025-11-06T11:47:45.082019"
}