{
  "contract_number": "47QTCA19D00BP",
  "contractor_id": 2988,
  "price_list_id": 1050,
  "labor_categories": [
    {
      "contract_number": "47QTCA19D00BP",
      "labor_category": "Associate Agile Software Engineer",
      "hourly_rate": 107.3591,
      "source_sheet_name": "Price List",
      "source_row_number": 3,
      "raw_data": {
        "vendor_name": "BLUESTONE LOGIC, LLC",
        "unique_catalog_item_id": "Bluestone Assoc Agile Software Eng",
        "title": "Associate Agile Software Engineer",
        "description": "This level possesses and applies a comprehensive knowledge across key tasks and high impact assignments. Functions as an Agile software engineering professional across multiple project assignments.  Daily job duties include: • Practitioner of Agile software development and DevOps principles, methods, and techniques used to develop, test, and deploy software • Designs, codes, tests, debugs, and documents software • Supports design and development of databases • Supports integration testing of programs within a subsystem or system-of-systems • Supports the development of Acceptance Test Plan and Procedure documents and test automation • Performs technical and subject matter research on emerging technologies to determine impacts on application executions. • Knowledgeable of government regulations, manuals, technical orders and standards as applied to the development of government systems • Modifies existing and creates special purpose software and ensures system efficiency and integrity • Tests, debugs, and refines the computer software to produce the required product • Enhances software to reduce operating time or improve efficiency • Evaluates, recommends, and implements automated test tools and strategies • Designs, implements, and conducts test and evaluation procedures to ensure system requirements are met • Develops, maintains, and upgrades automated test scripts and architectures for application products • Writes, implements, and reports status for system test cases for testing • Analyzes test cases and provides regular progress reports",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "107.3591",
        "gsa_price_with_iff__b_": "107.3591",
        "gsa_price_with_iff__c_": "110.902",
        "gsa_price_with_iff__d_": "114.5618",
        "gsa_price_with_iff__e_": "118.3423",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "0.0",
        "education_and_experience_substitution": "High School - 5",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "engineer,software,application,agile",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "High School - 5",
      "security_clearance": "No",
      "contractor_id": 2988,
      "price_list_id": 1050
    },
    {
      "contract_number": "47QTCA19D00BP",
      "labor_category": "Associate Operations Engineer",
      "hourly_rate": 84.5759,
      "source_sheet_name": "Price List",
      "source_row_number": 4,
      "raw_data": {
        "vendor_name": "BLUESTONE LOGIC, LLC",
        "unique_catalog_item_id": "Bluestone Assoc Operations Eng",
        "title": "Associate Operations Engineer",
        "description": "This level possesses and applies a comprehensive knowledge across key tasks and high impact assignments. Functions as a system operations expert across multiple project assignments. Daily job duties include: • Implements computer systems in a phased approach of requirements analysis and conceptual design, site survey, system design review, critical design review, installation, integration, and testing • Performs requirements analysis for a wide range of users in areas of office automation and finance and accounting • Presents system designs for user approval at formal reviews • Conducts configuration management, integrating software, interpreting software test results, and recommending solutions for unsatisfactory test results • Directs life-cycle support, including maintenance, administration, and management • Provides solutions to identified software problem reports • Serves as a central point of contact to resolve end user problems and to increase end user efficiency • Receives and responds to end user \"help\" requests and/or trouble reports • Troubleshoots and provides customer support for system engineering and software issues • Analyzes whether user problems result from hardware failure/problem, network failure/problem, software failure/problem or is procedural in nature • Provides solutions to identified software problem reports • Reports hardware/network/software problems to the appropriate organization for resolution • Works through procedural problems with the user to successful resolution • May serve as a system documentation librarian • Installation and field engineering in multiple capacities; to include, but not limited to: o System development, o Testing,  o Deployment o Site surveys and impact documents o Implementation, o System transition. • Reviews, analyzes, and modifies programming systems including coding, testing, debugging and installation to support application systems",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "84.5759",
        "gsa_price_with_iff__b_": "84.5759",
        "gsa_price_with_iff__c_": "87.3669",
        "gsa_price_with_iff__d_": "90.25",
        "gsa_price_with_iff__e_": "93.2283",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "0.0",
        "education_and_experience_substitution": "High School - 5",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "operations,systems,analyze,engineer",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "High School - 5",
      "security_clearance": "No",
      "contractor_id": 2988,
      "price_list_id": 1050
    },
    {
      "contract_number": "47QTCA19D00BP",
      "labor_category": "Configuration Management/Service Management Analyst",
      "hourly_rate": 127.9255,
      "source_sheet_name": "Price List",
      "source_row_number": 5,
      "raw_data": {
        "vendor_name": "BLUESTONE LOGIC, LLC",
        "unique_catalog_item_id": "Bluestone CM/SM Analyst",
        "title": "Configuration Management/Service Management Analyst",
        "description": "This level possesses and applies expertise on multiple complex work assignments. Assignments may be broad in nature, requiring originality and innovation in determining how to accomplish tasks. Operates with appreciable latitude in developing methodology and presenting solutions to problems.  Daily job duties include: • Responsible for configuration management activities, including product identification, change control, status accounting, operation of the program support library, and development and monitoring of equipment/system acceptance plans • Coordinates, prepares, and conducts Configuration Control Boards, identify, monitor, and report on configuration • Collaborates with Agile development teams to track software Configuration Items through source code version control, software build, integration, test and deployment using automated DevOps pipelines • Controls configuration baselines and interfaces through Engineering Change Request processing • Responsible for configuration management of requirements, design, and code • Fulfills contract data requirements as preparing drafts, forwarding correspondence, preparing and processing CM required data items; and compiles, prepares, and maintains the master records for the establishment and change of configuration baselines, engineering release system, configuration item development record (including the configuration index and change status listing), and configuration status accounting • Provides solutions supporting parallel development and facilitate product branching and merging activities • Conducts configuration audits • Implements configuration and change management solutions and provides support to the system engineering, security engineering, and Agile development teams • Manages Configuration Management Database (CMDB) to ensure consistency and all data is up-to-date; develop processes for maintaining and auditing CMDB • Provides technical support for the government chairs of Change Advisory Boards (CABs), Configuration Control Boards (CCBs) and/or Engineering Review Boards (ERBs) to review and ensure changes are discussed and maintained appropriately and are aligned with CM best practices • Manage and enforce process and policy for CAB, CCB, and ERB meetings",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "127.9255",
        "gsa_price_with_iff__b_": "127.9255",
        "gsa_price_with_iff__c_": "132.147",
        "gsa_price_with_iff__d_": "136.5079",
        "gsa_price_with_iff__e_": "141.0126",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "Masters - 0, High School - 6",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "configure,manage,track,change",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Masters - 0, High School - 6",
      "security_clearance": "No",
      "contractor_id": 2988,
      "price_list_id": 1050
    },
    {
      "contract_number": "47QTCA19D00BP",
      "labor_category": "Enterprise Communications/Network Manager",
      "hourly_rate": 200.938,
      "source_sheet_name": "Price List",
      "source_row_number": 6,
      "raw_data": {
        "vendor_name": "BLUESTONE LOGIC, LLC",
        "unique_catalog_item_id": "Bluestone Ent Comm/Network Manager",
        "title": "Enterprise Communications/Network Manager",
        "description": "This level possesses and applies a comprehensive knowledge across key tasks and high impact assignments. Plans and leads major communications assignments. Functions as a communication expert across multiple project assignments. Supervises and mentors others.  Daily job duties include:  • Provides technical direction for enterprise communications/network activities, including planning, designing, modeling, and implementation. • Primarily responsible for the assessment and optimization of enterprise communications/network design through review and assessment of user needs. • Conducts feasibility studies for large projects, develops requests for proposal, evaluates vendor products, and makes recommendations on selection. • May function as lead position, providing guidance and training to less experienced analysts. • Applies engineering principles and theory to propose design and configuration alternatives. • Evaluates existing communications systems to identify deficiencies and network performance improvements. • Consults with user personnel to ensure that problems have been properly identified and that the solution will meet the requirements. • Analyzes network performance, usage and traffic flows, accesses and interfaces, transmission techniques, and protocols. • Performs network analyses and feasibility studies concerning communications and communication networks. • Prepares studies and gives presentations on communications concepts. • Provides technical guidance to other personnel concerning data communications requirements.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "200.938",
        "gsa_price_with_iff__b_": "200.938",
        "gsa_price_with_iff__c_": "207.569",
        "gsa_price_with_iff__d_": "214.4187",
        "gsa_price_with_iff__e_": "221.4946",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "education_and_experience_substitution": "Masters - 6, High School - 12",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "network,communications,manage,analyze",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Masters - 6, High School - 12",
      "security_clearance": "No",
      "contractor_id": 2988,
      "price_list_id": 1050
    },
    {
      "contract_number": "47QTCA19D00BP",
      "labor_category": "Principal Cybersecurity Engineer",
      "hourly_rate": 280.466,
      "source_sheet_name": "Price List",
      "source_row_number": 7,
      "raw_data": {
        "vendor_name": "BLUESTONE LOGIC, LLC",
        "unique_catalog_item_id": "Bluestone Principal Cybersecurity Eng",
        "title": "Principal Cybersecurity Engineer",
        "description": "This level possesses and applies a comprehensive knowledge across key tasks and high impact assignments. Plans and leads major assignments. Evaluates performance results and recommends major changes affecting short-term project growth and success. Functions as a programmatic expert across multiple project assignments. Supervises and mentors others.  Daily job duties include: • Analyzes and defines security requirements for information systems • Design, develops, engineers, and integrates solutions for security requirements • Conducts security audits • Generates system-level security documentation • Supports the development of System Operation Procedure documents • Applies knowledge of IT Governance requirements, risk mitigation strategies, and encryption and decryption capabilities to establish secure solutions • Performs risk analysis, including risk assessment processes and procedures • Recommends information assurance/security solutions to support customers’ requirements • Performs analysis, design, and development of security features for system architectures • Designs, develops, engineers, and implements solutions that meet security requirements • Provides integration and implementation of the computer system security solution • Analyzes general information assurance-related technical problems and provides basic engineering and technical support in solving these problems • Performs vulnerability/risk analyses of computer systems and applications during all phases of the system development life cycle • Leads Risk Management Framework (RMF) process for information system programs • Certified cybersecurity professional",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "280.466",
        "gsa_price_with_iff__b_": "280.466",
        "gsa_price_with_iff__c_": "289.7214",
        "gsa_price_with_iff__d_": "299.2822",
        "gsa_price_with_iff__e_": "309.1585",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "12.0",
        "education_and_experience_substitution": "Masters - 10, High School - 15",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "cyber,techology,security,risk,audit",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Masters - 10, High School - 15",
      "security_clearance": "No",
      "contractor_id": 2988,
      "price_list_id": 1050
    },
    {
      "contract_number": "47QTCA19D00BP",
      "labor_category": "Principal Systems Engineer/Integrator",
      "hourly_rate": 288.3969,
      "source_sheet_name": "Price List",
      "source_row_number": 8,
      "raw_data": {
        "vendor_name": "BLUESTONE LOGIC, LLC",
        "unique_catalog_item_id": "Bluestone Principal Sys Eng/Integrator",
        "title": "Principal Systems Engineer/Integrator",
        "description": "This level possesses and applies a comprehensive knowledge across key tasks and high impact assignments. Plans and leads major technology assignments. Evaluates performance results and recommends major changes affecting short-term project growth and success. Functions as a technical expert across multiple project assignments. Supervises and mentors others.  Daily job duties include: • Expertise includes supervision of system architects, use of structured analysis, design methodologies and design tools, and other design techniques, object-oriented principles, COTS integration, cloud deployments, or experience with the logical and technical architecture of large and complex information systems • Expert in architecture patterns used to meet system quality attributes • Expert in Agile, DevOps, and cybersecurity engineering processes and practices • Ensures these systems are compatible and in compliance with the standards for open systems architectures, the Open Systems Interconnection (OSI) and International Standards Organization (ISO) reference models, and profiles of standards—such as the Institute of Electrical and Electronic Engineers (IEEE) Open Systems Environment (OSE) reference model—as they apply to the implementation and specification of information management (IM) solution of the application platform across the application program interface (API) and the external environment/ software application • Specialized experience includes configuration management, requirements management, architecture design, verification and validation, system testing and integration, and metrics and their application to systems quality assessment • Develops documentation to describe system requirements and use, including system quality attributes • Analyzes and studies complex system requirements • Designs architecture to include the software, hardware, and communications to support the total requirements, as well as provide for present and future cross functional requirements and interfaces • Designs enterprise systems, systems of systems, subsystems, and software tool to support software reuse and domain analyses and manages their implementation • Estimates software development costs and schedule • Manages software development and support using formal specifications, data flow diagrams, other accepted design techniques, and tools • Reviews existing programs and assists in making refinements, reducing operating time, and improving current techniques • Oversees software configuration management • Develops and conducts tests to ensure systems meet documented user requirements and quality attributes. • Leads in the evaluation of software and associated documentation • Leads formal and informal reviews to determine quality • Leads development of project Software Quality Assurance Plan and the implementation of procedures that conforms to the requirements of the contract",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "288.3969",
        "gsa_price_with_iff__b_": "288.3969",
        "gsa_price_with_iff__c_": "297.914",
        "gsa_price_with_iff__d_": "307.7452",
        "gsa_price_with_iff__e_": "317.9008",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "12.0",
        "education_and_experience_substitution": "Masters - 10",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "engineer,systems,integrate,design",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Masters - 10",
      "security_clearance": "No",
      "contractor_id": 2988,
      "price_list_id": 1050
    },
    {
      "contract_number": "47QTCA19D00BP",
      "labor_category": "Principal Systems Solutions Engineer",
      "hourly_rate": 186.6582,
      "source_sheet_name": "Price List",
      "source_row_number": 9,
      "raw_data": {
        "vendor_name": "BLUESTONE LOGIC, LLC",
        "unique_catalog_item_id": "Bluestone Principal Sys Solutions Eng",
        "title": "Principal Systems Solutions Engineer",
        "description": "This level possesses and applies a comprehensive knowledge across key tasks and high impact assignments. Plans and leads major technology assignments. Evaluates performance results and recommends major changes affecting short-term project growth and success. Functions as a technical expert across multiple project assignments. Supervises and mentors others.  Daily job duties include: • Specialized experience includes supervision of system architects, use of structured analysis, design methodologies and design tools, and other design techniques, object-oriented principles, COTS integration, cloud deployments, or experience with the logical and technical architecture of large and complex information systems. • Establishes system information in the development of enterprise-wide or large-scale information systems. • Designs architecture to include the software, hardware, and communications to support the total requirements, as well as provide for present and future cross functional requirements and interfaces. • Formulates/defines system scope and objectives. • Devises or modifies procedures to solve complex problems considering computer equipment capacity and limitations, operating time, and form of desired results • Prepares detailed specifications from which programs will be written and designs, codes, tests, debugs, and documents those programs. • Prepares Interface Control Documents (ICDs), documenting the interfaces between programs • Manages cloud requirements analysis, conceptual design, detailed design, and implementation of a cloud project • Has strong understanding of cloud information flows and process architecture necessary for implementation of cloud security • Participates in the implementation of a cloud effort • Expert in developing and/or applying Models and Simulations in support of training, experimentation, acquisition, and analysis of IT systems. • Expert using software tools and database technology to develop information and data for modeling and simulation of engineering, technical, and program attributes such as cost and design trade-offs to determine methods for optimizing",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "186.6582",
        "gsa_price_with_iff__b_": "186.6582",
        "gsa_price_with_iff__c_": "192.8179",
        "gsa_price_with_iff__d_": "199.1809",
        "gsa_price_with_iff__e_": "205.7538",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "12.0",
        "education_and_experience_substitution": "Masters - 10, High School - 15",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "engineer,systems,solution,architect,infrastructure",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Masters - 10, High School - 15",
      "security_clearance": "No",
      "contractor_id": 2988,
      "price_list_id": 1050
    },
    {
      "contract_number": "47QTCA19D00BP",
      "labor_category": "Program Manager",
      "hourly_rate": 139.9884,
      "source_sheet_name": "Price List",
      "source_row_number": 10,
      "raw_data": {
        "vendor_name": "BLUESTONE LOGIC, LLC",
        "unique_catalog_item_id": "Bluestone Program Manager",
        "title": "Program Manager",
        "description": "This level applies fundamental concepts, processes, practices, and procedures on small projects and assignments. Performs work that requires practical experience and training.  Daily job duties include: • Performs day-to-day management of overall project/contract support operations • Organizes, directs, and coordinates the planning and production of all activities associated with assigned project • Assumes responsibility for project results • Works with project sponsor and stakeholders to complete project charter outlining scope, goals, deliverables, required resources, budget, and timing • Completes work breakdown structure to estimate effort required for each task • Provides a project schedule to identify when each task will be completed • Mediates between stakeholders and team members • Analyzes new and complex project related problems and creates innovative solutions involving finance, scheduling, technology, methodology, tools, and solution components • Resolves issues and solves problems throughout project life-cycle • Manages project scope by ensuring changes to scope are documented and approved • Tracks and reports on project milestones and provides status reports when requested • Makes decisions and recommendations based on the business need for each project, and makes on-going decisions based on what’s best for the organization",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "139.9884",
        "gsa_price_with_iff__b_": "139.9884",
        "gsa_price_with_iff__c_": "144.608",
        "gsa_price_with_iff__d_": "149.3801",
        "gsa_price_with_iff__e_": "154.3096",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "Masters - 0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "manage,program,project,schedule,analyze",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Masters - 0",
      "security_clearance": "No",
      "contractor_id": 2988,
      "price_list_id": 1050
    },
    {
      "contract_number": "47QTCA19D00BP",
      "labor_category": "Senior Agile Software Engineer",
      "hourly_rate": 241.925,
      "source_sheet_name": "Price List",
      "source_row_number": 11,
      "raw_data": {
        "vendor_name": "BLUESTONE LOGIC, LLC",
        "unique_catalog_item_id": "Bluestone Senior Agile Software Eng",
        "title": "Senior Agile Software Engineer",
        "description": "This level possesses and applies expertise on multiple complex work assignments. Assignments may be broad in nature, requiring originality and innovation in determining how to accomplish tasks. Operates with appreciable latitude in developing methodology and presenting solutions to problems. May supervise and mentor others.  Daily job duties include: • Expert in Agile software development and DevOps principles, methods, and techniques used to develop, test, and deploy software • Designs, codes, tests, debugs, and documents software • Leads design and development of databases • Leads integration testing of programs within a subsystem or system-of-systems • Leads the development of Acceptance Test Plan and Procedure documents and test automation • Leads technical and subject matter research on emerging technologies to determine impacts on application executions. • Knowledgeable of government regulations, manuals, technical orders and standards as applied to the development of government systems • Modifies existing and creates special purpose software and ensures system efficiency and integrity • Tests, debugs, and refines the computer software to produce the required product • Enhances software to reduce operating time or improve efficiency • Evaluates, recommends, and implements automated test tools and strategies • Designs, implements, and conducts test and evaluation procedures to ensure system requirements are met • Develops, maintains, and upgrades automated test scripts and architectures for application products • Writes, implements, and reports status for system test cases for testing • Analyzes test cases and provides regular progress reports",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "241.925",
        "gsa_price_with_iff__b_": "241.925",
        "gsa_price_with_iff__c_": "249.9085",
        "gsa_price_with_iff__d_": "258.1555",
        "gsa_price_with_iff__e_": "266.6746",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "Masters - 3, High School - 10",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "engineer,software,application,agile",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Masters - 3, High School - 10",
      "security_clearance": "No",
      "contractor_id": 2988,
      "price_list_id": 1050
    },
    {
      "contract_number": "47QTCA19D00BP",
      "labor_category": "Subject Matter Expert - Command and Control Data Management",
      "hourly_rate": 174.9803,
      "source_sheet_name": "Price List",
      "source_row_number": 12,
      "raw_data": {
        "vendor_name": "BLUESTONE LOGIC, LLC",
        "unique_catalog_item_id": "Bluestone SME Command/Control Data Mgmt",
        "title": "Subject Matter Expert - Command and Control Data Management",
        "description": "This level possesses and applies expertise on multiple complex work assignments. Assignments may be broad in nature, requiring originality and innovation in determining how to accomplish tasks. Operates with appreciable latitude in developing methodology and presenting solutions to problems. May supervise and mentor others.  Daily job duties include: • Specialized in information systems development, functional and data requirements analysis, systems analysis and design, programming, program design, and documentation preparation • Applies business process improvement practices to reengineer methodologies/principles and business process modernization projects • Applies, as appropriate, activity and data modeling, transaction flow analysis, internal control and risk analysis, modern business methods, and performance measurement techniques • Assists in establishing standards for information systems procedures • Develops and applies organization-wide information models for use in designing and building integrated, shared software and database management systems.  • Constructs sound, logical business improvement opportunities consistent with open system architecture objectives • Applies an enterprise-wide set of disciplines for the planning, analysis, design, and construction of information systems on an enterprise-wide basis or across a major sector of the enterprise • Develops analytical and computational techniques and methodology for problem solutions • Performs enterprise wide strategic systems planning, business information planning, business, and analysis • Performs process and data modeling in support of the planning and analysis efforts using both manual and automated tools • Applies reverse engineering and reengineering disciplines to develop migration strategic and planning documents • Applies expert subject matter knowledge to high level analysis, collection, assessment, design, development, modeling, simulation, integration, installation, documentation, and implementation • Resolves problems, which require an expert intimate knowledge of the related subject matter • Applies principles and methods of the subject matter to specialized solutions",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "174.9803",
        "gsa_price_with_iff__b_": "174.9803",
        "gsa_price_with_iff__c_": "180.7547",
        "gsa_price_with_iff__d_": "186.7196",
        "gsa_price_with_iff__e_": "192.8813",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "education_and_experience_substitution": "Masters - 6, High School - 15",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "expert,complex,specialized,plan,analyze",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Masters - 6, High School - 15",
      "security_clearance": "No",
      "contractor_id": 2988,
      "price_list_id": 1050
    },
    {
      "contract_number": "47QTCA19D00BP",
      "labor_category": "Senior Cybersecurity Engineer",
      "hourly_rate": 204.4559,
      "source_sheet_name": "Price List",
      "source_row_number": 13,
      "raw_data": {
        "vendor_name": "BLUESTONE LOGIC, LLC",
        "unique_catalog_item_id": "Bluestone Sr Cybersecurity Eng",
        "title": "Senior Cybersecurity Engineer",
        "description": "This level possesses and applies a comprehensive knowledge across key tasks and high impact assignments. Plans and leads major assignments. Evaluates performance results and recommends major changes affecting short-term project growth and success. Functions as a programmatic expert across multiple project assignments. May supervise and mentor others.  Daily job duties include: • Analyzes and defines security requirements for information systems • Design, develops, engineers, and integrates solutions for security requirements • Conducts security audits • Generates system-level security documentation • Supports the development of System Operation Procedure documents • Applies knowledge of IT Governance requirements, risk mitigation strategies, and encryption and decryption capabilities to establish secure solutions • Performs risk analysis, including risk assessment processes and procedures • Recommends information assurance/security solutions to support customers’ requirements • Performs analysis, design, and development of security features for system architectures • Designs, develops, engineers, and implements solutions that meet security requirements • Provides integration and implementation of the computer system security solution • Analyzes general information assurance-related technical problems and provides basic engineering and technical support in solving these problems • Performs vulnerability/risk analyses of computer systems and applications during all phases of the system development life cycle • Participates in Risk Management Framework (RMF) process for information system programs • Certified cybersecurity professional",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "204.4559",
        "gsa_price_with_iff__b_": "204.4559",
        "gsa_price_with_iff__c_": "211.203",
        "gsa_price_with_iff__d_": "218.1727",
        "gsa_price_with_iff__e_": "225.3724",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "Masters - 3, High School - 10",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "cyber,techology,security,risk,audit",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Masters - 3, High School - 10",
      "security_clearance": "No",
      "contractor_id": 2988,
      "price_list_id": 1050
    },
    {
      "contract_number": "47QTCA19D00BP",
      "labor_category": "Senior Information Technology Consultant",
      "hourly_rate": 225.5739,
      "source_sheet_name": "Price List",
      "source_row_number": 14,
      "raw_data": {
        "vendor_name": "BLUESTONE LOGIC, LLC",
        "unique_catalog_item_id": "Bluestone Sr IT Consultant",
        "title": "Senior Information Technology Consultant",
        "description": "This level possesses and applies expertise on multiple complex work assignments. Assignments may be broad in nature, requiring originality and innovation in determining how to accomplish tasks. Operates with appreciable latitude in developing methodology and presenting solutions to problems.  Daily job duties include: • Serves as subject matter expert, possessing in-depth knowledge of a particular area, such as business, mission, computer science, engineering, mathematics, or the various sciences • Provides technical knowledge and analysis of highly specialized applications and operational environments, high-level functional systems analysis, design, integration, documentation and implementation advice on exceptionally complex problems that need extensive knowledge of the subject matter for effective implementation • Participates as needed in all phases of software development with emphasis on the planning, analysis, testing, integration, documentation, and presentation phases • Applies principles, methods and knowledge of the functional area of capability to specific task order requirements, advanced mathematical principles and methods to exceptionally difficult and narrowly defined technical problems in engineering and other scientific applications to arrive at automated solutions • Provides expertise on an as-needed basis to all task assignments • Provides expert advice and assistance in state-of-the-art technology  • Coordinates with contractor management and government personnel to ensure that the problem has been properly defined and that the solution will satisfy the government’s requirement",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "225.5739",
        "gsa_price_with_iff__b_": "225.5739",
        "gsa_price_with_iff__c_": "233.0178",
        "gsa_price_with_iff__d_": "240.7074",
        "gsa_price_with_iff__e_": "248.6508",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "education_and_experience_substitution": "Masters - 6, High School - 12",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "consult,technology,analyze",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Masters - 6, High School - 12",
      "security_clearance": "No",
      "contractor_id": 2988,
      "price_list_id": 1050
    },
    {
      "contract_number": "47QTCA19D00BP",
      "labor_category": "Senior Operations Engineer",
      "hourly_rate": 138.0837,
      "source_sheet_name": "Price List",
      "source_row_number": 15,
      "raw_data": {
        "vendor_name": "BLUESTONE LOGIC, LLC",
        "unique_catalog_item_id": "Bluestone Sr Operations Eng",
        "title": "Senior Operations Engineer",
        "description": "This level possesses and applies expertise on multiple complex work assignments. Assignments may be broad in nature, requiring originality and innovation in determining how to accomplish tasks. Operates with appreciable latitude in developing methodology and presenting solutions to problems.  Daily job duties include: • Implements computer systems in a phased approach of requirements analysis and conceptual design, site survey, system design review, critical design review, installation, integration, and testing • Performs requirements analysis for a wide range of users in areas of office automation and finance and accounting • Presents system designs for user approval at formal reviews • Conducts configuration management, integrating software, interpreting software test results, and recommending solutions for unsatisfactory test results • Directs life-cycle support, including maintenance, administration, and management • Provides solutions to identified software problem reports • Serves as a central point of contact to resolve end user problems and to increase end user efficiency • Receives and responds to end user \"help\" requests and/or trouble reports • Troubleshoots and provides customer support for system engineering and software issues • Analyzes whether user problems result from hardware failure/problem, network failure/problem, software failure/problem or is procedural in nature • Provides solutions to identified software problem reports • Reports hardware/network/software problems to the appropriate organization for resolution • Works through procedural problems with the user to successful resolution • May serve as a system documentation librarian • Installation and field engineering in multiple capacities; to include, but not limited to: o System development, o Testing,  o Deployment o Site surveys and impact documents o Implementation, o System transition. • Reviews, analyzes, and modifies programming systems including coding, testing, debugging and installation to support application systems",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "138.0837",
        "gsa_price_with_iff__b_": "138.0837",
        "gsa_price_with_iff__c_": "142.6405",
        "gsa_price_with_iff__d_": "147.3476",
        "gsa_price_with_iff__e_": "152.2101",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "Masters - 3, High School - 10",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "operations,systems,analyze,engineer",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Masters - 3, High School - 10",
      "security_clearance": "No",
      "contractor_id": 2988,
      "price_list_id": 1050
    },
    {
      "contract_number": "47QTCA19D00BP",
      "labor_category": "Senior Program Manager",
      "hourly_rate": 232.2871,
      "source_sheet_name": "Price List",
      "source_row_number": 16,
      "raw_data": {
        "vendor_name": "BLUESTONE LOGIC, LLC",
        "unique_catalog_item_id": "Bluestone Sr Program Manager",
        "title": "Senior Program Manager",
        "description": "This level possesses and applies a comprehensive knowledge across key tasks and high impact assignments. Plans and leads major assignments. Evaluates performance results and recommends major changes affecting short-term project growth and success. Functions as a programmatic expert across multiple project assignments.  Daily job duties include: • Performs day-to-day management of overall project/contract support operations • Organizes, directs, and coordinates the planning and production of all activities associated with assigned project • Assumes responsibility for project results • Works with project sponsor and stakeholders to complete project charter outlining scope, goals, deliverables, required resources, budget, and timing • Completes work breakdown structure to estimate effort required for each task • Provides a project schedule to identify when each task will be completed • Mediates between stakeholders and team members • Analyzes new and complex project related problems and creates innovative solutions involving finance, scheduling, technology, methodology, tools, and solution components • Resolves issues and solves problems throughout project life-cycle • Manages project scope by ensuring changes to scope are documented and approved • Tracks and reports on project milestones and provides status reports when requested • Makes decisions and recommendations based on the business need for each project, and makes on-going decisions based on what’s best for the organization",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "232.2871",
        "gsa_price_with_iff__b_": "232.2871",
        "gsa_price_with_iff__c_": "239.9526",
        "gsa_price_with_iff__d_": "247.871",
        "gsa_price_with_iff__e_": "256.0507",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "education_and_experience_substitution": "Masters - 6, High School - 12",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "manage,program,project,schedule,analyze",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Masters - 6, High School - 12",
      "security_clearance": "No",
      "contractor_id": 2988,
      "price_list_id": 1050
    },
    {
      "contract_number": "47QTCA19D00BP",
      "labor_category": "Senior Staff Systems Solutions Engineer",
      "hourly_rate": 163.3129,
      "source_sheet_name": "Price List",
      "source_row_number": 17,
      "raw_data": {
        "vendor_name": "BLUESTONE LOGIC, LLC",
        "unique_catalog_item_id": "Bluestone Sr Staff Sys Solutions Eng",
        "title": "Senior Staff Systems Solutions Engineer",
        "description": "This level possesses and applies expertise on multiple complex work assignments. Assignments may be broad in nature, requiring originality and innovation in determining how to accomplish tasks. Operates with appreciable latitude in developing methodology and presenting solutions to problems. May supervise and mentor others.  Daily job duties include: • Continuously monitor and maintain oversight of all aspects of information technology projects. • Responsible for making determinations for project approach, software platforms, hardware, schedule, budget and deliverables. • Participates in the management and implementation of large, complex information technology systems • Identifies user requirements and describe services available or refer inquiries to other staff within installation • Provides technical support to users and assist them in defining and solving computing problems within well-defined areas of responsibility • Provides input for preparation of documentation of supported products for other staff members and users • Provides input for preparation of user training materials and assists in conducting training sessions as assigned • Performs programming tasks to assist users • Travels to the customer site to analyze and enhance the IT systems used within the organization • Performs interviews and other research • Provides technical, managerial, and administrative assistance for problem definition, analysis, requirements development and implementation, for complex to extremely complex systems • Contributes to Interface Control Documents (ICDs), documenting the interfaces between programs • Experience in developing and/or applying Models and Simulations in support of training, experimentation, acquisition, and analysis of IT systems. • Experience using software tools and database technology to develop information and data for modeling and simulation of engineering, technical, and program attributes such as cost and design trade-offs to determine methods for optimizing • Makes recommendations and advises on organization-wide systems improvements, optimization or maintenance efforts, in the following areas: o Information systems architecture - including on-premise, cloud, and hybrid architectures o Cyber Security technologies o Mobility technologies o Automation technologies o Machine learning technologies o Risk management  o System life-cycle management o Modeling and simulation; graphics; data management",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "163.3129",
        "gsa_price_with_iff__b_": "163.3129",
        "gsa_price_with_iff__c_": "168.7022",
        "gsa_price_with_iff__d_": "174.2694",
        "gsa_price_with_iff__e_": "180.0203",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "Masters - 3, High School - 10",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "engineer,systems,solution,architect,infrastructure",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Masters - 3, High School - 10",
      "security_clearance": "No",
      "contractor_id": 2988,
      "price_list_id": 1050
    },
    {
      "contract_number": "47QTCA19D00BP",
      "labor_category": "Senior Systems Engineer/Integrator",
      "hourly_rate": 185.9088,
      "source_sheet_name": "Price List",
      "source_row_number": 18,
      "raw_data": {
        "vendor_name": "BLUESTONE LOGIC, LLC",
        "unique_catalog_item_id": "Bluestone Sr Sys Eng/Integrator",
        "title": "Senior Systems Engineer/Integrator",
        "description": "This level possesses and applies expertise on multiple complex work assignments. Assignments may be broad in nature, requiring originality and innovation in determining how to accomplish tasks. Operates with appreciable latitude in developing methodology and presenting solutions to problems. May supervise and mentor others.  Daily job duties include: • Leads assigned portions of design, programming, and documentation for information systems. • Participates in all phases of software development, with emphasis on the programming, testing, documentation, and acceptance phases. • Designs and prepares technical reports and related documentation, and makes charts and graphs to record results. • Responsible for the design, development, implementation, of computer programs and their systems. • Plans the full range of programming actions to produce several interrelated but different products from numerous and diverse data elements which are usually from different sources; solves difficult programming problems. • Uses knowledge of pertinent system software, computer equipment, work processes, regulations, and management practices. • Develops and/or maintains operating systems, communications software, database packages, compilers, assemblers, and utility programs. • Knowledgeable of government regulations, manuals, technical orders and standards as applied to the development of government systems. • Modifies existing and creates special purpose software and ensures system efficiency and integrity. Analyzes systems requirements and design specifications. • Develops block diagrams and logic flow charts. • Translates detailed design into computer software. • Tests, debugs, and refines the computer software to produce the required product. • Enhances software to reduce operating time or improve efficiency • Performs technical and subject matter research on emerging technologies to determine impacts on application executions.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "185.9088",
        "gsa_price_with_iff__b_": "185.9088",
        "gsa_price_with_iff__c_": "192.0438",
        "gsa_price_with_iff__d_": "198.3812",
        "gsa_price_with_iff__e_": "204.9278",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "Masters - 3, High School - 10",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "engineer,systems,integrate,design",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Masters - 3, High School - 10",
      "security_clearance": "No",
      "contractor_id": 2988,
      "price_list_id": 1050
    },
    {
      "contract_number": "47QTCA19D00BP",
      "labor_category": "Senior User Experience (UX) Engineer",
      "hourly_rate": 141.3102,
      "source_sheet_name": "Price List",
      "source_row_number": 19,
      "raw_data": {
        "vendor_name": "BLUESTONE LOGIC, LLC",
        "unique_catalog_item_id": "Bluestone Sr UX Eng",
        "title": "Senior User Experience (UX) Engineer",
        "description": "This level possesses and applies expertise on multiple complex work assignments. Assignments may be broad in nature, requiring originality and innovation in determining how to accomplish tasks. Operates with appreciable latitude in developing methodology and presenting solutions to problems.  Daily job duties include: • Performs human-centered design studies in human/machine interaction, environmental design, and human performance assessment • Responsible for project deliverables and writing of technical reports • Designs experiments and usability testing • Performs data collection and analysis of behavioral data • Knowledge of human cognition, including serial and parallel processing, visual perception, attention allocation, and reaction time • Expert in experimental design and statistical analysis • Designs and builds graphical user interfaces (GUIs) using a variety of graphics software applications, techniques, and tools • Designs and develops user interface features, animation, and special-effects elements. • Member of the design team responsible for enhancing the look and feel of the organization’s websites, web applications, desktop applications, and mobile applications • Designs the visual style and guidance used to support the organizations strategies and goals relative to external communications • Provides for development and content that will motivate and engage users so that they regularly access functional websites, web applications, desktop applications, and mobile applications to use them as a major source for information and decision-making • Provides managing/performing content editorial activities including gathering and researching information that enhances the value of websites, web applications, desktop applications, and mobile applications built for the customer",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "141.3102",
        "gsa_price_with_iff__b_": "141.3102",
        "gsa_price_with_iff__c_": "145.9735",
        "gsa_price_with_iff__d_": "150.7906",
        "gsa_price_with_iff__e_": "155.7667",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "Masters - 3, High School - 10",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "technical,analyze,usability,test",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Masters - 3, High School - 10",
      "security_clearance": "No",
      "contractor_id": 2988,
      "price_list_id": 1050
    },
    {
      "contract_number": "47QTCA19D00BP",
      "labor_category": "Staff Systems Solutions Engineer",
      "hourly_rate": 113.7393,
      "source_sheet_name": "Price List",
      "source_row_number": 20,
      "raw_data": {
        "vendor_name": "BLUESTONE LOGIC, LLC",
        "unique_catalog_item_id": "Bluestone Staff Sys Solutions Eng",
        "title": "Staff Systems Solutions Engineer",
        "description": "This level applies fundamental concepts, processes, practices, and procedures on small projects and assignments. Performs work that requires practical experience and training.  Daily job duties include: • Contribute to all aspects of information technology projects. • Participates in the implementation of large, complex information technology systems • Identifies user requirements and describe services available or refer inquiries to other staff within installation • Provides technical support to users and assist them in defining and solving computing problems within well-defined areas of responsibility • Provides input for preparation of documentation of supported products for other staff members and users • Provides input for preparation of user training materials and assists in conducting training sessions as assigned • Performs programming tasks to assist users • Travels to the customer site to analyze and enhance the IT systems used within the organization • Performs interviews and other research • Provides technical and administrative assistance for problem definition, analysis, requirements development and implementation, for complex systems • Makes recommendations and advises on organization-wide systems improvements, optimization or maintenance efforts, in the following areas: o Information systems architecture - including on-premise, cloud, and hybrid architectures o Cyber Security technologies o Mobility technologies o Automation technologies o Machine learning technologies o Risk management  o System life-cycle management o Modeling and simulation; graphics; data management",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "113.7393",
        "gsa_price_with_iff__b_": "113.7393",
        "gsa_price_with_iff__c_": "117.4927",
        "gsa_price_with_iff__d_": "121.3699",
        "gsa_price_with_iff__e_": "125.3751",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "Masters - 0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "engineer,systems,solution,architect,infrastructure",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Masters - 0",
      "security_clearance": "No",
      "contractor_id": 2988,
      "price_list_id": 1050
    },
    {
      "contract_number": "47QTCA19D00BP",
      "labor_category": "Technical Writer",
      "hourly_rate": 75.4688,
      "source_sheet_name": "Price List",
      "source_row_number": 21,
      "raw_data": {
        "vendor_name": "BLUESTONE LOGIC, LLC",
        "unique_catalog_item_id": "Bluestone Technical Writer",
        "title": "Technical Writer",
        "description": "This level possesses and applies a comprehensive knowledge across key tasks and high impact assignments. Plans and leads major communications assignments. Functions as a communication expert across multiple project assignments.  Daily job duties include: • Writes a variety of technical articles, reports, brochures, and/or manuals for documentation for a wide range of uses • Coordinates the display of graphics and the production of document • Ensures content is of high quality and conforms to standards",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "75.4688",
        "gsa_price_with_iff__b_": "75.4688",
        "gsa_price_with_iff__c_": "77.9593",
        "gsa_price_with_iff__d_": "80.532",
        "gsa_price_with_iff__e_": "83.1895",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "Masters - 0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "write,edit,technical,document",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Masters - 0",
      "security_clearance": "No",
      "contractor_id": 2988,
      "price_list_id": 1050
    }
  ],
  "parsed_at": "2025-11-06T11:50:44.775886"
}