{
  "contract_number": "47QTCA20D00CK",
  "contractor_id": 12247,
  "price_list_id": 1635,
  "labor_categories": [
    {
      "contract_number": "47QTCA20D00CK",
      "labor_category": "Project Manager",
      "hourly_rate": 119.9,
      "source_sheet_name": "Price List",
      "source_row_number": 3,
      "raw_data": {
        "vendor_name": "THE DASTON CORPORATION",
        "unique_catalog_item_id": "101-Project Manager",
        "title": "Project Manager",
        "description": "The functional description areas consist of, but are not limited to any of the following: Perform day-to-day management of overall task order support operation. Provide technical management for project. Design, develop, and manage information systems. Formulate and enforce work standards. Provide technical leadership and manage specific task orders. Ensure implementation and check progress of technical solutions and schedules. Perform formal and informal review of work products for precision, adherence to design concepts, and adherence to user standards. Monitor standards and procedures. Review project documentation. Prepare milestone status reports. Transition existing project teams. Coordinate operation and maintenance support for post-installation activities. Establish and maintain processes for evaluating systems and associated documentation. Determine resources required for quality control. Responsible for maintaining quality throughout the project life cycle. Communicate task assignments effectively to varied personnel. Responsible for overall task performance. Assemble, organize, and staffs highly skilled teams. Conducts formal workshops and seminars. Interpret policies, procedures, and goals. Interacts with all levels of management",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "119.9",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Project Management,Leadership,Performance Management,Management,Project Review",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12247,
      "price_list_id": 1635
    },
    {
      "contract_number": "47QTCA20D00CK",
      "labor_category": "Subject Matter Expert",
      "hourly_rate": 128.46,
      "source_sheet_name": "Price List",
      "source_row_number": 4,
      "raw_data": {
        "vendor_name": "THE DASTON CORPORATION",
        "unique_catalog_item_id": "102- Subject Matter Expert",
        "title": "Subject Matter Expert",
        "description": "The l responsibilities areas consist of, but are not limited to any of the following: Identify best practices and develop and evaluate methodologies for change management and process reengineering. Promote organizational development and improved business management techniques. Create, process, activity, and data models for information engineering. Develop improved information systems processes, methods, and practices. Define security requirement and architectures and evaluate approved security product capabilities. Contribute to process modernization projects. Perform risk analyses and assessments. Design databases through the translation of data requirement into logical data structures. Research applicable standards for client/server and other technologies. Perform reverse engineering and requirements analyses for the development of functional requirements for complex information systems. Analyze business practices and functions to support enterprise-wide strategic systems planning. Ensure compliance with industry standards and legislative and regulatory requirements. Analyze, evaluate, verify, and validate existing information systems. Develop specifications for various systems, including voice, data, and COTS products. Facilitate Joint Application development (JAD) sessions and other group training. Evaluate firewalls and other Internet access tools. Conduct formal workshops and seminars. Analyze and design business applications. Prepare functional requirements and specifications for hardware acquisitions. Provide technical expertise for network configuration and performance enhancement. Translate technical information. Develop migration strategies and ensure that all integration issues, including cross functional and security are addressed. Demonstrate familiarity with groupware and relational database systems. Translate applications requirements into web-based solutions using variable technology.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "128.46",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "SaaS,IaaS,PaaS Cloud,Information Technology",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12247,
      "price_list_id": 1635
    },
    {
      "contract_number": "47QTCA20D00CK",
      "labor_category": "Google Professional Services",
      "hourly_rate": 137.03,
      "source_sheet_name": "Price List",
      "source_row_number": 5,
      "raw_data": {
        "vendor_name": "THE DASTON CORPORATION",
        "unique_catalog_item_id": "103- Google Professional Services",
        "title": "Google Professional Services",
        "description": "Business or other related scientific or technical discipline or three years of equivalent experience in a related field.  Responsibe for all activities around delivering Google Professional Services to include, development, maintenance, training, management, and testing of all Google Cloud Services.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "137.03",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "6.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Google Cloud",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12247,
      "price_list_id": 1635
    },
    {
      "contract_number": "47QTCA20D00CK",
      "labor_category": "Cloud Developer",
      "hourly_rate": 111.34,
      "source_sheet_name": "Price List",
      "source_row_number": 6,
      "raw_data": {
        "vendor_name": "THE DASTON CORPORATION",
        "unique_catalog_item_id": "104- Cloud Developer",
        "title": "Cloud Developer",
        "description": "The functional responsibilities areas consist of, but are not limited to any of the following: Provide technical supervision for Web development projects. Ensure implementation of technical solutions and schedules. Apply new and emerging technologies to the web page development process. Translate applications requirements into web pages to provide internet solutions that enable customers to make information available to the general public in the Web friendly format. Knowledge of languages such as C, C++, Java, ActiveX, Perl, and VRML. Integrate applications and web pages to serve either as stand-alone site or as the front end to web-based applications. Perform requirements analyses. Perform object-oriented programming. Test, debug, integrate, and enhance software using object-oriented principles and rapid prototyping. Participate in planning and development of database management, security, maintenance, and utilization. Produce logic flowcharts and pseudo-code. Test and evaluate web-based systems for acceptance. Develop Internet/Intranet applications and home pages.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "111.34",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Web Development,Programming,Testing",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12247,
      "price_list_id": 1635
    },
    {
      "contract_number": "47QTCA20D00CK",
      "labor_category": "System Administrator",
      "hourly_rate": 116.88,
      "source_sheet_name": "Price List",
      "source_row_number": 7,
      "raw_data": {
        "vendor_name": "THE DASTON CORPORATION",
        "unique_catalog_item_id": "105- System Administrator",
        "title": "System Administrator",
        "description": "The functional responsibilities areas consist of, but are not limited to any of the following: Develop information system methods, practices, data requirements, and functional requirements. Define security requirements and architectures and develop solutions to multilevel security problems. Perform risk analysis and assessments. Analyze, design, and implement systems and databases. Research applicable information engineering standards. Integrate telecommunication and computing systems. Operate large client/server information systems. Develop specifications and migration strategies for voice systems, data systems, and COTS products. Apply reengineering disciplines to support enterprise-wide strategic systems planning. Ensure compliance with industry standards. Apply object-oriented principles to software development. Define logical, functional, and technical system architectures. Study, analyze, and evaluate existing information systems. Integrate systems through database design. Analyze, design, and develop business applications to satisfy unique requirements. Optimize system operation and resource utilization by analyzing and planning system capacity. Ensure that all integration issues, including cross functional and security are addressed. Establish and maintain processes for evaluating system and associated documentation. Demonstrate familiarity with groupware and relational database systems. Create process, activity, and data models. Evaluate and develop methodologies. Design and apply software engineering methodology. Facilitate Joint Development (FJD) sessions.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "116.88",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Information Systems,Database Systems,System Design,Database Design",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12247,
      "price_list_id": 1635
    },
    {
      "contract_number": "47QTCA20D00CK",
      "labor_category": "Training Specialist",
      "hourly_rate": 101.96,
      "source_sheet_name": "Price List",
      "source_row_number": 8,
      "raw_data": {
        "vendor_name": "THE DASTON CORPORATION",
        "unique_catalog_item_id": "106- Training Specialist",
        "title": "Training Specialist",
        "description": "The functional responsibilities areas consist of, but are not limited to any of the following: Provide technical leadership for training projects and overall management for specific task orders. Develop specifications. Ensure implementation of technical solutions and schedules. Perform training requirement analyses. Develop and provide technical and end-user training, including instructor and student materials. Train users on operation of information technology systems. Conduct formal classroom courses, workshops, seminars, and computer-based training.",
        "sin": "54151S",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "101.96",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Training,workshops,technical training,end user training",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12247,
      "price_list_id": 1635
    }
  ],
  "parsed_at": "2025-11-06T11:48:39.141238"
}