{
  "contract_number": "47QTCA18D001Z",
  "contractor_id": 8481,
  "price_list_id": 1780,
  "labor_categories": [
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Principal",
      "hourly_rate": 283.51,
      "source_sheet_name": "Price List",
      "source_row_number": 3,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "101.0",
        "title": "Principal",
        "description": "Plans, develops, and establishes IT and related strategic policies and objectives of organization in accordance with board directives and corporation charter. This is a top executive within the organization. Responsible for the performance, operations and profitability regardingIT and related areas of the entire organization. Confers with organization managers to plan IT and related business objectives, to develop IT and related organizational policies to coordinate functions and operations between divisions and departments, and to establish responsibilities and procedures for attaining IT and related objectives. Reviews activity reports and financial statements to determine progress and status in attaining IT and related objectives and revises objectives and plans in accordance with current conditions. Directs andcoordinates formulation of IT and related financial programs to providefunding for new or continuing operations to maximize returns on investments, and to increase productivity. Evaluates performance of executives for compliance with established IT and related policies and objectives of firm and contributions in attaining objectives.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "283.51",
        "gsa_price_with_iff__c_": "283.51",
        "gsa_price_with_iff__d_": "293.15",
        "gsa_price_with_iff__e_": "303.11",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Senior Program Manager",
      "hourly_rate": 225.81,
      "source_sheet_name": "Price List",
      "source_row_number": 4,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "102.0",
        "title": "Senior Program Manager",
        "description": "Manages and coordinates complex or multiple IT and related projects to ensure that implementation and prescribed activities are carried out in accordance with overall corporate objectives. Plans and develops methods and procedures for implementing IT and related programs, directs and coordinates these program activities, and exercises control over personnel responsible for specific functions or phases of the program. Provides high level oversight of all supporting Project Managers helping to resolve resource, schedule, and contract issues as they occur. Selects personnel according to knowledge and experience based on overall program and/or project requirements. Directs and coordinates personally, or through subordinate managerial personnel, activities concerned with implementation and carrying out objectives of the program. Reviews reports and records of activities to ensure progress is being accomplished toward specified objectives and modifies or changes methodology as required to redirect activities and attain those objectives. Prepares programreports for corporate review. Controls expenditures in accordance with budget allocations.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "225.81",
        "gsa_price_with_iff__c_": "225.81",
        "gsa_price_with_iff__d_": "233.49",
        "gsa_price_with_iff__e_": "241.43",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Project Manager",
      "hourly_rate": 203.69,
      "source_sheet_name": "Price List",
      "source_row_number": 5,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "103.0",
        "title": "Project Manager",
        "description": "Manages day to day contract execution activities of one or more IT and related projects. Coordinates and facilitates overall IT and related project activities to ensure that implementation and prescribed activities are carried out in accordance with contract scope requirements and associated corporate objectives. Serves as the primary interface with the client. Plans and develops methods and procedures for IT and related project execution, directs and coordinates project activities, and exercises control over personnel responsible for specific functions or phases of project. Develops detailed work plans, schedules, project estimates, resource plans, and status reports. Confers with staff to explain IT and related project schedule, priorities, constraints, and individual responsibilities. Directs and coordinates personally, or through subordinate managerial personnel, activities concerned with implementation and carrying out IT and related project objectives. Overall responsible for maintaining and updating IT and related Project Management related reports/charts in support of client and senior corporate management requirements. Controls expenditures in accordance with budget allocations. May participate in the interviewing and selection process of new and/or replacement resources.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "203.69",
        "gsa_price_with_iff__c_": "203.69",
        "gsa_price_with_iff__d_": "210.61",
        "gsa_price_with_iff__e_": "217.77",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Engineer",
      "hourly_rate": 168.35,
      "source_sheet_name": "Price List",
      "source_row_number": 6,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "104.0",
        "title": "Engineer",
        "description": "Generally, works under the direction of Senior Program Manager and/or Project Manager. Performs and oversees systems and network engineering research, design, development and other assignments in accordance with IT and related project requirements. Supports efforts that provide engineering, technical, and managerial direction for problem definition, analysis, requirements development and implementation for complex IT and related systems in the engineering discipline to meet project requirements. May manage IT and related technical and engineering projects of some complexity and importance. Supports initiatives to capture current conditions, identify requirements, propose potential solutions, and capture requirements for associated changes. Performs independent research and prepares specialized studies and ad hoc reports. Assigns, coordinates, and reviews work of more junior staff. Compiles documentation of IT and related project development and any subsequent revisions. Supports the preparation of project management records and reports.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "168.35",
        "gsa_price_with_iff__c_": "168.35",
        "gsa_price_with_iff__d_": "174.08",
        "gsa_price_with_iff__e_": "179.99",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "4.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience). Professional Registration may be substituted for degree.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience). Professional Registration may be substituted for degree.",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Senior Programmer/Analyst",
      "hourly_rate": 141.48,
      "source_sheet_name": "Price List",
      "source_row_number": 7,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "105.0",
        "title": "Senior Programmer/Analyst",
        "description": "Participates in systems analysis and programming initiatives with a focus on the more challenging aspects of system requirements. Plays a major role in the evaluation of requests for new or modified systems to determine feasibility, cost and time required, compatibility with other related systems, and hardware configuration. Formulates plan for system development, using structured analysis and design. Plans, develops, tests, and documents computer programs, applying knowledge of programming techniques and computer systems. Submits plans for management and/or client approval. Prepares flowcharts and/or modeling diagrams to illustrate sequence of steps system must follow and to describe logical operations involved. May consult with user/client to identify current operating procedures and clarify system objectives. Conducts research to expand understanding of user requirements and latest programming techniques. Designs architecture, database, and user interface to meet defined requirements. Converts project specifications, using flowcharts and/or modeling diagrams, into sequence of detailed instructions and logical steps for coding, applying knowledge of computer programming techniques and computer languages. Produces and maintains documentation to describe system development, logic, coding, and corrections. Writes manual for users to describe installation and operating procedures. Participates in and/or oversees systems training, installation of hardware/software, technical assistance to users, installation and testing system at user site, and monitoring system performance after implementation.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "141.48",
        "gsa_price_with_iff__c_": "141.48",
        "gsa_price_with_iff__d_": "146.29",
        "gsa_price_with_iff__e_": "151.26",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "6.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Programmer/Analyst",
      "hourly_rate": 127.23,
      "source_sheet_name": "Price List",
      "source_row_number": 8,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "106.0",
        "title": "Programmer/Analyst",
        "description": "Participates in all systems analysis and programming initiatives. Participated in the evaluation of requests for new or modified systems to determine feasibility, cost and time required, compatibility with other related systems, and hardware configuration. Executes system development plans, using structured analysis and design. Participates in the planning, development, testing, and documentation initiatives, applying knowledge of programming techniques and computer systems. Prepares flowcharts and/or modeling diagrams to illustrate sequence of steps system must follow and to describe logical operations involved. Consults with assigned project management personnel to clarify project goals and objectives. Participates in research to expand understanding of user requirements and latest programming techniques. Develops architecture, database, and user interface to meet defined requirements. Participates in the conversion of the project specifications, using flowcharts and/or modeling diagrams, into sequence of detailed instructions and logical steps for coding, applying knowledge of computer programming techniques and computer languages. Produces and maintains documentation to describe system development, logic, coding, and corrections. Writes manual for users to describe installation and operating procedures. Assists in systems training, installation of hardware/software, technical assistance to users, installation and testing system at user site, and monitoring system performance after implementation.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "127.23",
        "gsa_price_with_iff__c_": "127.23",
        "gsa_price_with_iff__d_": "131.56",
        "gsa_price_with_iff__e_": "136.03",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "4.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Junior Programmer/Analyst",
      "hourly_rate": 104.37,
      "source_sheet_name": "Price List",
      "source_row_number": 9,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "107.0",
        "title": "Junior Programmer/Analyst",
        "description": "Participates in programming initiatives with a focus on those least technically challenging. Supports implementation of system development plans, using structured analysis and design. Participates in the planning, development, testing, and documentation initiatives, applying knowledge of programming techniques and computer systems. Prepares flowcharts and/or modeling diagrams to illustrate sequence of steps system must follow and to describe logical operations involved. Consults with project supervisors to clarify project goals and objectives. Participates in research to expand understanding of user requirements and latest programming techniques. Supports development and implementation of architecture, database, and user interface to meet defined requirements. Participates in the conversion of the project specifications, using flowcharts and/or modeling diagrams, into sequence of detailed instructions and logical steps for coding, applying knowledge of computer programming techniques and computer languages. Assists in the production and maintenance of documentation to describe system development, logic, coding, and corrections. Participates in the writing of user’s manuals to describe installation and operating procedures. May assists users in solving operating problems. May participate in the installation of hardware and software. May provide technical assistance to system users. May assist in installing and testing system at user site. May monitor performance of system after implementation.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "104.37",
        "gsa_price_with_iff__c_": "104.37",
        "gsa_price_with_iff__d_": "107.92",
        "gsa_price_with_iff__e_": "111.59",
        "minimum_education": "High_School",
        "minimum_years_of_education": "2.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "High_School",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Programmer",
      "hourly_rate": 81.33,
      "source_sheet_name": "Price List",
      "source_row_number": 10,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "108.0",
        "title": "Programmer",
        "description": "Receives programming tasks and creates or modifies computer programs for user interfaces, application programs, reports, databases and communication networks. Participates in the planning, development, testing, and documentation initiatives, applying knowledge of programming techniques and computer systems. Assists in the production and maintenance of documentation to describe system development, logic, coding, and corrections. Participates in the writing of user’s manuals to describe installation and operating procedures. May assists users in solving operating problems. May participate in the installation of hardware and software. May provide technical assistance to system users.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "81.33",
        "gsa_price_with_iff__c_": "81.33",
        "gsa_price_with_iff__d_": "84.09",
        "gsa_price_with_iff__e_": "86.95",
        "minimum_education": "High_School",
        "minimum_years_of_education": "1.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "High_School",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Senior Subject Matter Specialist",
      "hourly_rate": 161.42,
      "source_sheet_name": "Price List",
      "source_row_number": 11,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "109.0",
        "title": "Senior Subject Matter Specialist",
        "description": "Leads subordinate Subject Matter Specialists and other team members in the activities of solving specialized business process challenges. Works closely with the client and users to capture current business processes, identify inefficiencies, propose potential solutions, and capture requirements for associated changes. Conducts and prepares specialized studies and analysis. Assigns, coordinates, and reviews work of more junior analysts. Consults with managerial and systems analysis personnel to clarify system intent, identify potential problems, suggest changes/enhancements, and participate in the planning and execution of system testing. Participates in the development of workflow and/or modeling diagrams with a focus on the end user. Compiles documentation of program development and subsequent revisions. Supports the preparation of project management records and reports",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "161.42",
        "gsa_price_with_iff__c_": "161.42",
        "gsa_price_with_iff__d_": "166.91",
        "gsa_price_with_iff__e_": "172.58",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "7.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Technical Subject Matter Specialist",
      "hourly_rate": 132.88,
      "source_sheet_name": "Price List",
      "source_row_number": 12,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "110.0",
        "title": "Technical Subject Matter Specialist",
        "description": "Supports the Senior Subject Matter Specialists in solving specialized business process challenges. Support initiatives to capture current business processes, identify inefficiencies, propose potential solutions, and capture requirements for associated changes. Performs independent research and prepares specialized studies and ad hoc reports. Assigns, coordinates, and reviews work of more junior analysts. Consults with managerial and systems analysis personnel to clarify system intent, identify potential problems, suggest changes/enhancements, and participate in the planning and execution of system testing. Participates in the development of workflow and/or modeling diagrams with a focus on the end user. Compiles documentation of program development and subsequent revisions. May support the preparation of project management records and reports.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "132.88",
        "gsa_price_with_iff__c_": "132.88",
        "gsa_price_with_iff__d_": "137.39",
        "gsa_price_with_iff__e_": "142.07",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "6.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Technical Analyst",
      "hourly_rate": 134.71,
      "source_sheet_name": "Price List",
      "source_row_number": 13,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "111.0",
        "title": "Technical Analyst",
        "description": "Provides support in analyzing technical issues, researching relevant information, and recommending solutions to client problems. Supports initiatives to capture current conditions, identify requirements, propose potential solutions, and capture requirements for associated changes. Performs independent research and prepares specialized studies and ad hoc reports. Assigns, coordinates, and reviews work of more junior analysts. Consults with managerial and systems analysis personnel to clarify system intent, identify potential problems, suggest changes/enhancements, and participate in the planning and execution of system testing. Participates in the development of workflow and/or modeling diagrams with a focus on the end user. Compiles documentation of program development and subsequent revisions. May support the preparation of project management records and reports.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "134.71",
        "gsa_price_with_iff__c_": "134.71",
        "gsa_price_with_iff__d_": "139.29",
        "gsa_price_with_iff__e_": "144.03",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Junior Technical Analyst",
      "hourly_rate": 107.74,
      "source_sheet_name": "Price List",
      "source_row_number": 14,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "112.0",
        "title": "Junior Technical Analyst",
        "description": "Works under the direction of Technical Analysts and/or other senior staff as assigned. Performs research and prepares input for specialized studies and ad hoc reports. Participates in the development of workflow and/or modeling diagrams with a focus on the end user. Compiles documentation of program development and subsequent revisions. May support the preparation of project management records and reports. May also support preparation of Online Help.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "107.74",
        "gsa_price_with_iff__c_": "107.74",
        "gsa_price_with_iff__d_": "111.41",
        "gsa_price_with_iff__e_": "115.19",
        "minimum_education": "Associates",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Associates",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Business Management Specialist",
      "hourly_rate": 131.16,
      "source_sheet_name": "Price List",
      "source_row_number": 15,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "113.0",
        "title": "Business Management Specialist",
        "description": "Specializes in solving unique and often complex IT and related business process challenges requiring an in-depth knowledge of the business area. Supports associated initiatives to capture current IT and related business processes, identify inefficiencies, propose potential solutions and alternative approaches, and capture requirements for associated changes. Performs independent research and prepares specialized studies and ad hoc reports. Consults with project management and clients, as appropriate, to clarify IT and related system intent, identify potential problems, and suggest changes/enhancement. Participates in the development of workflow and/or modeling diagrams with a focus on the end user. Prepares and maintains documentation associated with describing the detailed IT and related business process functionality within the system. May also support preparation of Online Help.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "131.16",
        "gsa_price_with_iff__c_": "131.16",
        "gsa_price_with_iff__d_": "135.63",
        "gsa_price_with_iff__e_": "140.24",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Training Coordinator",
      "hourly_rate": 128.02,
      "source_sheet_name": "Price List",
      "source_row_number": 16,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "114.0",
        "title": "Training Coordinator",
        "description": "Coordinates and plans IT and related training initiatives. Structures and generates Program of Instruction (POI). Coordinates layout, design, flow, and reproduction of IT and related training materials. Arranges for IT and related training venue and works with supporting staff to ensure facility is properly configured. Utilizes appropriate training tools (e.g. MS PowerPoint and interactive online training tools)to prepare IT and related training sessions. Works with project management personnel and client to identify and plan optimum IT and related training schedule/locations.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "128.02",
        "gsa_price_with_iff__c_": "128.02",
        "gsa_price_with_iff__d_": "132.37",
        "gsa_price_with_iff__e_": "136.88",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "2.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "CAD Technician",
      "hourly_rate": 95.96,
      "source_sheet_name": "Price List",
      "source_row_number": 17,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "115.0",
        "title": "CAD Technician",
        "description": "Provides technical expertise in the use and implementation of CAD techniques. Create and/or modify CAD drawings using current commercially available application. Interpret drawing markups and accurately implement in revised CAD drawings. Support project team in projecting level of effort estimates and establishing viable timelines for project deliverables.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "95.96",
        "gsa_price_with_iff__c_": "95.96",
        "gsa_price_with_iff__d_": "99.22",
        "gsa_price_with_iff__e_": "102.6",
        "minimum_education": "Associates",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Associates",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Technical Documentation Specialist",
      "hourly_rate": 140.39,
      "source_sheet_name": "Price List",
      "source_row_number": 18,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "116.0",
        "title": "Technical Documentation Specialist",
        "description": "Produces technical documentation associated with system development initiatives. Types of documentation can cover a broad spectrum and includes; System Requirements Documents, Functional Requirements Documents, System Design Specifications, Test Plans/Procedures, User Manuals, Unified Modeling Language (UML) documentation, system security related documentation, and Systems Interface Agreements (SIA). Translate pseudo-code to a format understandable to a non-technical reader. Research latest changes and modifications to formal documentation requirements and communicate to management. Participate in preparation of Systems Online Help using appropriate software package.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "140.39",
        "gsa_price_with_iff__c_": "140.39",
        "gsa_price_with_iff__d_": "145.17",
        "gsa_price_with_iff__e_": "150.11",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "7.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Technical Writer",
      "hourly_rate": 84.87,
      "source_sheet_name": "Price List",
      "source_row_number": 19,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "117.0",
        "title": "Technical Writer",
        "description": "Prepare and edit documentation to insure readability and grammatical accuracy. Assist the Technical Documentation Specialist in reviewing and preparing technical documentation. Ensure format of documentation is in accordance with prescribed standards. Identify and incorporate tables, graphs, and charts to enhance readability and comprehension.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "84.87",
        "gsa_price_with_iff__c_": "84.87",
        "gsa_price_with_iff__d_": "87.75",
        "gsa_price_with_iff__e_": "90.73",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "2.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Administrative Specialist",
      "hourly_rate": 88.66,
      "source_sheet_name": "Price List",
      "source_row_number": 20,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "118.0",
        "title": "Administrative Specialist",
        "description": "Supports and/or oversees more junior administrative staff with basic data entry/typing of technical reports and documents. May provide and/or oversee clerical support for processing incoming correspondence, phone calls, invoices, and project status reports. Organizes and maintains employee and contract files. Acts as a receptionist, screens telephone calls, letters, and/or visitors, answers routine questions and furnishes information. Schedules appointments, maintains and disseminates schedules and work plans, and coordinates arrangements for meetings and conferences. Composes and types routine letters and memorandum. Routes or answers routine correspondence not requiring manager’s attention. Prepares special reports, gathering and summarizing data. Organizes and expedites flow of work through manager's office.",
        "sin": "ANCILLARY",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "88.66",
        "gsa_price_with_iff__c_": "88.66",
        "gsa_price_with_iff__d_": "91.68",
        "gsa_price_with_iff__e_": "94.79",
        "minimum_education": "Associates",
        "minimum_years_of_education": "4.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Associates",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Technical Typist/Clerical",
      "hourly_rate": 50.51,
      "source_sheet_name": "Price List",
      "source_row_number": 21,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "119.0",
        "title": "Technical Typist/Clerical",
        "description": "Supports the administrative staff with basic data entry/typing of technical reports and documents. Provides clerical support for processing all incoming correspondence, phone calls, invoices, and project status reports. Record employee hours into the Financial Management System for employees not having ready access.",
        "sin": "ANCILLARY",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "50.51",
        "gsa_price_with_iff__c_": "50.51",
        "gsa_price_with_iff__d_": "52.22",
        "gsa_price_with_iff__e_": "53.99",
        "minimum_education": "High_School",
        "minimum_years_of_education": "2.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "High_School",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Principal Professional Services",
      "hourly_rate": 311.1,
      "source_sheet_name": "Price List",
      "source_row_number": 22,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "120.0",
        "title": "Principal Professional Services",
        "description": "Plans, develops, and establishes professional services and related strategic policies and objectives of organization in accordance with board directives and corporation charter. This is a top executive within the organization. Responsible for the performance, operations and profitability regarding professional services and related areas of the entire organization. Confers with the client and organization managers to plan professional services and related business objectives, to develop professional services and related organizational policies to coordinate functions and operations between divisions and departments, and to establish responsibilities and procedures for attaining professional services and related objectives. Reviews activity reports and financial statements to determine progress and status in attaining professional services and related objectives and revises objectives and plans in accordance with current conditions. Directs and coordinates formulation of professional services and related financial programs to provide funding for new or continuing operations to maximize client value and returns on investments, and to increase productivity. Evaluates performance of executives for compliance with established policies and objectives of firm and contributions in attaining objectives.",
        "sin": "541611",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "311.1",
        "gsa_price_with_iff__c_": "311.1",
        "gsa_price_with_iff__d_": "321.68",
        "gsa_price_with_iff__e_": "332.62",
        "minimum_education": "Masters",
        "minimum_years_of_education": "15.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Masters",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Senior Program Manager Professional Services",
      "hourly_rate": 285.68,
      "source_sheet_name": "Price List",
      "source_row_number": 23,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "121.0",
        "title": "Senior Program Manager Professional Services",
        "description": "Manages and coordinates complex or multiple Professional Services and related projects to ensure that implementation and prescribed activities are carried out in accordance with overall corporate objectives. Plans and develops methods and procedures for implementing Professional Services and related programs, directs and coordinates these program activities, and exercises control over personnel responsible for specific functions or phases of the program. Provides high level oversight of all supporting Project Managers helping to resolve resource, schedule, and contract issues as they occur. Selects personnel according to knowledge and experience based on overall program and/or project requirements. Directs and coordinates personally, or through subordinate managerial personnel, activities concerned with implementation and carrying out objectives of the program. Reviews reports and records of activities to ensure progress is being accomplished toward specified objectives and modifies or changes methodology as required to redirect activities and attain those objectives. Prepares program reports for corporate review. Controls expenditures in accordance with budget allocations.",
        "sin": "541611",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "285.68",
        "gsa_price_with_iff__c_": "285.68",
        "gsa_price_with_iff__d_": "295.4",
        "gsa_price_with_iff__e_": "305.44",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "12.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Project Manager  Professional Services",
      "hourly_rate": 227.48,
      "source_sheet_name": "Price List",
      "source_row_number": 24,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "122.0",
        "title": "Project Manager  Professional Services",
        "description": "Manages day to day contract execution activities of one or more Professional Services and related projects. Coordinates and facilitates overall Professional Services and related project activities to ensure that implementation and prescribed activities are carried out in accordance with contract scope requirements and associated corporate objectives. Serves as the primary interface with the client. Plans and develops methods and procedures for Professional Services and related project execution, directs and coordinates project activities, and exercises control over personnel responsible for specific functions or phases of project. Develops detailed work plans, schedules, project estimates, resource plans, and status reports. Confers with staff to explain Professional Services and related project schedule, priorities, constraints, and individual responsibilities.  Directs and coordinates personally, or through subordinate managerial personnel, activities concerned with implementation and carrying out Professional Services and related project objectives. Overall responsible for maintaining and updating Professional Services and related Project Management related reports/charts in support of client and senior corporate management requirements. Controls expenditures in accordance with budget allocations. May participate in the interviewing and selection process of new and/or replacement resources.",
        "sin": "541611",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "227.48",
        "gsa_price_with_iff__c_": "227.48",
        "gsa_price_with_iff__d_": "235.21",
        "gsa_price_with_iff__e_": "243.21",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Cost Engineer and Estimator",
      "hourly_rate": 266.65,
      "source_sheet_name": "Price List",
      "source_row_number": 25,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "123.0",
        "title": "Cost Engineer and Estimator",
        "description": "Estimates costs for construction, engineering, manufacturing, or other implementation projects based on an analysis of project technical requirements. Collects data and analyzes all project costs, including raw materials, labor, equipment and tooling to ensure estimates are accurate. Identifies and quantifies potential cost uncertainties to ensure costing models capture the full range of potential costs. Updates costs as necessary based on new information and project scope changes. Coordinates with project management, engineering, procurement and other project stakeholders. Work is highly independent. May assume a team lead role for the work group. A specialist on complex technical and business matters.",
        "sin": "541611",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "266.65",
        "gsa_price_with_iff__c_": "266.65",
        "gsa_price_with_iff__d_": "275.72",
        "gsa_price_with_iff__e_": "285.09",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "7.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
        "required_certifications_or_licenses": "PE or CCE/A",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Engineer - Senior Professional Services",
      "hourly_rate": 229.87,
      "source_sheet_name": "Price List",
      "source_row_number": 26,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "124.0",
        "title": "Engineer - Senior Professional Services",
        "description": "Generally, works under the direction of Senior Program Manager and/or Project Manager. Performs and oversees systems and network engineering research, design, development and other assignments in accordance with Professional Services and related project requirements. Supports efforts that provide engineering, technical, and managerial direction for problem definition, analysis, requirements development and implementation for complex Professional Services and related systems in the engineering discipline to meet project requirements. May manage Professional Services and related technical and engineering projects of some complexity and importance. Supports initiatives to capture current conditions, identify requirements, propose potential solutions, and capture requirements for associated changes. Performs independent research and prepares specialized studies and ad hoc reports. Assigns, coordinates, and reviews work of more junior staff. Compiles documentation of Professional Services and related project development and any subsequent revisions. Supports the preparation of project management records and reports.",
        "sin": "541611",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "229.87",
        "gsa_price_with_iff__c_": "229.87",
        "gsa_price_with_iff__d_": "237.69",
        "gsa_price_with_iff__e_": "245.77",
        "minimum_education": "Masters",
        "minimum_years_of_education": "10.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
        "required_certifications_or_licenses": "PE",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Masters",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Engineer",
      "hourly_rate": 203.04,
      "source_sheet_name": "Price List",
      "source_row_number": 27,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "125.0",
        "title": "Engineer",
        "description": "Generally, works under the direction of a Senior Program Manager, Project Manager, and/or Senior Engineer. Performs and oversees systems and network engineering research, design, development and other assignments in accordance with Professional Services and related project requirements. Supports efforts that provide engineering, technical, and managerial direction for problem definition, analysis, requirements development and implementation for complex Professional Services and related systems in the engineering discipline to meet project requirements. May manage Professional Services and related technical and engineering projects of some complexity and importance. Supports initiatives to capture current conditions, identify requirements, propose potential solutions, and capture requirements for associated changes. Performs independent research and prepares specialized studies and ad hoc reports. Assigns, coordinates, and reviews work of more junior staff. Compiles documentation of Professional Services and related project development and any subsequent revisions. Supports the preparation of project management records and reports.",
        "sin": "541611",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "203.04",
        "gsa_price_with_iff__c_": "203.04",
        "gsa_price_with_iff__d_": "209.94",
        "gsa_price_with_iff__e_": "217.08",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience). Professional Registration may be substituted for degree.",
        "required_certifications_or_licenses": "PE",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience). Professional Registration may be substituted for degree.",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Engineer - Junior",
      "hourly_rate": 144.3,
      "source_sheet_name": "Price List",
      "source_row_number": 28,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "126.0",
        "title": "Engineer - Junior",
        "description": "Generally, works under the direction of a Senior Program Manager, Project Manager, and/or higher grade Engineer. Performs and oversees systems and network engineering research, design, development and other assignments in accordance with Professional Services and related project requirements. Supports efforts that provide engineering, technical, and managerial direction for problem definition, analysis, requirements development and implementation for complex Professional Services and related systems in the engineering discipline to meet project requirements. May manage Professional Services and related technical and engineering projects of some complexity and importance. Supports initiatives to capture current conditions, identify requirements, propose potential solutions, and capture requirements for associated changes. Performs independent research and prepares specialized studies and ad hoc reports. Assigns, coordinates, and reviews work of more junior staff. Compiles documentation of Professional Services and related project development and any subsequent revisions. Supports the preparation of project management records and reports.",
        "sin": "541611",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "144.3",
        "gsa_price_with_iff__c_": "144.3",
        "gsa_price_with_iff__d_": "149.21",
        "gsa_price_with_iff__e_": "154.29",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "4.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience). Professional Registration may be substituted for degree.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience). Professional Registration may be substituted for degree.",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Engineer Technician - Senior",
      "hourly_rate": 137.92,
      "source_sheet_name": "Price List",
      "source_row_number": 29,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "127.0",
        "title": "Engineer Technician - Senior",
        "description": "Assists  engineers in the planning, designing, and building of infrastructure and development projects. Helps engineers in the planning of construction projects such as airports, bridges, channels, dams, railroads, and roads. Estimates workload to establish project deadlines and helps prepare proposals and cost estimates. May be responsible for recommending maintenance, repair, and preparing reports for review by an engineer.  Works independently within established procedures associated with the specific job function. Has gained proficiency in multiple competencies relevant to the job.",
        "sin": "541611",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "137.92",
        "gsa_price_with_iff__c_": "137.92",
        "gsa_price_with_iff__d_": "142.61",
        "gsa_price_with_iff__e_": "147.46",
        "minimum_education": "Other_Tech_School_or_Certification",
        "minimum_years_of_education": "5.0",
        "required_certifications_or_licenses": "Master License",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Other_Tech_School_or_Certification",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Engineer Technician",
      "hourly_rate": 125.15,
      "source_sheet_name": "Price List",
      "source_row_number": 30,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "128.0",
        "title": "Engineer Technician",
        "description": "Assists engineers in the planning, designing, and building of infrastructure and development projects. Helps engineers in the planning of construction projects such as airports, bridges, channels, dams, railroads, and roads. Estimates workload to establish project deadlines and helps prepare proposals and cost estimates. May be responsible for recommending maintenance, repair, and preparing reports for review by an engineer.  Works under moderate supervision. Gaining or has attained full proficiency in a specific area of discipline.",
        "sin": "541611",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "125.15",
        "gsa_price_with_iff__c_": "125.15",
        "gsa_price_with_iff__d_": "129.4",
        "gsa_price_with_iff__e_": "133.8",
        "minimum_education": "Other_Tech_School_or_Certification",
        "minimum_years_of_education": "3.0",
        "required_certifications_or_licenses": "Journeyman",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Other_Tech_School_or_Certification",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Engineer Technician - Junior",
      "hourly_rate": 112.38,
      "source_sheet_name": "Price List",
      "source_row_number": 31,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "129.0",
        "title": "Engineer Technician - Junior",
        "description": "Assists engineers in the planning, designing, and building of infrastructure and development projects. Helps engineers in the planning of construction projects such as airports, bridges, channels, dams, railroads, and roads. Estimates workload to establish project deadlines and helps prepare proposals and cost estimates. May be responsible for recommending maintenance, repair, and preparing reports for review by an engineer.   Works under the close direction of senior personnel in the functional area. Possesses a moderate understanding of general aspects of the job.",
        "sin": "541611",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "112.38",
        "gsa_price_with_iff__c_": "112.38",
        "gsa_price_with_iff__d_": "116.2",
        "gsa_price_with_iff__e_": "120.15",
        "minimum_education": "Other_Tech_School_or_Certification",
        "minimum_years_of_education": "1.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Other_Tech_School_or_Certification",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Business Process Analyst - Senior",
      "hourly_rate": 196.66,
      "source_sheet_name": "Price List",
      "source_row_number": 32,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "130.0",
        "title": "Business Process Analyst - Senior",
        "description": "Researches, analyzes, and recommends changes to an organization's business processes to improve operational efficiencies, quality, service, and profitability. Collects and studies operational and performance data to identify trends and opportunities for improvement. Develops process documentation and project plans. Creates flowcharts, process maps, and diagrams. Supports cross-functional activities and working sessions during projects' design and implementation phases. Designs and prepares documentation, training materials, and communications supporting new processes. May deliver training to impacted business units.  Works autonomously. Goals are generally communicated in \"solution\" or project goal terms. May provide a leadership role for the work group through knowledge in the area of specialization. Works on advanced, complex technical projects or business issues requiring state of the art technical or industry knowledge.",
        "sin": "541611",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "196.66",
        "gsa_price_with_iff__c_": "196.66",
        "gsa_price_with_iff__d_": "203.36",
        "gsa_price_with_iff__e_": "210.27",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Business Process Analyst",
      "hourly_rate": 144.3,
      "source_sheet_name": "Price List",
      "source_row_number": 33,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "131.0",
        "title": "Business Process Analyst",
        "description": "Researches, analyzes, and recommends changes to an organization's business processes to improve operational efficiencies, quality, service, and profitability. Collects and studies operational and performance data to identify trends and opportunities for improvement. Develops process documentation and project plans. Creates flowcharts, process maps, and diagrams. Supports cross-functional activities and working sessions during projects' design and implementation phases. Designs and prepares documentation, training materials, and communications supporting new processes. May deliver training to impacted business units. Work is highly independent. May assume a team lead role for the work group. A specialist on complex technical and business matters.",
        "sin": "541611",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "144.3",
        "gsa_price_with_iff__c_": "144.3",
        "gsa_price_with_iff__d_": "149.21",
        "gsa_price_with_iff__e_": "154.29",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "7.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Business Process Analyst - Junior",
      "hourly_rate": 125.15,
      "source_sheet_name": "Price List",
      "source_row_number": 34,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "132.0",
        "title": "Business Process Analyst - Junior",
        "description": "Researches, analyzes, and recommends changes to an organization's business processes to improve operational efficiencies, quality, service, and profitability. Collects and studies operational and performance data to identify trends and opportunities for improvement. Develops process documentation and project plans. Creates flowcharts, process maps, and diagrams. Supports cross-functional activities and working sessions during projects' design and implementation phases. Designs and prepares documentation, training materials, and communications supporting new processes. May deliver training to impacted business units. Work is generally independent and collaborative in nature. Contributes to moderately complex aspects of a project.",
        "sin": "541611",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "125.15",
        "gsa_price_with_iff__c_": "125.15",
        "gsa_price_with_iff__d_": "129.4",
        "gsa_price_with_iff__e_": "133.8",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Training Coordinator",
      "hourly_rate": 137.92,
      "source_sheet_name": "Price List",
      "source_row_number": 35,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "133.0",
        "title": "Training Coordinator",
        "description": "Coordinates and plans Professional Services and related training initiatives. Structures and generates Program of Instruction (POI). Coordinates layout, design, flow, and reproduction of Professional Services and related training materials. Arranges for Professional Services and related training venue and works with supporting staff to ensure facility is properly configured. Utilizes appropriate training tools (e.g. MS PowerPoint and interactive online training tools)to prepare Professional Services and related training sessions. Works with project management personnel and client to identify and plan optimum Professional Services and related training schedule/locations.",
        "sin": "541611",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "137.92",
        "gsa_price_with_iff__c_": "137.92",
        "gsa_price_with_iff__d_": "142.61",
        "gsa_price_with_iff__e_": "147.46",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Economist/Accountant",
      "hourly_rate": 177.51,
      "source_sheet_name": "Price List",
      "source_row_number": 36,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "134.0",
        "title": "Economist/Accountant",
        "description": "Conducts research and analysis on economic data/trends and produces forecasts, interpretive reporting, and media used for risk assessment, communication, and decision making. Collects economic data from established datasets and other sources utilizing data collection and data science protocols. Utilizes statistical analysis, mathematical methodologies, and modeling techniques to develop data. Designs and organizes data into unique report models and graphical illustrations to present economic information used for decision making and solution development.  Work is highly independent. May assume a team lead role for the work group. A specialist on complex technical and business matters.",
        "sin": "541611",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "177.51",
        "gsa_price_with_iff__c_": "177.51",
        "gsa_price_with_iff__d_": "183.55",
        "gsa_price_with_iff__e_": "189.78",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "7.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "CAD/GIS Technician - Senior Professional Services",
      "hourly_rate": 117.54,
      "source_sheet_name": "Price List",
      "source_row_number": 37,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "135.0",
        "title": "CAD/GIS Technician - Senior Professional Services",
        "description": "Provides technical expertise in the use and implementation of CAD techniques. Create and/or modify CAD drawings using current commercially available application. Interpret drawing markups and accurately implement in revised CAD drawings. Support project team in projecting level of effort estimates and establishing viable timelines for project deliverables.",
        "sin": "541611",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "117.54",
        "gsa_price_with_iff__c_": "117.54",
        "gsa_price_with_iff__d_": "121.54",
        "gsa_price_with_iff__e_": "125.67",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "CAD Technician Professional Services",
      "hourly_rate": 103.62,
      "source_sheet_name": "Price List",
      "source_row_number": 38,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "136.0",
        "title": "CAD Technician Professional Services",
        "description": "Provides technical expertise in the use and implementation of CAD techniques. Create and/or modify CAD drawings using current commercially available application. Interpret drawing markups and accurately implement in revised CAD drawings. Support project team in projecting level of effort estimates and establishing viable timelines for project deliverables.",
        "sin": "541611",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "103.62",
        "gsa_price_with_iff__c_": "103.62",
        "gsa_price_with_iff__d_": "107.14",
        "gsa_price_with_iff__e_": "110.79",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "7.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "CAD/GIS Technician - Junior Professional Services",
      "hourly_rate": 90.99,
      "source_sheet_name": "Price List",
      "source_row_number": 39,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "137.0",
        "title": "CAD/GIS Technician - Junior Professional Services",
        "description": "Provides technical expertise in the use and implementation of CAD techniques. Create and/or modify CAD drawings using current commercially available application. Interpret drawing markups and accurately implement in revised CAD drawings. Support project team in projecting level of effort estimates and establishing viable timelines for project deliverables.",
        "sin": "541611",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "90.99",
        "gsa_price_with_iff__c_": "90.99",
        "gsa_price_with_iff__d_": "94.09",
        "gsa_price_with_iff__e_": "97.28",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "4.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Customer Support Analyst",
      "hourly_rate": 94.77,
      "source_sheet_name": "Price List",
      "source_row_number": 40,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "138.0",
        "title": "Customer Support Analyst",
        "description": "Analyzes customer and consumer data and research to identify trends, key indicators, patterns, and insights. Assists in developing and conducting focus groups, surveys, competitor intelligence studies, and industry research to support product development, category/brand management and marketing or sales initiatives. Uses market research and statistical methodologies and tools to perform analysis. Performs data collection, input, and aggregation processes to develop and maintain research databases. Occasionally directed in several aspects of the work. Gaining exposure to some of the complex tasks within the job function.",
        "sin": "541611",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "94.77",
        "gsa_price_with_iff__c_": "94.77",
        "gsa_price_with_iff__d_": "97.99",
        "gsa_price_with_iff__e_": "101.33",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "4.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Technical Documentation Specialist",
      "hourly_rate": 149.14,
      "source_sheet_name": "Price List",
      "source_row_number": 41,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "139.0",
        "title": "Technical Documentation Specialist",
        "description": "Produces technical documentation associated with system development initiatives. Types of documentation can cover a broad spectrum and includes; System Requirements Documents, Functional Requirements Documents, System Design Specifications, Test Plans/Procedures, User Manuals, Unified Modeling Language (UML) documentation, system security related documentation, and Systems Interface Agreements (SIA). Translate pseudo-code to a format understandable to a non-technical reader. Research latest changes and modifications to formal documentation requirements and communicate to management. Participate in preparation of Systems Online Help using appropriate software package.",
        "sin": "541611",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "149.14",
        "gsa_price_with_iff__c_": "149.14",
        "gsa_price_with_iff__d_": "154.21",
        "gsa_price_with_iff__e_": "159.45",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "7.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Technical Writer",
      "hourly_rate": 123.85,
      "source_sheet_name": "Price List",
      "source_row_number": 42,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "140.0",
        "title": "Technical Writer",
        "description": "Creates and publishes technical documentations and manuals. Collects and interprets technical data or information and coordinates layout for publication.  Typically reports to a manager.  A specialist on complex technical and business matters. Work is highly independent. May assume a team lead role for the work group.",
        "sin": "541611",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "123.85",
        "gsa_price_with_iff__c_": "123.85",
        "gsa_price_with_iff__d_": "128.06",
        "gsa_price_with_iff__e_": "132.41",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "7.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Technical Writer - Junior",
      "hourly_rate": 84.66,
      "source_sheet_name": "Price List",
      "source_row_number": 43,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "141.0",
        "title": "Technical Writer - Junior",
        "description": "Creates and publishes technical documentations and manuals. Collects and interprets technical data or information and coordinates layout for publication. Typically reports to a manager.  Gains exposure to some of the complex tasks within the job function. Occasionally directed in several aspects of the work.",
        "sin": "541611",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "84.66",
        "gsa_price_with_iff__c_": "84.66",
        "gsa_price_with_iff__d_": "87.55",
        "gsa_price_with_iff__e_": "90.52",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "2.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    },
    {
      "contract_number": "47QTCA18D001Z",
      "labor_category": "Administrative Specialist - Senior",
      "hourly_rate": 117.54,
      "source_sheet_name": "Price List",
      "source_row_number": 44,
      "raw_data": {
        "vendor_name": "R & K SOLUTIONS INC",
        "unique_catalog_item_id": "142.0",
        "title": "Administrative Specialist - Senior",
        "description": "Provides administrative support to an individual, team, department or group in an organization. Collects, reviews and analyzes data and prepares reports, charts, budgets, and other presentation materials utilizing word processing, spreadsheet, or specialized software. Prepares and distributes reports or other communications on a regular schedule. Maintains files, databases, and archives of relevant records. Screens calls and responds to or routes routine inquiries from external or internal sources with appropriate correspondence or other messaging. Schedules and coordinates meetings, travel, and other group activities. May manage expense reporting, invoicing, office supply inventory, or other routine processes.  Works independently within established procedures associated with the specific job function. Has gained proficiency in multiple competencies relevant to the job. May supervise junior personnel in similar functions.",
        "sin": "ANCILLARY",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "117.54",
        "gsa_price_with_iff__c_": "117.54",
        "gsa_price_with_iff__d_": "121.54",
        "gsa_price_with_iff__e_": "125.67",
        "minimum_education": "Associates",
        "minimum_years_of_education": "7.0",
        "education_and_experience_substitution": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Associates",
      "years_experience": "Two years of directly related experience may substitute for one year of formal education. Higher level degrees may be substituted for experience (e.g. a Master’s degree could be substituted for two years of experience).",
      "security_clearance": "No",
      "contractor_id": 8481,
      "price_list_id": 1780
    }
  ],
  "parsed_at": "2025-11-06T11:50:01.274516"
}