{
  "contract_number": "47QTCA22D0036",
  "contractor_id": 13446,
  "price_list_id": 148,
  "labor_categories": [
    {
      "contract_number": "47QTCA22D0036",
      "labor_category": "Associate Consultant",
      "hourly_rate": 221.44,
      "source_sheet_name": "Price List",
      "source_row_number": 3,
      "raw_data": {
        "vendor_name": "SIEMENS GOVERNMENT TECHNOLOGIES INC",
        "unique_catalog_item_id": "001 - Labor",
        "title": "Associate Consultant",
        "description": "Act as part of a Country Professional Services team, work productively with Consultants, Architects, Project Managers, and other internal interfaces to ensure that the customer succeeds in their objectives. Provide support and basic technical expertise for SISW projects throughout the project lifecycle (including implementation/installation, migration, testing, training delivery, deployment, production support) in order for the Siemens PLM Software solution to be delivered successfully and provide value to the customer. Works on projects/assignments of basic scope. Works under general supervision on routine assignment/projects and direct supervision on new assignment/projects. Attends Country Communities of Practice to build understanding of best practices and templates to deliver project tasks.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "221.44",
        "minimum_years_of_education": "0.0",
        "education_and_experience_substitution": "Associate Degree in related discipline or equivalent combination of experience and education",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Consultant",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "years_experience": "Associate Degree in related discipline or equivalent combination of experience and education",
      "security_clearance": "No",
      "contractor_id": 13446,
      "price_list_id": 148
    },
    {
      "contract_number": "47QTCA22D0036",
      "labor_category": "Fellow Solution Architect",
      "hourly_rate": 365.08,
      "source_sheet_name": "Price List",
      "source_row_number": 4,
      "raw_data": {
        "vendor_name": "SIEMENS GOVERNMENT TECHNOLOGIES INC",
        "unique_catalog_item_id": "004 - Labor",
        "title": "Fellow Solution Architect",
        "description": "Act as part of a Professional Services team, work productively with Consultants, Architects, Project Managers, and other internal & external interfaces to ensure that the customer succeeds in their objectives. As an Enterprise Lead Architect resource, responsible for the translation of business requirements into specific process aligned designs for the Siemens PLM Software solution based on multi product/multi industry domain knowledge and best practices, for strategic and complex Enterprise Programs Globally, in order for the Siemens PLM Software to deliver market leading solutions and provide value to the customer. Work with Product Development in the creation of the product roadmap and influence the design of new product functionality and industry solutions. Completely in line with program & project processes and messaging, interact with the customer to support the management of customer expectations and support customer adoption by leveraging the complete Siemens Delivery framework. Provide architectural guidance and advice complex and/ or strategic global Sales/PreSales pursuits and Services projects, through the complexity of solution architecture options and the long term roadmap for the solution. Act as ultimate authority on architectural design to address business problems, and help define and drive their long term PLM roadmap as part of the strategic account plan for the customer and ensuring that the technical integrity of the solution remains aligned to requirements and value delivery throughout project and that the various project solutions will work together to deliver value. Provides direction for process design, process integration and process change activities either internally or at customer sites. Leverage relevant templates in the leadership of project solutions in own specialist area worldwide, and curate best practices and templates, providing mentoring in the creation and adoption of templates and solutions within the SPLM Delivery Framework. Works under self management and will determine solutions, methods and procedures on enterprise assignments/projects globally of highest complexity and diverse scope that require specialist architectural expertise and leadership. Provides guidance and mentoring to other architects within and beyond immediate project or program, on the architecture of multi -domain PLM solutions to other Services Solution Architects and consultants globally. Lead Global Solution Architecture Community of Practice, promoting adoption into the Zones and ensuring that knowledge and lessons learnt are shared across Zone boundaries. May undertake some people management activities for a team as applicable.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "365.08",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "BS/BA in related discipline or equivalent combination of experience and education",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Solution Architect",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "years_experience": "BS/BA in related discipline or equivalent combination of experience and education",
      "security_clearance": "No",
      "contractor_id": 13446,
      "price_list_id": 148
    },
    {
      "contract_number": "47QTCA22D0036",
      "labor_category": "Fellow Technical Architect",
      "hourly_rate": 365.08,
      "source_sheet_name": "Price List",
      "source_row_number": 5,
      "raw_data": {
        "vendor_name": "SIEMENS GOVERNMENT TECHNOLOGIES INC",
        "unique_catalog_item_id": "005 - Labor",
        "title": "Fellow Technical Architect",
        "description": "Act as part of Professional Services team, work productively with other Consultants, Architects, Project Managers, and other internal & external interfaces such as Industry and Product Development teams to ensure that the customer succeeds in their objectives. Responsible for providing strategic, specialist migration / integration expertise and high levels of technical leadership by consulting, advising, recommending migration / integration solutions based on own experience and industry best practices, for complex, strategic projects/programs globally in order for the Siemens PLM Software solution to be delivered successfully and provide value to the customer. Support project/program management activities to control scope, cost, schedule and quality and in line with program & project processes and messaging, interact with the customer to support the management of customer expectations and support customer adoption. Act as the authority on the architectural design elements relating to integration / migration solutions to address business requirements. Provides direction for migration / integration related process design, process integration and process change activities, affecting a combination of multiple systems, including non-Siemens PLM software systems as necessary, either internally or at customer sites. As part of strategic initiatives, work with Product Development in the creation of the product roadmap and influence the design of new product functionality and industry solutions. Works under self-management within project/program and/ or task constraints and will provide input to define solutions, methods and procedures on assignments. Guides and mentors other technical architects globally, on design, configuration and deployment of migrations / integrations for complex multi -domain PLM solutions. Lead the Community of Practice for own area of specialist knowledge, promoting adoption worldwide, drive sharing of knowledge and lessons learnt across Zone boundaries. Drive usage of templates in own specialist area within country/zone, and curate best practices and templates, providing mentoring in the creation and adoption of templates.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "365.08",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "BS/BA in related discipline or equivalent combination of experience and education",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Technical Architect",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "years_experience": "BS/BA in related discipline or equivalent combination of experience and education",
      "security_clearance": "No",
      "contractor_id": 13446,
      "price_list_id": 148
    },
    {
      "contract_number": "47QTCA22D0036",
      "labor_category": "Implementation Consultant",
      "hourly_rate": 260.34,
      "source_sheet_name": "Price List",
      "source_row_number": 6,
      "raw_data": {
        "vendor_name": "SIEMENS GOVERNMENT TECHNOLOGIES INC",
        "unique_catalog_item_id": "006 - Labor",
        "title": "Implementation Consultant",
        "description": "Act as part of a Country Professional Services team, work productively with other Consultants, Architects, Project Managers, and other internal & external interfaces to ensure that the customer succeeds in their objectives. Responsible for the delivery of individual project consulting and technical expertise in Siemens core product portfolio, for SISW projects throughout the project lifecycle (including implementation/installation, configuration, testing, deployment, production support, post production support) in order for the Siemens PLM Software solution to be delivered successfully and provide value to the customer. Under guidance and in line with project processes and messaging, interact with the customer to support the management of customer expectations and support customer adoption. Works on projects/assignments of basic to moderate scope. Works under self management on routine assignment/projects and light supervision on new assignment/projects. Actively participates in Country Communities of Practice, leveraging technical and industry best practices and templates to deliver project tasks, providing experiences to support continual improvement.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "260.34",
        "minimum_years_of_education": "0.0",
        "education_and_experience_substitution": "3-4 months in Siemens certification program",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Implementation Consultant",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "years_experience": "3-4 months in Siemens certification program",
      "security_clearance": "No",
      "contractor_id": 13446,
      "price_list_id": 148
    },
    {
      "contract_number": "47QTCA22D0036",
      "labor_category": "Infrastructure Architect",
      "hourly_rate": 275.3,
      "source_sheet_name": "Price List",
      "source_row_number": 7,
      "raw_data": {
        "vendor_name": "SIEMENS GOVERNMENT TECHNOLOGIES INC",
        "unique_catalog_item_id": "007 - Labor",
        "title": "Infrastructure Architect",
        "description": "Act as part of a Professional Services team, work productively with Consultants, Architects, Project Managers, and other internal & external interfaces to ensure that the customer succeeds in their objectives. As an Infrastructure Architect resource, responsible for the translation of business requirements into specific process aligned infrastructure designs for the Siemens PLM Software solution based best practices in the subject area, in order for the Siemens PLM Software solution to deliver market leading solutions and provide value to the customer. In line with project processes and messaging, interact with the customer to support the management of customer expectations and support customer adoption by leveraging the complete Siemens Delivery framework. Act as infrastructure consultant to strategic Sales/PreSales pursuits and Services projects, providing guidance through the complexity of Infrastructure architecture options and the long term roadmap for the solution. Act as the authority on infrastructure architectural design to address business problems. Provides direction for infrastructure design, sizing, security recommendations, database, Operating system, and network recommendations, system monitoring, and performance optimisation internally or at customer sites. Consults on strategic and/or complex Enterprise projects at country level, of diverse scope that require specialist expertise and high levels of technical leadership. Works under self management within project and/ or task constraints and will determine solutions, methods and procedures on assignments/projects. Leverage relevant templates in the deployment of project solutions in own specialist area, and contribute to best practices and templates.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "275.3",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "BS/BA in related discipline or equivalent combination of experience and education",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Infrastructure Architect",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "years_experience": "BS/BA in related discipline or equivalent combination of experience and education",
      "security_clearance": "No",
      "contractor_id": 13446,
      "price_list_id": 148
    },
    {
      "contract_number": "47QTCA22D0036",
      "labor_category": "Learning Architect",
      "hourly_rate": 299.24,
      "source_sheet_name": "Price List",
      "source_row_number": 8,
      "raw_data": {
        "vendor_name": "SIEMENS GOVERNMENT TECHNOLOGIES INC",
        "unique_catalog_item_id": "008 - Labor",
        "title": "Learning Architect",
        "description": "As part of a zone or country Enterprise Learning and Adoption team, work with Customer key users, internal stakeholders (Program Managers, Solution and Product Architects) and partners to ensure the customers experience a seamless interaction with Siemens Services and succeed in their objectives of rapid value realization and increased process productivity. Actively contributes to the design and execution of Enterprise Learning and Adoption programs in agreed DF PL domains that enable customers to minimize user adoption risks and to achieve superior adoption of the Digital Enterprise solution. Applies Adult Learning strategies and Siemens Learning and Adoption best practices to address the needs of customers user communities. Applies project management methods and skills to ensure customer satisfaction and achievement of Siemens financial targets. In collaboration and alignment with the Program or Project Manager in charge, actively contributes to the Learning and Adoption work stream of customer programs deploying multiple Siemens DF PL products within a single domain (for example: PLM, STS, DER) to multiple locations. Actively participates in and contributes to the global \"Learning\" Community of Practice and contributes to the definition, development and curation of the Siemens Learning and Adoption best practices. Works under self management. Works on projects/assignments of moderate to complex scope.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "299.24",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "BS/BA in related discipline or equivalent combination of experience and education",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Learning Architect",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "years_experience": "BS/BA in related discipline or equivalent combination of experience and education",
      "security_clearance": "No",
      "contractor_id": 13446,
      "price_list_id": 148
    },
    {
      "contract_number": "47QTCA22D0036",
      "labor_category": "Principal Infrastructure Architect",
      "hourly_rate": 339.14,
      "source_sheet_name": "Price List",
      "source_row_number": 9,
      "raw_data": {
        "vendor_name": "SIEMENS GOVERNMENT TECHNOLOGIES INC",
        "unique_catalog_item_id": "011 - Labor",
        "title": "Principal Infrastructure Architect",
        "description": "Act as part of a Professional Services team, work productively with Consultants, Architects, Project Managers, and other internal & external interfaces to ensure that the customer succeeds in their objectives. As a Lead Infrastructure Architect resource, responsible for the translation of business requirements into specific process aligned infrastructure designs for the Siemens PLM Software solution based best practices in the subject area applied to Enterprise Programs across Zone, in order for the Siemens PLM Software solution to deliver market leading solutions and provide value to the customer. Work with Product Development in the creation of the product roadmap and influence the design of new product functionality and industry solutions. In line with project processes and messaging, interact with the customer to support the management of customer expectations and support customer adoption by leveraging the complete Siemens Delivery framework. Act as infrastructure consultant to strategic Zone Sales/PreSales pursuits and Services projects, providing guidance through the complexity of solution architecture options and the long term roadmap for Infrastructure solution. Act as the senior authority on infrastructure architectural design to address business problems. Provides direction for infrastructure related process design, process integration and process change activities either internally or at customer sites. Consults on strategic and/or complex Enterprise Programs across Zone, of diverse scope that require specialist expertise and high levels of technical leadership. May act as Lead Infrastructure Architect for specific Global programs. Works under self management within project and/ or task constraints and will determine solutions, methods and procedures on assignments/projects. Provides guidance and mentoring to other architects within immediate project or program, on the architecture of multi -domain PLM solutions to other Services Solution Architects and consultants. Participate in Zone/Global Infrastructure Architecture Community of Practice, promoting adoption into the Zones and ensuring that knowledge and lessons learnt are shared across Zone boundaries. Leverage relevant templates in the leadership of project solutions in own specialist area, and curate best practices and templates, providing mentoring in the creation and adoption of templates and solutions within the SPLM Delivery Framework.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "339.14",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "Bachelors Degree or equivalent years of related experience and training from Siemens or industry certifications.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Principal Infrastructure Architect",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "years_experience": "Bachelors Degree or equivalent years of related experience and training from Siemens or industry certifications.",
      "security_clearance": "No",
      "contractor_id": 13446,
      "price_list_id": 148
    },
    {
      "contract_number": "47QTCA22D0036",
      "labor_category": "Principal Product Architect",
      "hourly_rate": 299.24,
      "source_sheet_name": "Price List",
      "source_row_number": 10,
      "raw_data": {
        "vendor_name": "SIEMENS GOVERNMENT TECHNOLOGIES INC",
        "unique_catalog_item_id": "012 - Labor",
        "title": "Principal Product Architect",
        "description": "Act as part of a Professional Services team, work productively with Consultants, Solution Architects, Project Managers, and other internal & external interfaces such as Industry and Product Development teams to ensure that the customer succeeds in their objectives. Responsible for providing specialist product expertise by consulting, advising, recommending, designing, and where appropriate deploying, specific technical solutions in own area of specialism for standard projects in Country/Zone, in order for the Siemens PLM Software solution to be delivered successfully and provide value to the customer. Support project/program management activities to control scope, cost, schedule and quality and in line with program & project processes and messaging, interact with the customer to support the management of customer expectations and support customer adoption. Act as trusted advisor to the customer on the long term roadmap and architectural design elements relating to solutions in own area of product specialism, to address business requirements. May act as project technical work stream lead for specific project work streams on large programs/projects requiring a full time specialist resource, supporting project management activities such as estimating, work package breakdown and project planning and monitoring, where required. As part of complex projects/programs, work with Product Development in the creation of the product roadmap and influence the design of new product functionality and industry solutions in own area of product specialisation. In line with project & program processes and messaging, interact with the customer to support the management of customer expectations and support customer adoption. Works under self-management within projects of moderate to complex scope and/ or task constraints and will provide input to define solutions, methods and procedures on assignments. Provides guidance and mentoring on the design, configuration and deployment of complex technical solutions to other Implementation Consultants and Product Architects for own area of specialism. Acts as leading member of Zone Community of Practice for own area of specialist knowledge, promoting adoption within the Zone and ensuring that knowledge and lessons learnt are shared across country/organization boundaries. Lead the definition and maintenance of best practices and curates templates in own area of specialism, providing experiences to support continual improvement.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "299.24",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "Bachelors Degree or equivalent years of related experience and training from Siemens or industry certifications.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Principal Product Architect",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "years_experience": "Bachelors Degree or equivalent years of related experience and training from Siemens or industry certifications.",
      "security_clearance": "No",
      "contractor_id": 13446,
      "price_list_id": 148
    },
    {
      "contract_number": "47QTCA22D0036",
      "labor_category": "Principal Solution Architect",
      "hourly_rate": 339.14,
      "source_sheet_name": "Price List",
      "source_row_number": 11,
      "raw_data": {
        "vendor_name": "SIEMENS GOVERNMENT TECHNOLOGIES INC",
        "unique_catalog_item_id": "013 - Labor",
        "title": "Principal Solution Architect",
        "description": "Act as part of a Professional Services team, work productively with Consultants, Architects, Project Managers, and other internal & external interfaces to ensure that the customer succeeds in their objectives. As a Lead Architect resource, responsible for the translation of business requirements into specific process aligned designs for the Siemens PLM Software solution based on multi product/multi industry domain knowledge and best practices in the subject area applied to complex projects and programs across Zone, in order for the Siemens PLM Software solution to deliver market leading solutions and provide value to the customer. Provide feedback to Product Development on customer requirements to input into the creation of the product roadmap and influence the design of new product functionality and industry solutions. Completely in line with program & project processes and messaging, interact with the customer to support the management of customer expectations and support customer adoption by leveraging the complete Siemens Delivery framework. Provide architectural guidance and advice complex and/ or strategic Sales/PreSales pursuits and Services projects, through the complexity of solution architecture options and the long term roadmap for the solution. Act as trusted advisor on architectural design to address business problems, recommending best in class solutions that will evolve their business and ensuring that the technical integrity of the solution remains aligned to requirements and value delivery throughout project and that the various project solutions will work together to deliver value. Provides direction for process design, process integration and process change activities either internally or at customer sites. Leverage relevant templates in the leadership of project solutions in own specialist area, and curate best practices and templates, providing mentoring in the creation and adoption of templates and solutions within the SPLM Delivery Framework. Works under self management and will determine solutions, methods and procedures on assignments/projects across Zone of moderate to high complexity and diverse scope that require specialist architectural expertise and leadership. Provides guidance and mentoring to other architects within and beyond immediate project or program, on the architecture of multi -domain PLM solutions to other Services Solution Architects and consultants globally. Participate in, and where appropriate lead, the Zone Solution Architecture Community of Practice, promoting adoption across the Zone and ensuring that knowledge and lessons learnt are shared across Country boundaries.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "339.14",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "Bachelors Degree or equivalent years of related experience and training from Siemens or industry certifications.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Principal Solution Architect",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "years_experience": "Bachelors Degree or equivalent years of related experience and training from Siemens or industry certifications.",
      "security_clearance": "No",
      "contractor_id": 13446,
      "price_list_id": 148
    },
    {
      "contract_number": "47QTCA22D0036",
      "labor_category": "Principal Technical Architect",
      "hourly_rate": 339.14,
      "source_sheet_name": "Price List",
      "source_row_number": 12,
      "raw_data": {
        "vendor_name": "SIEMENS GOVERNMENT TECHNOLOGIES INC",
        "unique_catalog_item_id": "014 - Labor",
        "title": "Principal Technical Architect",
        "description": "Act as part of Professional Services team, work productively with other Consultants, Architects, Project Managers, and other internal & external interfaces such as Industry and Product Development teams to ensure that the customer succeeds in their objectives. Responsible for providing specialist migration / integration expertise and technical leadership by consulting, advising, recommending migration / integration solutions based on own experience and industry best practices, for complex projects/programs within country/vertical/zone in order for the Siemens PLM Software solution to be delivered successfully and provide value to the customer. Support project/program management activities to control scope, cost, schedule and quality and in line with program & project processes and messaging, interact with the customer to support the management of customer expectations and support customer adoption. Leads the architectural design elements relating to complex integration / migration solutions to address business requirements. Provides direction for migration / integration related process design, process integration and process change activities, affecting a combination of multiple systems, including non-Siemens PLM software systems as necessary, either internally or at customer sites. As part of complex projects/programs, work with Product Development in the creation of the product roadmap and influence the design of new product functionality and industry solutions. Works under self-management within project/program and/ or task constraints and will provide input to define solutions, methods and procedures on assignments. Guides and mentors other technical architects within a Country/Zone, on design, configuration and deployment of migrations / integrations for complex multi -domain PLM solutions. Lead the Community of Practice for own area of specialist knowledge, promoting adoption across the Zone, by sharing of knowledge and lessons learnt across Country/Vertical boundaries. Drive usage of templates in own specialist area within country/zone, and curate best practices and templates, providing mentoring in the creation and adoption of templates.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "339.14",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "Bachelors Degree or equivalent years of related experience and training from Siemens or industry certifications.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Principal Technical Architect",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "years_experience": "Bachelors Degree or equivalent years of related experience and training from Siemens or industry certifications.",
      "security_clearance": "No",
      "contractor_id": 13446,
      "price_list_id": 148
    },
    {
      "contract_number": "47QTCA22D0036",
      "labor_category": "Product Architect",
      "hourly_rate": 275.3,
      "source_sheet_name": "Price List",
      "source_row_number": 13,
      "raw_data": {
        "vendor_name": "SIEMENS GOVERNMENT TECHNOLOGIES INC",
        "unique_catalog_item_id": "015 - Labor",
        "title": "Product Architect",
        "description": "Act as part of a Professional Services team, work productively with Consultants, Solution Architects, Project Managers, and other internal & external interfaces such as Industry and Product Development teams to ensure that the customer succeeds in their objectives. Responsible for providing specialist product expertise by consulting, advising, recommending, designing, and where appropriate deploying, specific technical solutions in own area of specialism for standard projects in Country, leveraging relevant best practices and templates, in order for the Siemens PLM Software solution to be delivered successfully and provide value to the customer. Support project/program management activities to control scope, cost, schedule and quality and in line with program & project processes and messaging, interact with the customer to support the management of customer expectations and support customer adoption. Leads the architectural design elements in own area of specialist product domain solutions to address business requirements. May act as project technical work stream lead for specific project work streams on small to medium projects requiring a full time specialist resource, supporting project management activities such as estimating, work package breakdown and project planning and monitoring. Provide input to Product Development in the creation of the product roadmap and influence the design of new product functionality and industry solutions in own area of product specialisation. In line with project processes and messaging, interact with the customer to support the management of customer expectations and support customer adoption. Works under self-management within projects of basic to moderate scope and/ or task constraints and will provide input to define solutions, methods and procedures on assignments. Provides guidance and mentoring on the design, configuration, configuration and deployment of standard technical solutions to Implementation Consultants and Associate Consultant for own area of specialism. Actively participate in Country Communities of Practice, in own area of specialist knowledge, and contribute to the definition of new, and maintenance of existing, best practices and templates, providing experiences to support continual improvement. Contributes to the definition and maintenance of best practices and curates templates in own area of specialism, providing experiences to support continual improvement.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "275.3",
        "minimum_education": "Associates",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "Bachelors Degree or equivalent years of related experience and training from Siemens or industry certifications.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Product Architect",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Associates",
      "years_experience": "Bachelors Degree or equivalent years of related experience and training from Siemens or industry certifications.",
      "security_clearance": "No",
      "contractor_id": 13446,
      "price_list_id": 148
    },
    {
      "contract_number": "47QTCA22D0036",
      "labor_category": "Services Associate Project Manager",
      "hourly_rate": 260.34,
      "source_sheet_name": "Price List",
      "source_row_number": 14,
      "raw_data": {
        "vendor_name": "SIEMENS GOVERNMENT TECHNOLOGIES INC",
        "unique_catalog_item_id": "018 - Labor",
        "title": "Services Associate Project Manager",
        "description": "As part of a country / vertical or region Services organization, coordinates one services project driving customer's value realization. Execute the project within the defined targeted outcomes, such as financial, schedule, scope and quality, while ensuring customer satisfaction. Act as key point of contact for Sales, Presales, Engagement Managers, Services Management and the customer for the project. Works under light supervision to co-ordinate projects of low size and low complexity that could be part of a program.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "260.34",
        "minimum_years_of_education": "0.0",
        "education_and_experience_substitution": "Two-year AA Degree or equivalent years of related experience and training from Siemens or industry certifications.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Project Manager,Engineer",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "years_experience": "Two-year AA Degree or equivalent years of related experience and training from Siemens or industry certifications.",
      "security_clearance": "No",
      "contractor_id": 13446,
      "price_list_id": 148
    },
    {
      "contract_number": "47QTCA22D0036",
      "labor_category": "Services Program Manager",
      "hourly_rate": 339.14,
      "source_sheet_name": "Price List",
      "source_row_number": 15,
      "raw_data": {
        "vendor_name": "SIEMENS GOVERNMENT TECHNOLOGIES INC",
        "unique_catalog_item_id": "019 - Labor",
        "title": "Services Program Manager",
        "description": "As part of a country /vertical, region or zone Services organization, leads a services program consisting of related services projects or leads multiple unrelated services projects driving customer's value realization and business outcomes. Lead and manage the set up of the program through to delivery of the new capabilities and realization of value. Manage the dependencies between projects, establish and publish clear priorities among projects and program activities, coordinate the projects effectively and establish the required program governance model. Act as the primary point of contact for the program and aligns Sales, Presales, Engagement Management, Services Management and the customer for the program, including across countries. Works under self management to manage programs or medium to high size and complexity, that span across several countries within the Zone. Mentors Project Managers and other key program team members.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "339.14",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "Bachelors Degree or equivalent years of related experience and training from Siemens or industry certifications.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Services Program Manager",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "years_experience": "Bachelors Degree or equivalent years of related experience and training from Siemens or industry certifications.",
      "security_clearance": "No",
      "contractor_id": 13446,
      "price_list_id": 148
    },
    {
      "contract_number": "47QTCA22D0036",
      "labor_category": "Services Project Manager",
      "hourly_rate": 299.24,
      "source_sheet_name": "Price List",
      "source_row_number": 16,
      "raw_data": {
        "vendor_name": "SIEMENS GOVERNMENT TECHNOLOGIES INC",
        "unique_catalog_item_id": "020 - Labor",
        "title": "Services Project Manager",
        "description": "As part of a country / vertical or region Services organization, manages one services project or several unrelated services projects driving customers value realization. Execute the project(s) within the defined targeted outcomes, such as financial, schedule, scope and quality, while ensuring customer satisfaction. Act as key point of contact for Sales, Presales, Engagement Managers, Services Management and the customer for the project. Works under self management to manage projects of medium to high size and complexity that could be part of a program. May mentor key project team members.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "299.24",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "Bachelors Degree or equivalent years of related experience and training from Siemens or industry certifications.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Project Manager,Engineer",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "years_experience": "Bachelors Degree or equivalent years of related experience and training from Siemens or industry certifications.",
      "security_clearance": "No",
      "contractor_id": 13446,
      "price_list_id": 148
    },
    {
      "contract_number": "47QTCA22D0036",
      "labor_category": "Solution Architect",
      "hourly_rate": 299.24,
      "source_sheet_name": "Price List",
      "source_row_number": 17,
      "raw_data": {
        "vendor_name": "SIEMENS GOVERNMENT TECHNOLOGIES INC",
        "unique_catalog_item_id": "023 - Labor",
        "title": "Solution Architect",
        "description": "Act as part of a Professional Services team, work productively with Consultants, Architects, Project Managers, and other internal & external interfaces to ensure that the customer succeeds in their objectives. As an Architect resource, responsible for the translation of business requirements into specific process aligned designs for the Siemens PLM Software solution based on multi product/multi industry domain knowledge and best practices in the subject area, applied to standard projects, in order for the Siemens PLM Software solution to deliver market leading solutions and provide value to the customer. In line with project processes and messaging, interact with the customer to support the management of customer expectations and support customer adoption by leveraging the complete Siemens Delivery framework. Provide architectural guidance and advice to Sales/PreSales pursuits and Services projects, through the complexity of solution architecture options and the long term roadmap for the solution. Act as trusted advisor on architectural design to address business problems ensuring that the technical integrity of the solution remains aligned to requirements and value delivery throughout project and that the various project solutions will work together to deliver value. Provides direction for process design, process integration and process change activities either internally or at customer sites. Leverage relevant templates in the leadership of project solutions in own specialist area, and curate best practices and templates. Works under self management and will determine solutions, methods and procedures on assignments/projects at a country level, of basic to moderate complexity and diverse scope that require specialist architectural expertise and leadership. Participate in Zone Solution Architecture Community of Practice, promoting adoption within projects and country, and ensuring that knowledge and lessons learnt are shared across project/program boundaries.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "299.24",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "BS/BA in related discipline or equivalent combination of experience and education",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Solution Architect",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "years_experience": "BS/BA in related discipline or equivalent combination of experience and education",
      "security_clearance": "No",
      "contractor_id": 13446,
      "price_list_id": 148
    },
    {
      "contract_number": "47QTCA22D0036",
      "labor_category": "Technical Architect",
      "hourly_rate": 299.24,
      "source_sheet_name": "Price List",
      "source_row_number": 18,
      "raw_data": {
        "vendor_name": "SIEMENS GOVERNMENT TECHNOLOGIES INC",
        "unique_catalog_item_id": "027 - Labor",
        "title": "Technical Architect",
        "description": "Act as part of Professional Services team, work productively with other Consultants, Architects, Project Managers, and other internal & external interfaces such as Industry and Product Development teams to ensure that the customer succeeds in their objectives. Responsible for providing specialist migration / integration expertise by consulting, advising, recommending migration / integration solutions based on own experience and industry best practices, for projects/programs within country/vertical in order for the Siemens PLM Software solution to be delivered successfully and provide value to the customer. Support project/program management activities to control scope, cost, schedule and quality and in line with program & project processes and messaging, interact with the customer to support the management of customer expectations and support customer adoption. Leads the architectural design elements relating to integration / migration solutions to address business requirements. Provides input for migration / integration related process design, process integration and process change activities affecting a combination of multiple systems, including non-Siemens PLM software systems as necessary, either internally or at customer sites. Provide input to Product Development in the creation of the product roadmap and influence the design of new product functionality and industry solutions.Works under self-management within project/program and/ or task constraints and will provide input to define solutions, methods and procedures on assignments. Guides and advises other architects and consultants within projects / programs, on design, configuration and deployment of migration / integration solutions. Contribute to Community of Practice for own area of specialist knowledge, promoting adoption within country by sharing of knowledge and lessons learnt within Country. Adopt usage of templates in own specialist area within country, and provide input to best practices and templates.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "299.24",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "Bachelors Degree or equivalent years of related experience and training from Siemens or industry certifications.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Technical Architect",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "years_experience": "Bachelors Degree or equivalent years of related experience and training from Siemens or industry certifications.",
      "security_clearance": "No",
      "contractor_id": 13446,
      "price_list_id": 148
    },
    {
      "contract_number": "47QTCA22D0036",
      "labor_category": "Technical Consultant",
      "hourly_rate": 260.34,
      "source_sheet_name": "Price List",
      "source_row_number": 19,
      "raw_data": {
        "vendor_name": "SIEMENS GOVERNMENT TECHNOLOGIES INC",
        "unique_catalog_item_id": "028 - Labor",
        "title": "Technical Consultant",
        "description": "Act as part of a Country Professional Services team, work productively with other Consultants, Architects, Project Managers, and other internal & external interfaces to ensure that the customer succeeds in their objectives. Responsible for the delivery of individual project consulting and technical expertise in systems infrastructure, integrations and data migration for SISW projects throughout the project lifecycle (including infrastructure/ performance/ migration and/or integration/testing/deployment/production support/post production support) in order for the Siemens PLM Software solution to be delivered successfully and provide value to the customer. Under guidance and in line with project processes and messaging, interact with the customer to support the management of customer expectations and support customer adoption. Works on projects/assignments of basic to moderate scope. Works under self management on routine assignment/projects and light supervision on new assignment/projects. Actively participates in Country Communities of Practice, leveraging technical and industry best practices and templates to deliver project tasks, providing experiences to support continual improvement.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "260.34",
        "minimum_years_of_education": "0.0",
        "education_and_experience_substitution": "3-4 months in Siemens certification program",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Engineer",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "years_experience": "3-4 months in Siemens certification program",
      "security_clearance": "No",
      "contractor_id": 13446,
      "price_list_id": 148
    }
  ],
  "parsed_at": "2025-11-06T11:47:44.102252"
}