{
  "contract_number": "47QTCA23D005T",
  "contractor_id": 9777,
  "price_list_id": 932,
  "labor_categories": [
    {
      "contract_number": "47QTCA23D005T",
      "labor_category": "Jr. Microsoft Application Developer",
      "hourly_rate": 103.53,
      "source_sheet_name": "Price List",
      "source_row_number": 3,
      "raw_data": {
        "vendor_name": "PEOPLE SERVICES CENTER INC",
        "unique_catalog_item_id": "101.0",
        "title": "Jr. Microsoft Application Developer",
        "description": "The Junior Microsoft Application Developer assists in the development of flexible application systems and software that meet the objectives and client requirements.  Help develop, upgrade, and maintain systems that draw upon the latest technology in order for our clients to take advantage of industry advances toward practical solutions.  Provide technical support, as requested.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "103.53",
        "gsa_price_with_iff__c_": "103.53",
        "gsa_price_with_iff__d_": "107.67",
        "gsa_price_with_iff__e_": "111.98",
        "minimum_education": "Associates",
        "minimum_years_of_education": "2.0",
        "education_and_experience_substitution": "none",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "application,developer,development,software,systems",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Associates",
      "years_experience": "none",
      "security_clearance": "No",
      "contractor_id": 9777,
      "price_list_id": 932
    },
    {
      "contract_number": "47QTCA23D005T",
      "labor_category": "Microsoft Application Developer",
      "hourly_rate": 136.21,
      "source_sheet_name": "Price List",
      "source_row_number": 4,
      "raw_data": {
        "vendor_name": "PEOPLE SERVICES CENTER INC",
        "unique_catalog_item_id": "102.0",
        "title": "Microsoft Application Developer",
        "description": "The Microsoft Application Developer assists in the development of flexible application systems that meet the objectives and client requirements.  Help develop, upgrade, and maintain systems that draw upon the latest technology in order for our clients to take advantage of industry advances toward practical solutions.  Provide technical support, as requested.  Develop applications utilizing industry standards and best practices for .NET applications.  Provide systems analysis and design activities that meet defined client requirements.  Provide .NET mentoring to client teams where necessary.  Develop functional capabilities that satisfy client needs and requirements.  Develop detailed specifications from conceptual specifications as requested by clients.  Conduct high-level impact analysis, design and estimates based on client requirements.  Develop applications that are easily maintained and upgraded in order to take advantage of technological advances without greater expense for future system modifications.  Design reusable components for use by clients and internal team members.  Responsible for designing, developing, testing, implementing and tuning .NET applications.  Make architecture level design decisions during various phases of a development project.  Provide development direction and guidance to other team members and clients as required.  Function as a team expert on technologies and developed components.  Perform optimization, design, and security code reviews.  Eliminate /automate manual tasks for the internal team and clients.  Research and implement new development technologies and strategies.  Provide technical guidance to project managers and business users as required.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "136.21",
        "gsa_price_with_iff__c_": "136.21",
        "gsa_price_with_iff__d_": "141.66",
        "gsa_price_with_iff__e_": "147.33",
        "minimum_education": "Associates",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "none",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "application,developer,development,software,systems",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Associates",
      "years_experience": "none",
      "security_clearance": "No",
      "contractor_id": 9777,
      "price_list_id": 932
    },
    {
      "contract_number": "47QTCA23D005T",
      "labor_category": "Senior Microsoft Application Developer",
      "hourly_rate": 158.03,
      "source_sheet_name": "Price List",
      "source_row_number": 5,
      "raw_data": {
        "vendor_name": "PEOPLE SERVICES CENTER INC",
        "unique_catalog_item_id": "103.0",
        "title": "Senior Microsoft Application Developer",
        "description": "The Senior Microsoft Application Developer assists in the development of flexible application systems that meets the objectives and client requirements.  Help develop, upgrade, and maintain systems that draw upon the latest technology in order for our clients to take advantage of industry advances toward practical solutions.  Provide technical support, as requested.  Develop applications utilizing industry standards and best practices for .NET applications.  Provide systems analysis and design activities that meet defined client requirements and .NET mentoring to client teams where necessary.  Develop functional capabilities that satisfy client needs and requirements.  Develop detailed specifications from conceptual specifications as requested by clients.  Conduct high-level impact analysis, design and estimates based on client requirements.  Develop applications that are easily maintained and upgraded in order to take advantage of technological advances without greater expense for future system modifications.  Actively involved in the Solution Development portion of client engagements, including pre-sales support.  Design reusable components for use by clients and internal team members.  Responsible for designing, developing, testing, implementing and tuning .NET applications.  Make architecture level design decisions during various phases of a development project.  Provide development direction and guidance to other team members and clients, as required.  Willingness and capability to provide Microsoft certified training courses as dictated by needs of the organization.  Function as a subject matter expert on technologies and developed components.  Perform optimization, design, and security code reviews.  Eliminate /automate manual tasks for the internal team and clients.  Research and implement new development technologies and strategies.  Provide technical guidance to project managers and business users.  Knowledge of common vulnerabilities – XSS, XSRF, click fraud, SQL injection.  Good interpersonal and communication skills (written and oral).  Demonstrated problem-solving skills, and the ability to analyze, design, program, support, and implement information systems.  Self-starter, results oriented, able to execute multiple projects simultaneously, and work in a team environment as well as independently.  Supportive of a project management methodology and experience effectively using the methodology.  Experience writing technical specifications and driving them through completion.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "158.03",
        "gsa_price_with_iff__c_": "158.03",
        "gsa_price_with_iff__d_": "164.35",
        "gsa_price_with_iff__e_": "170.92",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "none",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "application,developer,development,software,systems",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "none",
      "security_clearance": "No",
      "contractor_id": 9777,
      "price_list_id": 932
    },
    {
      "contract_number": "47QTCA23D005T",
      "labor_category": "Jr. Quality Assurance",
      "hourly_rate": 94.54,
      "source_sheet_name": "Price List",
      "source_row_number": 6,
      "raw_data": {
        "vendor_name": "PEOPLE SERVICES CENTER INC",
        "unique_catalog_item_id": "104.0",
        "title": "Jr. Quality Assurance",
        "description": "Our Jr. QA specialist works under limited supervision to monitor software quality and the technical risks associated with the software development lifecycle.  Along with these responsibilities, QAs need to analyze technical risk for new software products, document functional tests, perform complex testing assignments, assist with design factors, and investigate operational problems with other technical team members.  Perform quality assurance efforts on multiple application releases, monitor and document testing activities.  Self-motivated and the ability to work independently on a small team.  Excellent verbal and written communication skills.  Manage testing for application deployments and assign testing activities to team.  Design, develop and maintain test cases and strategies for cross-browser testing and multiple user scenarios.  Satisfy release deliverables, project testing requirements and other quality assurance responsibilities.  Collaborate with team to understand product changes and QA testing requirements to deal with issues/defects in a timely manner.  Establish a testing feedback loop with other developers and team members.  Create written documentation and procedures for application testing and compliance.  Debug test environment, automate sprints, and develop testing scenarios.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "94.54",
        "gsa_price_with_iff__c_": "94.54",
        "gsa_price_with_iff__d_": "98.32",
        "gsa_price_with_iff__e_": "102.25",
        "minimum_education": "Associates",
        "minimum_years_of_education": "2.0",
        "education_and_experience_substitution": "none",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "software,quality,assurance,test,application",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Associates",
      "years_experience": "none",
      "security_clearance": "No",
      "contractor_id": 9777,
      "price_list_id": 932
    },
    {
      "contract_number": "47QTCA23D005T",
      "labor_category": "Quality Assurance",
      "hourly_rate": 147.12,
      "source_sheet_name": "Price List",
      "source_row_number": 7,
      "raw_data": {
        "vendor_name": "PEOPLE SERVICES CENTER INC",
        "unique_catalog_item_id": "105.0",
        "title": "Quality Assurance",
        "description": "Our QA specialist works under limited supervision to monitor software quality and the technical risks associated with the software development lifecycle.  Along with these responsibilities, QAs analyze technical risk for new software products, document functional tests, perform complex testing assignments, assist with design factors, and investigate operational problems with other technical team members.  Perform quality assurance efforts on multiple application releases, monitor and document testing activities.  Self-motivated and the ability to work independently on a small team.  Excellent verbal and written communication skills.  Manage testing for application deployments and assign testing activities to team.  Design, develop and maintain test cases and strategies for cross-browser testing and multiple user scenarios.  Satisfy release deliverables, project testing requirements and other quality assurance responsibilities.  Collaborate with team to understand product changes and QA testing requirements to deal with issues/defects in a timely manner.  Establish a testing feedback loop with other developers and team members.  Create written documentation and procedures for application testing and compliance.  Debug test environment, automate sprints, and develop testing scenarios.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "147.12",
        "gsa_price_with_iff__c_": "147.12",
        "gsa_price_with_iff__d_": "153",
        "gsa_price_with_iff__e_": "159.12",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "none",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "software,quality,assurance,test,application",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "none",
      "security_clearance": "No",
      "contractor_id": 9777,
      "price_list_id": 932
    },
    {
      "contract_number": "47QTCA23D005T",
      "labor_category": "Jr. BI Developer",
      "hourly_rate": 119.87,
      "source_sheet_name": "Price List",
      "source_row_number": 8,
      "raw_data": {
        "vendor_name": "PEOPLE SERVICES CENTER INC",
        "unique_catalog_item_id": "106.0",
        "title": "Jr. BI Developer",
        "description": "The Jr. BI Developer is responsible for building, implementing, and supporting BI solutions.  The Jr. BI Developer will work in all stages of BI project work (requirements and logical design, physical design, implementation, testing and deployment).  The Jr. BI Developer utilizes BI implementation methodologies to collect data from multiple disparate sources and consolidates into data marts and data warehouses, as well as enables users across the organization to complete self-service reporting and analytics by developing the necessary solutions.  The BI Developer also communicates with the appropriate teams to ensure that assignments are delivered with the highest of quality and in accordance to standards.  Responsibilities include translating business needs to technical specifications; dashboards, alerts; creating tools to store data (e.g., OLAP cubes); maintaining and supporting data analytics platforms; evaluating and improving existing BI systems; collaborating with teams to integrate systems; developing and executing database queries and conduct analyses; and developing and updating technical documentation.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "119.87",
        "gsa_price_with_iff__c_": "119.87",
        "gsa_price_with_iff__d_": "124.66",
        "gsa_price_with_iff__e_": "129.65",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "2.0",
        "education_and_experience_substitution": "none",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "business,intelligence,developer,data,database",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "none",
      "security_clearance": "No",
      "contractor_id": 9777,
      "price_list_id": 932
    },
    {
      "contract_number": "47QTCA23D005T",
      "labor_category": "BI Developer",
      "hourly_rate": 156.93,
      "source_sheet_name": "Price List",
      "source_row_number": 9,
      "raw_data": {
        "vendor_name": "PEOPLE SERVICES CENTER INC",
        "unique_catalog_item_id": "107.0",
        "title": "BI Developer",
        "description": "The BI Developer is responsible for building, implementing, and supporting BI solutions.  The BI Developer will work in all stages of BI project work (requirements and logical design, physical design, implementation, testing and deployment).  The BI Developer utilizes BI implementation methodologies to collect data from multiple disparate sources and consolidates into data marts and data warehouses, as well as enables users across the organization to complete self-service reporting and analytics by developing the necessary solutions.  The BI Developer also communicates with the appropriate teams to ensure that assignments are delivered with the highest of quality and in accordance to standards.  Responsibilities include translating business needs to technical specifications; dashboards, alerts; creating tools to store data (e.g., OLAP cubes); maintaining and supporting data analytics platforms; evaluating and improving existing BI systems; collaborating with teams to integrate systems; developing and executing database queries and conduct analyses; and developing and updating technical documentation.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "156.93",
        "gsa_price_with_iff__c_": "156.93",
        "gsa_price_with_iff__d_": "163.21",
        "gsa_price_with_iff__e_": "169.74",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "none",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "business,intelligence,developer,data,database",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "none",
      "security_clearance": "No",
      "contractor_id": 9777,
      "price_list_id": 932
    },
    {
      "contract_number": "47QTCA23D005T",
      "labor_category": "Intermediate Report Developer",
      "hourly_rate": 136.21,
      "source_sheet_name": "Price List",
      "source_row_number": 10,
      "raw_data": {
        "vendor_name": "PEOPLE SERVICES CENTER INC",
        "unique_catalog_item_id": "108.0",
        "title": "Intermediate Report Developer",
        "description": "Intermediate Report Developers compile data into reports using department and company goals as a filter for processing relevant data.  The report developer works closely with client representatives to determine requirements for reports.  The objective is to ensure that all staff have access to relevant information that they need in their daily tasks.  Once requirements are understood, the reports are developed, in a manner that is easily accessible and that users can adjust in order to specify the needed data.  Configuration of the reports to connect with databases of information and present the relevant information needed for specific, identified purposes in order to be useful is performed.  This may include multiple systems to collect data from multiple sources, allowing staff the access to all relevant information.  Testing of reports is crucial before delivery to the client.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "136.21",
        "gsa_price_with_iff__c_": "136.21",
        "gsa_price_with_iff__d_": "141.66",
        "gsa_price_with_iff__e_": "147.33",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "2.0",
        "education_and_experience_substitution": "none",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "report,developer,data,database,filter",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "none",
      "security_clearance": "No",
      "contractor_id": 9777,
      "price_list_id": 932
    },
    {
      "contract_number": "47QTCA23D005T",
      "labor_category": "Report Developer",
      "hourly_rate": 156.93,
      "source_sheet_name": "Price List",
      "source_row_number": 11,
      "raw_data": {
        "vendor_name": "PEOPLE SERVICES CENTER INC",
        "unique_catalog_item_id": "109.0",
        "title": "Report Developer",
        "description": "Report Developers compile data into reports using department and company goals as a filter for processing relevant data.  The report developer works closely with client representatives to determine requirements for reports.  The objective is to ensure that all staff have access to relevant information that they need in their daily tasks.  Once requirements are understood, the reports are developed, in a manner that is easily accessible and that users can adjust in order to specify the needed data.  Configuration of the reports to connect with databases of information and present the relevant information needed for specific, identified purposes in order to be useful is performed.    may include multiple systems to collect data from multiple sources, allowing staff the access to all relevant information.  Testing of reports is crucial before delivery to the client.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "156.93",
        "gsa_price_with_iff__c_": "156.93",
        "gsa_price_with_iff__d_": "163.21",
        "gsa_price_with_iff__e_": "169.74",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "none",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "report,developer,data,database,filter",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "none",
      "security_clearance": "No",
      "contractor_id": 9777,
      "price_list_id": 932
    },
    {
      "contract_number": "47QTCA23D005T",
      "labor_category": "Senior Report Developer",
      "hourly_rate": 158.03,
      "source_sheet_name": "Price List",
      "source_row_number": 12,
      "raw_data": {
        "vendor_name": "PEOPLE SERVICES CENTER INC",
        "unique_catalog_item_id": "110.0",
        "title": "Senior Report Developer",
        "description": "Senior Report Developers compile data into reports using department and company goals as a filter for processing relevant data.  They work closely with client representatives to determine requirements for reports.  The objective is to ensure that all staff have access to relevant information that they need in their daily tasks.  Once requirements are understood, the reports are developed in a manner that is easily accessible and that users can adjust in order to specify the needed data.  Configuration of the reports to connect with databases of information and present the relevant information needed for specific, identified purposes in order to be useful is performed.  This may include multiple systems to collect data from multiple sources, allowing staff the access to all relevant information.  Testing of reports is crucial before delivery to the client.  As a Senior Report Developer, mentoring and teaching is expected, as is developing of more complex reports.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "158.03",
        "gsa_price_with_iff__c_": "158.03",
        "gsa_price_with_iff__d_": "164.35",
        "gsa_price_with_iff__e_": "170.92",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "none",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "report,developer,data,database,filter",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "none",
      "security_clearance": "No",
      "contractor_id": 9777,
      "price_list_id": 932
    },
    {
      "contract_number": "47QTCA23D005T",
      "labor_category": "Jr. ETL Developer",
      "hourly_rate": 123.45,
      "source_sheet_name": "Price List",
      "source_row_number": 13,
      "raw_data": {
        "vendor_name": "PEOPLE SERVICES CENTER INC",
        "unique_catalog_item_id": "111.0",
        "title": "Jr. ETL Developer",
        "description": "The Jr. ETL Developer will be responsible for writing integrations, pipelines, or ETL jobs to move data between source and target tables and databases based upon requirements.  This is a position that includes gathering business requirements and working with data modelers of the ODS and Data Marts and coordinating with source system administrators.  Design and develop data movements using Data Movement tools, ETL tools, SQL, or Stored Procedures.  Consult with the business to determine logical design for new business solutions.  Follow data standards, resolve data issues, complete unit testing and system documentation for ETL processes.  Collaborate with business analysts, subject matter experts, and other team members to determine data extraction and transformation requirements.  Develops strategies for warehouse implementation, data acquisition, and archive recovery related to optimizing ETL load performance. Develops, debugs, monitors, and troubleshoots ETL solutions. Perform and execute data extraction, transformation, and loading using ETL tools.  Collaborate with IT operations and testing organizations to ensure timely releases of projects and make sure database environments are sustainable.  Collaborate with IT operations to perform root cause analysis.  Support IT staff and business users in the development, usage and troubleshooting of database-driven applications.  Support the development of software programs.  Use customer requirements to improve functionality (speed, performance / usability).  Conduct system tests, troubleshoot customer issues, and correct database defects.  Respond quickly to bug fixes and enhancement requests.  Support maintenance of local databases.  Participate in special projects as needed and performs other duties as assigned.  Work in a team environment, on multiple assignments concurrently under aggressive deadlines.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "123.45",
        "gsa_price_with_iff__c_": "123.45",
        "gsa_price_with_iff__d_": "128.39",
        "gsa_price_with_iff__e_": "133.53",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "2.0",
        "education_and_experience_substitution": "none",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "ETL,database,data,SQL,extract",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "none",
      "security_clearance": "No",
      "contractor_id": 9777,
      "price_list_id": 932
    },
    {
      "contract_number": "47QTCA23D005T",
      "labor_category": "ETL Developer",
      "hourly_rate": 158.03,
      "source_sheet_name": "Price List",
      "source_row_number": 14,
      "raw_data": {
        "vendor_name": "PEOPLE SERVICES CENTER INC",
        "unique_catalog_item_id": "112.0",
        "title": "ETL Developer",
        "description": "The ETL Developer will be responsible for writing ETL jobs to move data between source and target tables and databases based upon requirements.  This is a position that includes gathering business requirements and working with data modelers of the ODS and Data Marts and coordinating with source system administrators.  Design and develop data movements using SQL Server Integration Services, TSQL and Stored Procedures.  Consult with the business to determine logical design for new business solutions.  Follow data standards, resolve data issues, complete unit testing and system documentation for ETL processes.  Collaborate with business analysts, subject matter experts, and other team members to determine data extraction and transformation requirements.  Develops strategies for warehouse implementation, data acquisition, and archive recovery related to optimizing ETL load performance. Develops, debugs, monitors, and troubleshoots ETL solutions. Perform and execute data extraction, transformation, and loading using ETL tools.  Collaborate with IT operations and testing organizations to ensure timely releases of projects and make sure database environments are sustainable.  Collaborate with IT operations to perform root cause analysis.  Support IT staff and business users in the development, usage and troubleshooting of database-driven applications.  Support the development of software programs.  Use customer requirements to improve functionality (speed, performance / usability).  Conduct system tests, troubleshoot customer issues, and correct database defects.  Respond quickly to bug fixes and enhancement requests.  Support maintenance of local databases.  Participate in special projects as needed and performs other duties as assigned.  Work in a team environment, on multiple assignments concurrently under aggressive deadlines.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "158.03",
        "gsa_price_with_iff__c_": "158.03",
        "gsa_price_with_iff__d_": "164.35",
        "gsa_price_with_iff__e_": "170.92",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "none",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "ETL,database,data,SQL,extract",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "none",
      "security_clearance": "No",
      "contractor_id": 9777,
      "price_list_id": 932
    },
    {
      "contract_number": "47QTCA23D005T",
      "labor_category": "Senior ETL Developer/Architect",
      "hourly_rate": 190.72,
      "source_sheet_name": "Price List",
      "source_row_number": 15,
      "raw_data": {
        "vendor_name": "PEOPLE SERVICES CENTER INC",
        "unique_catalog_item_id": "113.0",
        "title": "Senior ETL Developer/Architect",
        "description": "The Senior ETL Developer/Architect will be responsible for driving the overall design and determining the ETL architecture necessary for the delivery team to develop and implement large complex migration programs.  This position will consult with development teams and work closely with vendor partner, developers, data architects, project management, business analysts, and other areas to deliver in line with our strategy, capabilities, and processes.  Implement large-scale data ecosystems including data management, governance, and the integration of structured and unstructured data to generate insights leveraging various platforms.  Leverage automation, cognitive, and science-based techniques to manage data, predict scenarios, and prescribe actions.  Drive operational efficiency by maintaining data ecosystems, sourcing analytics expertise, and providing offerings for continuous insights and improvements.  Design, develop, and support a reference architecture to move data from varying data platforms into the data warehouse solution.  This includes implementing a structure to:  determine traceability and lineage of data through the process, accounting for quantitative and qualitative changes, data leakage, etc.; design and implement standards to modularize the process using high cohesion and low coupling to allow easy restarts anywhere along the process; create a structure to make visible the flow of data and time of packages so the nightly process schedule can be easily understood and modified, along with alerting processes when tolerance boundaries are exceeded; and develop an optimized architecture for job scheduling for data warehouse batch processes.  Perform ETL design, data architecture, data management and data analysis.  Manage the technical delivery of medium to large, complex projects on-time, on-budget, and with targeted zero defects.  Provide planning, estimation, scheduling, prioritization, and coordination of technical activities related to system development.  Ensure system alignment to Enterprise Architecture policies and best practices; ensure that process methodologies are followed in system development.  Manage day-to-day technical challenges and communicate to project manager any risks or issues associated with development.  Identify opportunities for system reuse and system simplification.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "190.72",
        "gsa_price_with_iff__c_": "190.72",
        "gsa_price_with_iff__d_": "198.35",
        "gsa_price_with_iff__e_": "206.28",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "none",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "ETL,database,data,architect,extract",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "none",
      "security_clearance": "No",
      "contractor_id": 9777,
      "price_list_id": 932
    },
    {
      "contract_number": "47QTCA23D005T",
      "labor_category": "DBA Developer",
      "hourly_rate": 144.48,
      "source_sheet_name": "Price List",
      "source_row_number": 16,
      "raw_data": {
        "vendor_name": "PEOPLE SERVICES CENTER INC",
        "unique_catalog_item_id": "114.0",
        "title": "DBA Developer",
        "description": "Under limited supervision, complete medium to high complexity projects.  Lead development efforts for assigned subject area, develop, document, and implement technical designs.  Communicate with clients, management, and team.  This position is responsible for review, design, analysis, new development, and modification of the systems.  DBAs are also responsible for the optimization and performance improvements of the new and existing code base.  Responsibilities will include design and development of the batch and near-real time data integration processes, Business Intelligence (BI) solutions, development in heterogeneous databases environment, navigation through complex systems configuration.  Ensure accuracy and integrity of the data and applications through analysis, coding, writing clear documentation, and problem resolution.  Analyze data structures content and ensure performance validity.  Design, code, test, and implement software solutions using modern techniques and programming language and BI solutions, including report, dashboards, and notifications in support of the business requirements.  Provide high-level database development assistance in creating specific applications for businesses.  Participate in research and apply innovation at all levels of the software development process.  Work on multiple projects simultaneously and manage competing priorities.  Work harmoniously in a cross-functional teams including IT and business resources.  Function as technical lead and Subject Matter Expert (SME) on assigned projects.  Perform the role of the principal designer, responsible for complex systems and their subsystems employing deep knowledge of current technology and tools, as well as relevant systems that are already existing.  Act as a coach and mentor to junior team members.  Provide excellent customer service by responding to and assisting with resolving issues and system outages.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "144.48",
        "gsa_price_with_iff__c_": "144.48",
        "gsa_price_with_iff__d_": "150.26",
        "gsa_price_with_iff__e_": "156.27",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "none",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "database,architect,developer,design,systems",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "none",
      "security_clearance": "No",
      "contractor_id": 9777,
      "price_list_id": 932
    },
    {
      "contract_number": "47QTCA23D005T",
      "labor_category": "Universe Developer",
      "hourly_rate": 171.64,
      "source_sheet_name": "Price List",
      "source_row_number": 17,
      "raw_data": {
        "vendor_name": "PEOPLE SERVICES CENTER INC",
        "unique_catalog_item_id": "115.0",
        "title": "Universe Developer",
        "description": "Build aggregate and filters and similar objects that make it easy to pull the same info skills with prototype views to speed the production of the reports.  Review and accept each report specification for development.  Build the Universes that will enable system reports.  Provide recommendations for best practices and document the selected design standards/decisions around Universe size, complexity, filters, and measures in conjunction with the related reports.  Analyze, profile, and map fields to the universe in support of reports and quick daily report generation.  Actively participate as a member of the team.  Perform research, take ownership, and resolve issues, and support the delivery of reports to business clients.  Communicate and facilitate clearly with team members and business owners.  Work independently in a team environment to complete needed assignments.  Prepare statuses, update automated tracking tools and reports.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "171.64",
        "gsa_price_with_iff__c_": "171.64",
        "gsa_price_with_iff__d_": "178.51",
        "gsa_price_with_iff__e_": "185.65",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "none",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "universe,developer,development,systems,reports",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "none",
      "security_clearance": "No",
      "contractor_id": 9777,
      "price_list_id": 932
    },
    {
      "contract_number": "47QTCA23D005T",
      "labor_category": "SDK Developer",
      "hourly_rate": 156.81,
      "source_sheet_name": "Price List",
      "source_row_number": 18,
      "raw_data": {
        "vendor_name": "PEOPLE SERVICES CENTER INC",
        "unique_catalog_item_id": "116.0",
        "title": "SDK Developer",
        "description": "Software Development Kit (SDK) Developers meet with clients to understand the company's integrations strategies and processes, so these can be translated into successful integration projects.  The SDK Developer works with applications and programs to ensure the system is designed and developed to meet the company’s changing needs.  An SDK Developer will identify gaps or problem areas with the current integration applications and suggest and implement changes to address business needs, as well as provide mentoring and knowledge transfer for customer users.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "156.81",
        "gsa_price_with_iff__c_": "156.81",
        "gsa_price_with_iff__d_": "163.08",
        "gsa_price_with_iff__e_": "169.6",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "none",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "SDK,developer,development,integration,application",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "none",
      "security_clearance": "No",
      "contractor_id": 9777,
      "price_list_id": 932
    },
    {
      "contract_number": "47QTCA23D005T",
      "labor_category": "Senior Application Architect",
      "hourly_rate": 190.72,
      "source_sheet_name": "Price List",
      "source_row_number": 19,
      "raw_data": {
        "vendor_name": "PEOPLE SERVICES CENTER INC",
        "unique_catalog_item_id": "117.0",
        "title": "Senior Application Architect",
        "description": "This position is responsible for designing and implementing information systems and solutions which address the enterprise infrastructure and application needs of the organization and clients, leading the application development team and supervise the design, testing, and modification phases of multiple initiatives.  The ability to think strategically and position products for long-term success must be demonstrated.  The Senior Application Architect will document and present design artifacts to the internal team and clients throughout the project lifecycle, ensure systems operate securely and that applications are working at optimal levels, investigate and recommend new technologies, and investigate and develop POCs to prove concepts, reliability, and functionality.  Additional tasks include independent work and managing multiple concurrent initiatives, the ability to lead multiple teams and advise on development or architecture solutions as needed, the ability to participate and develop ASP.Net code, Angular, as well as any supporting systems to ensure applications meet or exceed client requirements while demonstrating application prototypes and integrating user feedback.  This positions will analyze system requirements and prioritize tasks, collaborate with Sr Management, business sponsors, and stakeholders on application needs and requirements, write clean, testable code using the ASP.NET programming language, develop technical specifications and architecture, test and debug various .NET applications, review and refactor code, deploy fully functional applications, upgrade existing programs, support Junior Developers’ work, document development and operational procedures, Train and mentor others and provide consulting, troubleshooting, and technical support services to clients.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "190.72",
        "gsa_price_with_iff__c_": "190.72",
        "gsa_price_with_iff__d_": "198.35",
        "gsa_price_with_iff__e_": "206.28",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "none",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "application,architect,software,systems,design",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "none",
      "security_clearance": "No",
      "contractor_id": 9777,
      "price_list_id": 932
    },
    {
      "contract_number": "47QTCA23D005T",
      "labor_category": "Data Architect",
      "hourly_rate": 190.72,
      "source_sheet_name": "Price List",
      "source_row_number": 20,
      "raw_data": {
        "vendor_name": "PEOPLE SERVICES CENTER INC",
        "unique_catalog_item_id": "118.0",
        "title": "Data Architect",
        "description": "Works across technology and business teams and provide data architectural direction and oversite to create a holistic view of the data strategy, data processes, and data assets.  Ensures data lineage is consistent across applications and data sources while also developing and communicating strategies and common approaches for data acquisition, data access, and data archiving.  Creates standards for how data will be stored, consumed, integrated, and managed by different data entities and technology systems.  Selects frameworks, develops and communicates common approaches, and develops roadmaps that enable the implementation of intended business architecture.  Creates diagrams showing key data entities, and creates an inventory of the data needed to implement the architecture vision.  Creates and reviews data designs to ensure that conceptual, logical, and physical data models are consistent with architecture.  Ensures that data flow is consistent, traceable, and meets organizational needs.  Serve as a data entrepreneur, leading the transformation of historical data structures and business data, extract meaning out of data, and create an enterprise data model.  Assists in creating an enterprise architecture approach for solving short-term and long-term strategic initiatives.  This position works closely with clients and end-users to examine existing processes and develop solutions.  Works with Business users and Business Analysts to gather requirements in different forms including:  interviews, facilitated sessions, and reviewing current-state documented data structures and processes.  Acts as technical lead to assess client’s current state environment and offer estimates, works with project manager to create detailed project plans, and provides leadership and guidance to the data warehouse technical team.  Provides data analysis expertise.  Ensures common application architectural framework across different subject areas and conformance with best practices.  Consults with key individuals across multiple projects regarding the usage and application of Business Intelligence and Data Warehousing architectural standards.  Provides input and architectural guidance for ETL architecture and processes.  Implements data quality and data governance processes.  Evaluates, recommends, and implements Business Intelligence Tools to meet technical and business requirements.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "190.72",
        "gsa_price_with_iff__c_": "190.72",
        "gsa_price_with_iff__d_": "198.35",
        "gsa_price_with_iff__e_": "206.28",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "none",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "data,architect,strategy,analysis,architecture",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "none",
      "security_clearance": "No",
      "contractor_id": 9777,
      "price_list_id": 932
    },
    {
      "contract_number": "47QTCA23D005T",
      "labor_category": "Data Warehouse Architect",
      "hourly_rate": 190.72,
      "source_sheet_name": "Price List",
      "source_row_number": 21,
      "raw_data": {
        "vendor_name": "PEOPLE SERVICES CENTER INC",
        "unique_catalog_item_id": "119.0",
        "title": "Data Warehouse Architect",
        "description": "Data Warehouse Architects develop applications that store, retrieve, and secure data.  They communicate with the people who will be using and managing the application to determine what features are needed to help them work more efficiently and effectively, then plan and design the application, eventually installing and testing it to ensure it meets its users' needs.  These Architects work as a member of a team with users, managers, administrators, and other database architects to conduct needs assessments, review database designs with important stakeholders, plan and implement security processes, and train team members.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "190.72",
        "gsa_price_with_iff__c_": "190.72",
        "gsa_price_with_iff__d_": "198.35",
        "gsa_price_with_iff__e_": "206.28",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "none",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "data,warehouse,architect,application,design",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "none",
      "security_clearance": "No",
      "contractor_id": 9777,
      "price_list_id": 932
    },
    {
      "contract_number": "47QTCA23D005T",
      "labor_category": "BI Architect",
      "hourly_rate": 190.72,
      "source_sheet_name": "Price List",
      "source_row_number": 22,
      "raw_data": {
        "vendor_name": "PEOPLE SERVICES CENTER INC",
        "unique_catalog_item_id": "120.0",
        "title": "BI Architect",
        "description": "BI architects work with clients to develop data structures that help them drive their business and marketing strategies.  The data is also used by the organization for identifying market trends.  The BI Architect designs, develops, implements, and oversees data structures, data warehousing, and repositories, as well as report preparation.  They work extensively with software focused on market trends both historical and current to help create strategies for the organization.  The BI architect works with legacy software and extracts data from it and loads the data into currently used software.  They work closely with other information technology specialists within the client organization to ensure the optimization of existing data structures ensuring that both legacy data and current are seamlessly integrated into the organization's larger information technology network such that the data are readily available for decisions that drive the organization's business vision.  Business intelligence architects serve as data collectors from a number of sources ranging from past and current market trends to industry reports. They will often analyze competitive market strategies by studying similar products from other organizations and reporting the results of the analysis to the top executives.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "190.72",
        "gsa_price_with_iff__c_": "190.72",
        "gsa_price_with_iff__d_": "198.35",
        "gsa_price_with_iff__e_": "206.28",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "none",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "business,intelligence,architect,data,software",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "none",
      "security_clearance": "No",
      "contractor_id": 9777,
      "price_list_id": 932
    },
    {
      "contract_number": "47QTCA23D005T",
      "labor_category": "Enterprise Architect",
      "hourly_rate": 190.72,
      "source_sheet_name": "Price List",
      "source_row_number": 23,
      "raw_data": {
        "vendor_name": "PEOPLE SERVICES CENTER INC",
        "unique_catalog_item_id": "121.0",
        "title": "Enterprise Architect",
        "description": "Enterprise Architects meet with executives or clients to understand the company's business strategy and processes, so these can be translated into the information technology structure.  Through research, they utilize the technology and data capturing standards seen in similar businesses, making partnerships between organizations easier.  The architecture typically includes the necessary applications and programs, and is a dynamic technical system that can grow with the company.  An Enterprise Architect will locate gaps or problem areas with the current technology, suggest software and hardware updates, developing a data model for tracking and finding patterns in data collected through business practices, and provide mentoring and knowledge transfer for new users.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "190.72",
        "gsa_price_with_iff__c_": "190.72",
        "gsa_price_with_iff__d_": "198.35",
        "gsa_price_with_iff__e_": "206.28",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "none",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "enterprise,architect,technology,business,processes",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "none",
      "security_clearance": "No",
      "contractor_id": 9777,
      "price_list_id": 932
    },
    {
      "contract_number": "47QTCA23D005T",
      "labor_category": "MDM/DQM Enterprise Architect",
      "hourly_rate": 283.35,
      "source_sheet_name": "Price List",
      "source_row_number": 24,
      "raw_data": {
        "vendor_name": "PEOPLE SERVICES CENTER INC",
        "unique_catalog_item_id": "122.0",
        "title": "MDM/DQM Enterprise Architect",
        "description": "The Enterprise Architect/Master Data Management (MDM)/Data Quality Management (DQM) Architect is responsible for Senior-level Architectural leadership, providing trusted advice and direction to help Client achieve its strategic business and technical goals and objectives.  Provide state of the art architectural direction, best practices, and deep experience in Enterprise Architecture and Master Data Management (MDM) – bringing Industry-leading and proven architectural-level knowledge, disciplines and skillsets to develop Enterprise-level architectural designs, serving as the blueprints and vision for enterprise data foundations, including Master Data and MDM capabilities, Operational Data Stores, Data Lakes, Enterprise Data Warehouses (EDWs), Data Hubs, Data Marts, etc.).  Development of architectural-level artifacts in the creation of the Client’s End State Enterprise Architecture Vision, with a focus on the ecosystems and their design and management of strategic foundational enterprise data resources.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "283.35",
        "gsa_price_with_iff__c_": "283.35",
        "gsa_price_with_iff__d_": "294.68",
        "gsa_price_with_iff__e_": "306.47",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "none",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "enterprise,architect,data,management,quality",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "none",
      "security_clearance": "No",
      "contractor_id": 9777,
      "price_list_id": 932
    },
    {
      "contract_number": "47QTCA23D005T",
      "labor_category": "Data Modeler",
      "hourly_rate": 190.72,
      "source_sheet_name": "Price List",
      "source_row_number": 25,
      "raw_data": {
        "vendor_name": "PEOPLE SERVICES CENTER INC",
        "unique_catalog_item_id": "123.0",
        "title": "Data Modeler",
        "description": "As they work to design and build useful databases, Data Modelers do a variety of different tasks.  They must identify business needs by identifying areas where data can be used to improve business activities, and defining business users’ requirements.  Then, using their understanding of data flows, they propose and implement innovative data solutions.  They create and maintain Data Models and work closely with the Database Architects to create optimal physical data models of datasets, then create and maintain data maps and systems interrelationship diagrams for data domains and systems.  They define and govern data modeling and design standards, tools, best practices, and related development methodologies for the client.  They also set standards for document naming, security, and lifecycle & retention architecture.  Based off of their data an analysis, Data Modelers make recommendations for standardization and proper data usage.  They champion the usage of data in business, and communicate the benefits and return on investment for application and product owners.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "190.72",
        "gsa_price_with_iff__c_": "190.72",
        "gsa_price_with_iff__d_": "198.35",
        "gsa_price_with_iff__e_": "206.28",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "none",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "data,model,design,database,systems",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "none",
      "security_clearance": "No",
      "contractor_id": 9777,
      "price_list_id": 932
    },
    {
      "contract_number": "47QTCA23D005T",
      "labor_category": "Data Governance Consultant",
      "hourly_rate": 190.72,
      "source_sheet_name": "Price List",
      "source_row_number": 26,
      "raw_data": {
        "vendor_name": "PEOPLE SERVICES CENTER INC",
        "unique_catalog_item_id": "124.0",
        "title": "Data Governance Consultant",
        "description": "A Data Governance Consultant is responsible for activities around Data Governance, assessments, strategies, data quality management and mentoring clients on how to implement DG programs.  This position works closely with clients to create or enhance DG programs and to help clients mature their DG capabilities.  The DG lead consultant will help lead clients in the process of implementing these reusable deliverables and processes for clients.  The following is the framework, templates and tools that will be implemented from customer to customer:  implementation framework and roadmap applying Industry best practices and reusable deliverable templates to help accelerate Data Governance Program Implementation efforts and reduce costs, Overview Presentations - education to Executive level sponsors and Core Data Governance Team, Data Governance Charter (A foundational document with Data Governance mission, vision, policies, and standards, Enterprise information management guidelines, objectives, roles & responsibilities), program Backlog (data-related Issues, needs and opportunities collected from the client and organized into themes such as Data Quality, Data Acquisition, Data Standardization, Data Security, Big Data, etc.), initial scope for the Data Governance Program and Pilot Project (e.g., selection of 1 or 2 quick win ideas to implement – a way to pilot the act of governing by the business over their data and piloting of the related data governance processes), communication/change management plan, organization structure (decision making authority) defined/confirmed (executive and work group levels), work group formed to include business and I/T leaders and subject matter experts, overview of the traditional roles and responsibilities of being a Data Steward provided to the group, meeting structure and agenda template and meetings following the standard agenda, Issue Intake Triage Worksheet, Home Page template, initial toolset strategy, initial business glossary (standard definitions for key concepts and terms), pilot project under (consulting/mentoring), self-sufficient in running meetings, and pilot lessons learned.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "190.72",
        "gsa_price_with_iff__c_": "190.72",
        "gsa_price_with_iff__d_": "198.35",
        "gsa_price_with_iff__e_": "206.28",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "none",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "data,governance,quality,management,processes",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "none",
      "security_clearance": "No",
      "contractor_id": 9777,
      "price_list_id": 932
    },
    {
      "contract_number": "47QTCA23D005T",
      "labor_category": "Predictive/Data Scientist",
      "hourly_rate": 190.72,
      "source_sheet_name": "Price List",
      "source_row_number": 27,
      "raw_data": {
        "vendor_name": "PEOPLE SERVICES CENTER INC",
        "unique_catalog_item_id": "125.0",
        "title": "Predictive/Data Scientist",
        "description": "The Predictive/Data Scientist is tasked with solving our most complex quantitative, statistical, and data-oriented problems.  Use a powerful blend of business acumen, analytics, mathematics, programming, and modeling to provide strategic recommendations, insights, and products across a diverse set of business areas and industries.  Functional projects typically include deep-dive operational analyses, data wrangling and processing, programmatic automation, and predictive modeling.  Our data scientist operates both independently and collaboratively with wide-latitude, moving in and out of dynamic teams and are often asked to tackle complicated questions that require creative solutions.  Conduct advanced analyses and statistical deep-dives, with a focus on producing actionable recommendations and strategic guidance for decision makers.  Develop and deploy custom models and algorithms using Python, R, and machine learning platforms.  Mine, clean, process, transform and join data from a variety of sources.  Identify, wrangle, scrape, and assemble new data sources from the web, data aggregators, and public sources.  Build rich, interactive reports, dashboards, and visualizations.  Compile and present key findings and reports to key stakeholders, including senior leadership.  Continuously seek out opportunities to add value through programmatic solutions to manual tasks.  Be a subject matter expert within the data science field.  Continuously learn, grow, and explore new emerging technologies.  Be an exceptional problem solver, source of creative solutions, and take the initiative to share new ideas, methodologies, and strategies.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "190.72",
        "gsa_price_with_iff__c_": "190.72",
        "gsa_price_with_iff__d_": "198.35",
        "gsa_price_with_iff__e_": "206.28",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "none",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "predictive,data,analytic,model,statistic",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "none",
      "security_clearance": "No",
      "contractor_id": 9777,
      "price_list_id": 932
    },
    {
      "contract_number": "47QTCA23D005T",
      "labor_category": "System Administrator Specialist",
      "hourly_rate": 158.02,
      "source_sheet_name": "Price List",
      "source_row_number": 28,
      "raw_data": {
        "vendor_name": "PEOPLE SERVICES CENTER INC",
        "unique_catalog_item_id": "126.0",
        "title": "System Administrator Specialist",
        "description": "The System Administrator / Install / Upgrade Specialist will administer servers, desktops, and software applications.  The individual will analyze user requirements, procedures, and methodologies to automate processing or to improve existing systems.  Ensure effective operation of the network to meet business needs, including the design of network architecture, integration, and installation of IT equipment.  Conduct administration and implementation for Active Directory and Windows Server, administration of SAN, VMware, LAN/WAN/VPN, User accounts, and Microsoft Exchange administration.  Perform network troubleshooting and engineering including VPN, DNS, DHCP, WINS, TCP/IP, Routing.  Provide all aspects of IT network support and administration.  Achieve advanced troubleshooting of server, desktop, and network infrastructure.  Perform installation and troubleshooting of software/hardware and conduct Local and Remote End user support in a Windows environment.  Maintain security posture of network and systems.  Supports the research and evaluation of technology solutions for business needs.  Educate staff regarding use of software, systems, and applications.  Prepare and maintain documentation of network and systems configurations.  Maintain and test disaster recovery plans.  Ensure compliance with licensing requirements.  Rotate as after-hours contact and perform after-hours support as needed.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "158.02",
        "gsa_price_with_iff__c_": "158.02",
        "gsa_price_with_iff__d_": "164.34",
        "gsa_price_with_iff__e_": "170.91",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "none",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "system,administrator,servers,installation,upgrade",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "none",
      "security_clearance": "No",
      "contractor_id": 9777,
      "price_list_id": 932
    },
    {
      "contract_number": "47QTCA23D005T",
      "labor_category": "Project Manager",
      "hourly_rate": 171.64,
      "source_sheet_name": "Price List",
      "source_row_number": 29,
      "raw_data": {
        "vendor_name": "PEOPLE SERVICES CENTER INC",
        "unique_catalog_item_id": "127.0",
        "title": "Project Manager",
        "description": "Project Managers are responsible for planning, directing, and coordinating project management activities of designated project(s), ensuring that the goals and objectives of the project(s) are accomplished within the prescribed time frame and requirements.  Must have excellent relationship building, leadership, and client management skills.  Must have a deep understanding of project management tools and approaches to managing complex projects.  The Project Manager will provide leadership and management of standard project practices following an established Project Management Methodology (PMM) and System Development Methodology (SDM).  Project Managers lead the process to complete project charter and obtain necessary approvals, determine resources required to accomplish project objectives, conduct or participate in stakeholder meetings, and contribute to the overall team effort as needed to accomplish successful project results.  They create and publish project documents to include project scope, work breakdown structure, risk assessment and response, critical path, time estimates, schedules, and budget projections, as well as create and execute plans for communication, change control, quality control, and specific coordination of activities.  PMs work with Business users to gather requirements in different forms, including facilitated interview sessions.  The Project Manager will oversee execution of project tasks, monitoring performance, creation of burn down charts and solving project slippage and/or constraints in a timely manner, manage stakeholder expectations by utilizing risk mitigation and problem solving, control project scope and changes, schedule, budget, and status reporting.  They also facilitate closeout activities, retrospectives/lessons learned, and customer feedback.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "171.64",
        "gsa_price_with_iff__c_": "171.64",
        "gsa_price_with_iff__d_": "178.51",
        "gsa_price_with_iff__e_": "185.65",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "none",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "project,manager,planning,management,coordination",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "none",
      "security_clearance": "No",
      "contractor_id": 9777,
      "price_list_id": 932
    },
    {
      "contract_number": "47QTCA23D005T",
      "labor_category": "Senior Project Manager",
      "hourly_rate": 190.72,
      "source_sheet_name": "Price List",
      "source_row_number": 30,
      "raw_data": {
        "vendor_name": "PEOPLE SERVICES CENTER INC",
        "unique_catalog_item_id": "128.0",
        "title": "Senior Project Manager",
        "description": "Senior Project Managers are responsible for planning, directing, and coordinating project management activities of designated project(s), ensuring that the goals and objectives of the project(s) are accomplished within the prescribed time frame and requirements.  Must have excellent relationship building, leadership, and client management skills.  Must have a deep understanding of project management tools and approaches to managing complex projects.  The Senior Project Manager will provide leadership and management of standard project practices following an established Project Management Methodology (PMM) and System Development Methodology (SDM).  Senior Project Managers lead the process to complete project charter and obtain necessary approvals, determine resources required to accomplish project objectives, conduct or participate in stakeholder meetings, and contribute to the overall team effort as needed to accomplish successful project results.  They create and publish project documents to include project scope, work breakdown structure, risk assessment and response, critical path, time estimates, schedules, and budget projections, as well as create and execute plans for communication, change control, quality control, and specific coordination of activities.  PMs work with Business users to gather requirements in different forms, including facilitated interview sessions.  The Senior Project Manager will oversee execution of project tasks, monitoring performance, creation of burn down charts and solving project slippage and/or constraints in a timely manner, manage stakeholder expectations by utilizing risk mitigation and problem solving, control project scope and changes, schedule, budget, and status reporting.  They also facilitate closeout activities, retrospectives/lessons learned, and customer feedback. Senior PM’s act as leaders amongst the PM team.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "190.72",
        "gsa_price_with_iff__c_": "190.72",
        "gsa_price_with_iff__d_": "198.35",
        "gsa_price_with_iff__e_": "206.28",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "none",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "project,manager,planning,management,coordination",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "none",
      "security_clearance": "No",
      "contractor_id": 9777,
      "price_list_id": 932
    },
    {
      "contract_number": "47QTCA23D005T",
      "labor_category": "Data Warehouse Project Manager",
      "hourly_rate": 190.72,
      "source_sheet_name": "Price List",
      "source_row_number": 31,
      "raw_data": {
        "vendor_name": "PEOPLE SERVICES CENTER INC",
        "unique_catalog_item_id": "129.0",
        "title": "Data Warehouse Project Manager",
        "description": "Data Warehouse Project Managers (DW-PMs) are responsible for planning, directing, and coordinating project management activities of designated Data Warehouse and Business Intelligence (BI) project(s), ensuring that the goals and objectives of the project(s) are accomplished within the prescribed time frame and requirements.  Must have excellent relationship building, leadership, and client management skills.  Must have a deep understanding of project management tools and approaches to managing complex projects.  The DW-PM will provide leadership and management of standard project practices following an established Project Management Methodology (PMM) and System Development Methodology (SDM).  DW-PMs lead the process to complete project charter and obtain necessary approvals, determine resources required to accomplish project objectives, conduct or participate in stakeholder meetings, and contribute to the overall team effort as needed to accomplish successful project results.  This includes managing the project team, facilitating and leading requirements gathering sessions with business and technical users, reviewing source system layouts and schemas, analyzing the requirements, and creating a comprehensive strategy and roadmap to meet our client’s business needs, including project plans, release plans, and staffing plans.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "190.72",
        "gsa_price_with_iff__c_": "190.72",
        "gsa_price_with_iff__d_": "198.35",
        "gsa_price_with_iff__e_": "206.28",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "none",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "project,manager,planning,management,coordination",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "none",
      "security_clearance": "No",
      "contractor_id": 9777,
      "price_list_id": 932
    },
    {
      "contract_number": "47QTCA23D005T",
      "labor_category": "Data Science Project Manager",
      "hourly_rate": 190.72,
      "source_sheet_name": "Price List",
      "source_row_number": 32,
      "raw_data": {
        "vendor_name": "PEOPLE SERVICES CENTER INC",
        "unique_catalog_item_id": "130.0",
        "title": "Data Science Project Manager",
        "description": "Data Science Project Managers (DS-PMs) are responsible for planning, directing, and coordinating project management activities of designated Data Science project(s), ensuring that the goals and objectives of the project(s) are accomplished within the prescribed time frame and requirements.  Must have excellent relationship building, leadership, and client management skills.  Must have a deep understanding of project management tools and approaches to managing complex projects.  The DS-PM will provide leadership and management of standard project practices following an established Project Management Methodology (PMM) and System Development Methodology (SDM).  DS-PMs lead the process to complete project charter and obtain necessary approvals, determine resources required to accomplish project objectives, conduct or participate in stakeholder meetings, and contribute to the overall team effort as needed to accomplish successful project results.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "190.72",
        "gsa_price_with_iff__c_": "190.72",
        "gsa_price_with_iff__d_": "198.35",
        "gsa_price_with_iff__e_": "206.28",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "none",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "project,manager,planning,management,coordination",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "none",
      "security_clearance": "No",
      "contractor_id": 9777,
      "price_list_id": 932
    }
  ],
  "parsed_at": "2025-11-06T11:49:23.858199"
}