{
  "contract_number": "47QTCA19D005F",
  "contractor_id": 7014,
  "price_list_id": 1030,
  "labor_categories": [
    {
      "contract_number": "47QTCA19D005F",
      "labor_category": "Business Analyst 1",
      "hourly_rate": 79.75,
      "source_sheet_name": "Price List",
      "source_row_number": 3,
      "raw_data": {
        "vendor_name": "IVORY CLOUD LLC",
        "unique_catalog_item_id": "IC-0001",
        "title": "Business Analyst 1",
        "description": "Assist in applying common best practices for the industry to the customer using a knowledge base to create conceptual business models and to identify relevant issues and considerations in selecting application software packages. Assess the operational and functional baseline of an organization and its organizational components and help to define the direction and strategy for an engagement while ensuring the organizational needs are being addressed. Typical areas addressed include Human Resources, Finance, Supply, and operations. Identify information technology inadequacies and/or deficiencies that affect the functional area’s ability to support/meet organizational goals. Support the development of functional area strategies for enhanced IT. Commensurate experience and education.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "79.75",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "1.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "business,analyst",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 7014,
      "price_list_id": 1030
    },
    {
      "contract_number": "47QTCA19D005F",
      "labor_category": "Business Analyst 2",
      "hourly_rate": 128.03,
      "source_sheet_name": "Price List",
      "source_row_number": 4,
      "raw_data": {
        "vendor_name": "IVORY CLOUD LLC",
        "unique_catalog_item_id": "IC-0002",
        "title": "Business Analyst 2",
        "description": "Assist in applying common best practices for the industry to the customer using a knowledge base to create conceptual business models and to identify relevant issues and considerations in selecting application software packages. Assess the operational and functional baseline of an organization and its organizational components, and help to define the direction and strategy for an engagement while ensuring the organizational needs are being addressed. Typical areas addressed include Human Resources, Finance, Supply, and operations. Identify information technology inadequacies and/or deficiencies that affect the functional area’s ability to support/meet organizational goals. Generate functional area strategies for enhanced IT operations in a cross-functional area mode throughout the organization. Participate in account strategy sessions, strategic assessments and design reviews to validate enterprise approach and associated work products, such as ERP implementations coordinating the resolution of highly complex problems and tasks. Commensurate experience and education.  Grants Management experience preferred.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "128.03",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "business,analyst",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 7014,
      "price_list_id": 1030
    },
    {
      "contract_number": "47QTCA19D005F",
      "labor_category": "Computer Support Specialist 1",
      "hourly_rate": 59.31,
      "source_sheet_name": "Price List",
      "source_row_number": 5,
      "raw_data": {
        "vendor_name": "IVORY CLOUD LLC",
        "unique_catalog_item_id": "IC-0003",
        "title": "Computer Support Specialist 1",
        "description": "Provide technical assistance to computer users. Answer questions or resolve computer problems for clients in person, or via telephone or electronically. May aid concerning the use of computer hardware and software, including printing, installation, word processing, electronic mail, and operating systems.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "59.31",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "1.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "computer,specialist",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 7014,
      "price_list_id": 1030
    },
    {
      "contract_number": "47QTCA19D005F",
      "labor_category": "Business Analyst 3",
      "hourly_rate": 140.74,
      "source_sheet_name": "Price List",
      "source_row_number": 6,
      "raw_data": {
        "vendor_name": "IVORY CLOUD LLC",
        "unique_catalog_item_id": "IC-0004",
        "title": "Business Analyst 3",
        "description": "Demonstrate up-to-date expertise in Information Systems and apply this to the development, execution and improvement of action plans by providing advice and guidance to others in the application of information and best practices. Support and align efforts to meet customer and business needs. Manage customer relationships and expectations by developing a communication process to keep others up-to-date on project results. Stay current with customer needs and strategies; utilizing formal and informal written communication methods (for example, emails, newsletters, PowerPoint presentations, executive updates, task lists, updates) to communicate updates and findings; and facilitating project meetings and presentations to all types of diverse audiences (for example, senior management, Customers, technical staff). Lead or participate in multiple projects by completing and updating project documentation; managing project scope; adjusting schedules when necessary; determining daily priorities; ensuring efficient and on-time delivery of project tasks and milestones; following proper escalation paths; and managing customer and supplier relationships. Provide leadership to team members and peers by collaborating with others; articulating ideas and viewpoints to senior management, peers and others; identifying and initiating projects; managing resources; driving the resolution of issues; and holding self and team accountable for results. Identify, create and facilitate process design changes by conducting business and systems process analysis and design at a complex level; focusing on quality improvement and data management; ensuring data is reliable and valid; developing process improvements or re-engineering and recommending elimination; integrating new systems and processes with existing ones; and partnering with internal and external customers to ensure systems provided meet the long-term business strategies. Provide and support the implementation of business solutions by building relationships and partnerships with key stakeholders; identifying business needs; determining and carrying out necessary processes and practices; monitoring progress and results; recognizing and capitalizing on improvement opportunities; and adapting to competing demands, organizational changes and new responsibilities.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "140.74",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "business,analyst",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 7014,
      "price_list_id": 1030
    },
    {
      "contract_number": "47QTCA19D005F",
      "labor_category": "Project Manager 2",
      "hourly_rate": 124.61,
      "source_sheet_name": "Price List",
      "source_row_number": 7,
      "raw_data": {
        "vendor_name": "IVORY CLOUD LLC",
        "unique_catalog_item_id": "IC-0005",
        "title": "Project Manager 2",
        "description": "Typically oversee all aspects of the project, leading a team on large projects or a significant segment of large and complex projects. Analyze new and complex project-related problems and create innovative solutions that normally involve the schedule, technology, methodology, tools, solution components, and financial management of the project. Provide applications systems analysis and long and short-range plans for application selection, systems development, systems maintenance, and production activities for necessary support resources. Commensurate experience and education for the specific level.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "124.61",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "7.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "project,manager",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 7014,
      "price_list_id": 1030
    },
    {
      "contract_number": "47QTCA19D005F",
      "labor_category": "Project Manager 3",
      "hourly_rate": 136.45,
      "source_sheet_name": "Price List",
      "source_row_number": 8,
      "raw_data": {
        "vendor_name": "IVORY CLOUD LLC",
        "unique_catalog_item_id": "IC-0006",
        "title": "Project Manager 3",
        "description": "Project Manager III manages the day-to-day operational and tactical aspects of multiple or large scale projects. Oversees managers working on client engagements within practice. Reviews high-level deliverables across projects. Implements engagement review and quality assurance procedures in accordance with our methodology to ensure profitable and successful execution of consulting engagements as measured by regional goals and customer satisfaction. Minimizes our exposure and risk across multiple projects. Manages scope and mitigates risk across projects. Determines appropriate revenue recognition, ensures accurate invoicing, and monitors receivables for all projects under his/her direction. Integrates financial data for multiple projects. Compares financial data for practice to that of other practices and seeks ways to maximize revenue. Analyzes profitability, revenue, margins, bill rates and utilization across projects. Addresses elevated billing issues when they arise.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "136.45",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "project,manager",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 7014,
      "price_list_id": 1030
    },
    {
      "contract_number": "47QTCA19D005F",
      "labor_category": "SCRUM Master 1",
      "hourly_rate": 109.07,
      "source_sheet_name": "Price List",
      "source_row_number": 9,
      "raw_data": {
        "vendor_name": "IVORY CLOUD LLC",
        "unique_catalog_item_id": "IC-0007",
        "title": "SCRUM Master 1",
        "description": "Monitoring the SCRUM processes, SCRUM meetings, organize and lead SCRUM ceremonies. Assist in increasing the team efficiency, motivates the team, spins, and argues for changes that will ensure quality and timeliness. Ensures the DoD (Definition of done) is being followed. Communicated with main stakeholders. Oversee and manage scope, timeline, quality, goals and deliverables that support business goals. Monitor schedule and cost performance",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "109.07",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "scrum,master",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 7014,
      "price_list_id": 1030
    },
    {
      "contract_number": "47QTCA19D005F",
      "labor_category": "Software Developer 2",
      "hourly_rate": 104.68,
      "source_sheet_name": "Price List",
      "source_row_number": 10,
      "raw_data": {
        "vendor_name": "IVORY CLOUD LLC",
        "unique_catalog_item_id": "IC-0008",
        "title": "Software Developer 2",
        "description": "Create and/or maintain operating systems, communications software, data base packages, compilers, assemblers, and utility programs. Modify existing software as well as create special-purpose software to ensure efficiency and integrity between systems and applications. Translate detailed design into computer software. Test, debug, and refine the computer software to produce the required product. Prepare required documentation, including both program-level and user-level documentation. Enhance software to reduce operating time or improve efficiency. Experience with ASP.NET, .NET 4.0/4.5/4.5.1, C#, SQL Server 2005/2008/2012.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "104.68",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "software,developer",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 7014,
      "price_list_id": 1030
    },
    {
      "contract_number": "47QTCA19D005F",
      "labor_category": "Software Developer 3",
      "hourly_rate": 128.27,
      "source_sheet_name": "Price List",
      "source_row_number": 11,
      "raw_data": {
        "vendor_name": "IVORY CLOUD LLC",
        "unique_catalog_item_id": "IC-0009",
        "title": "Software Developer 3",
        "description": "Create and/or maintain operating systems, communications software, data base packages, compilers, assemblers, and utility programs. Modify existing software as well as create special-purpose software to ensure efficiency and integrity between systems and applications. Translate detailed design into computer software. Test, debug, and refine the computer software to produce the required product. Review required documentation, including both program-level and user-level documentation. Enhance software to reduce operating time or improve efficiency. Experience with ASP.NET, .NET 4.0/4.5/4.5.1, C#, MVC, HTML 5.0, CSS 3.0, Bootstrap, Entity Framework, Data Modeling, JavaScript, jQuery, Angular, Kendo or other MVVM frameworks, SQL Server 2005/2008/2012, T-SQL, Stored Procedures, REST (WebAPI), WCF, Web Services, Azure, Cloud Architecture and Infrastructure, Object Oriented Design, SOLID principles, Multithreading, Async, TFS, Visual Studio",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "128.27",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "software,developer",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 7014,
      "price_list_id": 1030
    },
    {
      "contract_number": "47QTCA19D005F",
      "labor_category": "Software Tester 1",
      "hourly_rate": 60.78,
      "source_sheet_name": "Price List",
      "source_row_number": 12,
      "raw_data": {
        "vendor_name": "IVORY CLOUD LLC",
        "unique_catalog_item_id": "IC-0010",
        "title": "Software Tester 1",
        "description": "Develop and implement quality control methodologies to ensure compliance with quality assurance standards, guidelines, and procedures in a large computer-based organization. Develop and define major and minor characteristics of quality including quality metrics and scoring parameters and determines requisite quality control resources for an actual task order. Establish and maintain a process for evaluating hardware, software, and associated documentation and/or assist in the evaluation. Conduct and/or participate in formal and informal reviews at pre-determined points throughout the development life cycle",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "60.78",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "software,tester",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 7014,
      "price_list_id": 1030
    },
    {
      "contract_number": "47QTCA19D005F",
      "labor_category": "Software Tester 2",
      "hourly_rate": 93.82,
      "source_sheet_name": "Price List",
      "source_row_number": 13,
      "raw_data": {
        "vendor_name": "IVORY CLOUD LLC",
        "unique_catalog_item_id": "IC-0011",
        "title": "Software Tester 2",
        "description": "Interacts with other engineering groups to define, document, analyze, perform, and interpret tests for products, systems, components, or modifications. Identifies functional problems and suggests resolutions. Defines internal quality control standards and the maintenance of reliability programs. Documents and analyzes test cases and provides feedback and recommendations for product or design changes. Ensures testing procedures are in compliance with any required industry specific standards. Contributes to the development of improvements to overall testing and quality programs for improved results. May coordinate with vendors or suppliers to modify or develop testing for components or other parts.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "93.82",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "7.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "software,tester",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 7014,
      "price_list_id": 1030
    },
    {
      "contract_number": "47QTCA19D005F",
      "labor_category": "Software Tester 3",
      "hourly_rate": 109.46,
      "source_sheet_name": "Price List",
      "source_row_number": 14,
      "raw_data": {
        "vendor_name": "IVORY CLOUD LLC",
        "unique_catalog_item_id": "IC-0012",
        "title": "Software Tester 3",
        "description": "analyze, perform, and interpret tests for products, systems, components, or modifications. Identifies functional problems and suggests resolutions. Defines internal quality control standards and the maintenance of reliability programs. Documents and analyzes test cases and provides feedback and recommendations for product or design changes. Ensures testing procedures are in compliance with any required industry specific standards. Contributes to the development of improvements to overall testing and quality programs for improved results. Coordinate with vendors or suppliers to modify or develop testing for components or other parts. May lead Standups and administer SCRUM processes.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "109.46",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "software,tester",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 7014,
      "price_list_id": 1030
    },
    {
      "contract_number": "47QTCA19D005F",
      "labor_category": "System DB Administrator 2",
      "hourly_rate": 96.7,
      "source_sheet_name": "Price List",
      "source_row_number": 15,
      "raw_data": {
        "vendor_name": "IVORY CLOUD LLC",
        "unique_catalog_item_id": "IC-0013",
        "title": "System DB Administrator 2",
        "description": "Analyze database requirements of assigned projects. Analyze and determine information needs and elements, database relationships and attributes, proposed manipulation, data flow and storage requirements, and data output and reporting capabilities. Apply knowledge of database management systems to coordinate maintenance and changes to databases. Test and implement changes or new database designs. Write logical and physical database descriptions, including location, space, access method, and security requirements. Provide direction to programmers and analysts as required to affect changes to database management systems. Provide answers to database questions. Knowledge of and ability to monitor databases and to analyze and organize data and apply new technology designs and programs.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "96.7",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "system,administrator",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 7014,
      "price_list_id": 1030
    },
    {
      "contract_number": "47QTCA19D005F",
      "labor_category": "Technical Architect 1",
      "hourly_rate": 129.98,
      "source_sheet_name": "Price List",
      "source_row_number": 16,
      "raw_data": {
        "vendor_name": "IVORY CLOUD LLC",
        "unique_catalog_item_id": "IC-0014",
        "title": "Technical Architect 1",
        "description": "Establish system information requirements using analysis of the information engineer(s) in the development of enterprise-wide or large-scale information systems. Design architecture to include the software, hardware, and communications to support the total requirements as well as provide for present and future cross-functional requirements and interfaces. Ensure these systems are compatible and in compliance with the standards for open systems architectures, the OSI and ISO reference models, and profiles of standards – such as IEEE OSE reference model – as they apply to the implementation and specification of information management solution of the application platform, across the API, and the external environment/software application. Ensure that the common operating environment is compliant with the Agency enterprise architecture and applicable reference models. Evaluate analytically and systematically problems of workflows, organization, and planning and develop appropriate corrective action. Provide daily supervision and direction to staff. Experience with .Net, C, C++, Visual Studio 2010/2012/2013, JQuery / JavaScript, LINQ, XAML, AJAX.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "129.98",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "7.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "technical,architect",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 7014,
      "price_list_id": 1030
    },
    {
      "contract_number": "47QTCA19D005F",
      "labor_category": "Technical Architect 2",
      "hourly_rate": 138.57,
      "source_sheet_name": "Price List",
      "source_row_number": 17,
      "raw_data": {
        "vendor_name": "IVORY CLOUD LLC",
        "unique_catalog_item_id": "IC-0015",
        "title": "Technical Architect 2",
        "description": "Establish system information requirements using analysis of the information engineer(s) in the development of enterprise-wide or large-scale information systems. Design architecture to include the software, hardware, and communications to support the total requirements as well as provide for present and future cross-functional requirements and interfaces. Ensure these systems are compatible and in compliance with the standards for open systems architectures, the OSI and ISO reference models, and profiles of standards – such as IEEE OSE reference model – as they apply to the implementation and specification of information management solution of the application platform, across the API, and the external environment/software application. Ensure that the common operating environment is compliant with the Agency enterprise architecture and applicable reference models. Evaluate analytically and systematically problems of workflows, organization, and planning and develop appropriate corrective action. Provide daily supervision and direction to staff. Experience with .Net, C, C++, Visual Studio 2010/2012/2013, JQuery / JavaScript, LINQ, XAML, AJAX.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "138.57",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "technical,architect",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 7014,
      "price_list_id": 1030
    },
    {
      "contract_number": "47QTCA19D005F",
      "labor_category": "Project Coordinator 1",
      "hourly_rate": 59.31,
      "source_sheet_name": "Price List",
      "source_row_number": 18,
      "raw_data": {
        "vendor_name": "IVORY CLOUD LLC",
        "unique_catalog_item_id": "IC-0016",
        "title": "Project Coordinator 1",
        "description": "Coordinate project management activities, resources, equipment and information. Break projects into doable actions and set timeframes. Liaise with clients to identify and define requirements, scope and objectives. Assign tasks to internal teams and assist with schedule management. Make sure that clients’ needs are met as projects evolve. Help prepare budgets. Analyze risks and opportunities. Oversee project procurement management. Monitor project progress and handle any issues that arise. Act as the point of contact and communicate project status to all participants. Work with the Project Manager to eliminate blockers. Use tools to monitor working hours, plans and expenditures. Issue all appropriate legal paperwork (e.g. contracts and terms of agreement). Create and maintain comprehensive project documentation, plans and reports. Ensure standards and requirements are met through conducting quality assurance tests",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "59.31",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "project,coordinator",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 7014,
      "price_list_id": 1030
    },
    {
      "contract_number": "47QTCA19D005F",
      "labor_category": "Testing Manager 1",
      "hourly_rate": 122.17,
      "source_sheet_name": "Price List",
      "source_row_number": 19,
      "raw_data": {
        "vendor_name": "IVORY CLOUD LLC",
        "unique_catalog_item_id": "IC-0017",
        "title": "Testing Manager 1",
        "description": "Establish and maintain a process for evaluating software and associated documentation. Determine the resources required for quality control. Maintain the level of quality throughout the software life cycle. Conduct formal and informal reviews at pre-determined points throughout the development life cycle. Provide daily supervision and direction to support staff.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "122.17",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "testing,manager",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 7014,
      "price_list_id": 1030
    },
    {
      "contract_number": "47QTCA19D005F",
      "labor_category": "Web Developer 2",
      "hourly_rate": 97.73,
      "source_sheet_name": "Price List",
      "source_row_number": 20,
      "raw_data": {
        "vendor_name": "IVORY CLOUD LLC",
        "unique_catalog_item_id": "IC-0018",
        "title": "Web Developer 2",
        "description": "Provide support to develop Web based applications including on line customer service to transform Government agencies to be able to deliver their services on line. Provide support in developing the site concept, interface design, and architecture of the web-site. Provide support for the implementation of interfaces to applications. Working knowledge and experience coding in Java is required. Knowledge of several of the following areas is desirable: Active Server Pages, AEM, JavaScript, Visual Basic, JavaScript, Access, HTML, DBMS's (ex. – Oracle, Sybase, etc.) and knowledge of SQL in SQL server.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "97.73",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "7.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "web,developer",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 7014,
      "price_list_id": 1030
    },
    {
      "contract_number": "47QTCA19D005F",
      "labor_category": "Program Manager 2",
      "hourly_rate": 229.67,
      "source_sheet_name": "Price List",
      "source_row_number": 21,
      "raw_data": {
        "vendor_name": "IVORY CLOUD LLC",
        "unique_catalog_item_id": "IC-0019",
        "title": "Program Manager 2",
        "description": "Program Manager 2 manages the day-to-day delivery, schedule, strategy, customer engagement and financials of software implementations activities. This role will responsible for the strategic direction of the software development project, manages day-to-day activities of software development, creates and manages an overall schedule, long-term and short-term goals, and works within a project or program level implementation budget. This person will be responsible for the uninterrupted delivery of technical services to the customer. This role will manage a technical software implementation team with a diverse array of technical talents and responsibilities as well as ensure goals are met in areas including customer satisfaction, deliverable quality, and team member performance. Monitors and validates contractual deliverables for all projects under his/her direction.  Analyzes efficiency, velocity, quality, and utilization across projects and teams. Addresses billing issues when they arise.  This person will meet with stakeholders to make communication easy and transparent regarding project issues and decisions on services, producing accurate and timely reporting of status throughout its life cycle, analyzing risks, and setting overall implementation strategy.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "229.67",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "15.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "program,manager",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 7014,
      "price_list_id": 1030
    },
    {
      "contract_number": "47QTCA19D005F",
      "labor_category": "Project Manager 4",
      "hourly_rate": 205.24,
      "source_sheet_name": "Price List",
      "source_row_number": 22,
      "raw_data": {
        "vendor_name": "IVORY CLOUD LLC",
        "unique_catalog_item_id": "IC-0020",
        "title": "Project Manager 4",
        "description": "Project Manager IV manages the day-to-day operational and tactical aspects of software/hardware projects and teams. Oversees teams working on client engagements within the software implementations practice. Reviews high-level deliverables within projects and teams for quality and compliance. Implements engagement review and quality assurance procedures in accordance with our methodology to ensure successful execution of engagements as measured by customer satisfaction and performance against technical project deliverables. Manages & mitigates risk across customer and projects teams.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "205.24",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "15.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "project,manager",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 7014,
      "price_list_id": 1030
    },
    {
      "contract_number": "47QTCA19D005F",
      "labor_category": "Technical Architect 3",
      "hourly_rate": 190.58,
      "source_sheet_name": "Price List",
      "source_row_number": 23,
      "raw_data": {
        "vendor_name": "IVORY CLOUD LLC",
        "unique_catalog_item_id": "IC-0021",
        "title": "Technical Architect 3",
        "description": "Establish system information requirements using analysis of the information engineer(s) in the development of enterprise-wide or large-scale information systems. Design architecture to include the software, hardware, and communications to support the total requirements as well as provide for present and future cross-functional requirements and interfaces. Ensure these systems are compatible and in compliance with the standards for open systems architectures, the OSI and ISO reference models, and profiles of standards – such as IEEE OSE reference model – as they apply to the implementation and specification of information management solution of the application platform, across the API, and the external environment/software application. Ensure that the common operating environment is compliant with the Agency enterprise architecture and applicable reference models. Evaluate analytically and systematically problems of workflows, organization, and planning and develop appropriate corrective action. Provide daily supervision and direction to staff.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "190.58",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "15.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "technical,architect",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 7014,
      "price_list_id": 1030
    },
    {
      "contract_number": "47QTCA19D005F",
      "labor_category": "Business Analyst 4",
      "hourly_rate": 190.58,
      "source_sheet_name": "Price List",
      "source_row_number": 24,
      "raw_data": {
        "vendor_name": "IVORY CLOUD LLC",
        "unique_catalog_item_id": "IC-0022",
        "title": "Business Analyst 4",
        "description": "Demonstrate up-to-date expertise in Information Systems and apply this to the development, execution and improvement of action plans by providing advice and guidance to others in the application of information and best practices. Support and align efforts to meet customer and business needs. Manage customer relationships and expectations by developing a communication process to keep others up-to-date on project results. Stay current with customer needs and strategies; utilizing formal and informal written communication methods (for example, emails, newsletters, PowerPoint presentations, executive updates, task lists, updates) to communicate updates and findings; and facilitating project meetings and presentations to all types of diverse audiences (for example, senior management, Customers, technical staff). Lead or participate in multiple projects by completing and updating project documentation; managing project scope; adjusting schedules when necessary; determining daily priorities; ensuring efficient and on-time delivery of project tasks and milestones; following proper escalation paths; and managing customer and supplier relationships. Provide leadership to team members and peers by collaborating with others; articulating ideas and viewpoints to senior management, peers and others; identifying and initiating projects; managing resources; driving the resolution of issues; and holding self and team accountable for results. Identify, create and facilitate process design changes by conducting business and systems process analysis and design at a complex level; focusing on quality improvement and data management; ensuring data is reliable and valid; developing process improvements or re-engineering and recommending elimination; integrating new systems and processes with existing ones; and partnering with internal and external customers to ensure systems provided meet the long-term business strategies. Provide and support the implementation of business solutions by building relationships and partnerships with key stakeholders; identifying business needs; determining and carrying out necessary processes and practices; monitoring progress and results; recognizing and capitalizing on improvement opportunities; and adapting to competing demands, organizational changes and new responsibilities",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "190.58",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "15.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "business,analyst",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 7014,
      "price_list_id": 1030
    }
  ],
  "parsed_at": "2025-11-06T11:51:43.308683"
}