{
  "contract_number": "GS-00F-329GA",
  "contractor_id": 9367,
  "price_list_id": 653,
  "labor_categories": [
    {
      "contract_number": "GS-00F-329GA",
      "labor_category": "Consultant I",
      "hourly_rate": 105.2351,
      "source_sheet_name": "Price List",
      "source_row_number": 3,
      "raw_data": {
        "vendor_name": "OMNI CONSULTING SOLUTIONS LLC",
        "unique_catalog_item_id": "1.0",
        "title": "Consultant I",
        "description": "Consultant I is responsible for researching and applying standard business improvement techniques, procedures, and criteria in executing assigned tasks in business management areas to include contracts, finance, budgets, scheduling, project management, acquisition management and operational research. Conduct analysis of business processes related to the effectiveness of projects and programs. Consultant I may conduct studies of processes, procedures, identify potential problems, reviewing standards and practices, and making tentative recommendations for problem resolution through data analysis. Consultant I directly contributes to the execution and monitoring of projects and programs. This consultant level can work autonomously or as a contributing member of project team. Consultant I may assist in the research, development and publication of reports, studies, regulations, standard operating procedures and performance assessments. They may support the formulation and execution of project's resources in various department business systems.",
        "sin": "541219, 541611",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "105.2351",
        "gsa_price_with_iff__d_": "105.2351",
        "gsa_price_with_iff__e_": "108.3922",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "0.0",
        "education_and_experience_substitution": "Acceptable substitutions are an Associate degree with 2 years of related functional experience, a high school diploma with a PMP or CDFM and 2 years of related functional experience, or a high school diploma with 3 years of related functional experience.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Acceptable substitutions are an Associate degree with 2 years of related functional experience, a high school diploma with a PMP or CDFM and 2 years of related functional experience, or a high school diploma with 3 years of related functional experience.",
      "security_clearance": "No",
      "contractor_id": 9367,
      "price_list_id": 653
    },
    {
      "contract_number": "GS-00F-329GA",
      "labor_category": "Consultant II",
      "hourly_rate": 150.9156,
      "source_sheet_name": "Price List",
      "source_row_number": 4,
      "raw_data": {
        "vendor_name": "OMNI CONSULTING SOLUTIONS LLC",
        "unique_catalog_item_id": "2.0",
        "title": "Consultant II",
        "description": "Consultant II is responsible for researching and applying standard business improvement techniques, procedures, and criteria in executing assigned tasks in business management areas to include contracts, finance, budgets, scheduling, project management, acquisition management and operational research. This consultant level may hold certain direct responsibilities for guiding and training Consultant I and clients. With their increased work experience, they are given some responsibility to be self-directed while contributing to the execution and monitoring of projects and programs. Conduct analysis of business processes related to the effectiveness of projects and programs. Consultant II may conduct studies of processes, procedures, identify potential problems, reviewing standards and practices, and making tentative recommendations for problem resolution through data analysis. Consultant II directly contributes to the execution and monitoring of projects and programs. This consultant level can work autonomously as a contributing member of project team. Consultant II may assist in the research, development and publication of reports, studies, regulations, standard operating procedures and performance assessments. They may support the formulation and execution of project's resources in various department business systems.",
        "sin": "541219, 541611",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "150.9156",
        "gsa_price_with_iff__d_": "150.9156",
        "gsa_price_with_iff__e_": "155.4431",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "Acceptable substitutions are a Master’s degree with 1 year of related functional experience, a Bachelor’s degree with a PMP or CDFM and 1 year of related functional experience, or a high school diploma with 7 years of related functional experience.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Acceptable substitutions are a Master’s degree with 1 year of related functional experience, a Bachelor’s degree with a PMP or CDFM and 1 year of related functional experience, or a high school diploma with 7 years of related functional experience.",
      "security_clearance": "No",
      "contractor_id": 9367,
      "price_list_id": 653
    },
    {
      "contract_number": "GS-00F-329GA",
      "labor_category": "Consultant III",
      "hourly_rate": 168.6625,
      "source_sheet_name": "Price List",
      "source_row_number": 5,
      "raw_data": {
        "vendor_name": "OMNI CONSULTING SOLUTIONS LLC",
        "unique_catalog_item_id": "3.0",
        "title": "Consultant III",
        "description": "Consultant III is responsible for researching and applying standard business improvement techniques, procedures, and criteria in executing assigned tasks in business management areas to include contracts, finance, budgets, scheduling, project management, acquisition management and operational research. This consultant level hold certain direct responsibilities for guiding and training junior and clients. With their increased work experiences and diverse perspectives from contributions on multiple projects, they are given the responsibility to be self-directed and lead junior consultants while contributing to and leading certain aspects of the execution and monitoring of projects and programs. They conduct analysis and make recommendations for business processes related to the effectiveness of projects and programs. Consultant III may conduct studies of processes, procedures, identify potential problems, reviewing standards and practices, and making tentative recommendations for problem resolution through data analysis. This consultant level can work autonomously as a contributing member of project team. Consultant III may assist in and lead the research, development and publication of reports, studies, regulations, standard operating procedures and performance assessments. They may support and lead the formulation and execution of project's resources in various department business systems.",
        "sin": "541219, 541611",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "168.6625",
        "gsa_price_with_iff__d_": "168.6625",
        "gsa_price_with_iff__e_": "173.7224",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "7.0",
        "education_and_experience_substitution": "Acceptable substitutions are a Master’s degree with 5 years of related functional experience, a Bachelor’s degree with a PMP or CDFM and 5 years of related functional experience, or a high school diploma with 10 years of related functional experience.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Acceptable substitutions are a Master’s degree with 5 years of related functional experience, a Bachelor’s degree with a PMP or CDFM and 5 years of related functional experience, or a high school diploma with 10 years of related functional experience.",
      "security_clearance": "No",
      "contractor_id": 9367,
      "price_list_id": 653
    },
    {
      "contract_number": "GS-00F-329GA",
      "labor_category": "Consultant IV",
      "hourly_rate": 197.657,
      "source_sheet_name": "Price List",
      "source_row_number": 6,
      "raw_data": {
        "vendor_name": "OMNI CONSULTING SOLUTIONS LLC",
        "unique_catalog_item_id": "4.0",
        "title": "Consultant IV",
        "description": "Consultant IV is responsible for researching and applying standard business improvement techniques, procedures, and criteria in executing assigned tasks in business management areas to include contracts, finance, budgets, scheduling, project management, acquisition management and operational research. They have demonstrated the ability to lead others and projects through creativity and sound business decisions. Consultant IV may be given the responsibilities of management a team and stakeholders. They contributed directly to the formulation of project plans and execution and monitoring of projects. They may be assigned the responsibility to manage communication with stakeholders, program managers and peers. Consultants in this level will coordinate and manage assigned task to completion and quality standards. They may support and lead the formulation and execution of project's resources in various department business systems. They may be given responsibility to be a functional expert in one or more business management process or systems and are responsible for training within their functional expertise.",
        "sin": "541219, 541611",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "197.657",
        "gsa_price_with_iff__d_": "197.657",
        "gsa_price_with_iff__e_": "203.5867",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "education_and_experience_substitution": "Acceptable substitutions are a Master's degree with 8 years of related functional experience, a Bachelor’s degree with a PMP or CDFM and 8 years of related functional experience, or a high school diploma with 13 years of related functional experience.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Acceptable substitutions are a Master's degree with 8 years of related functional experience, a Bachelor’s degree with a PMP or CDFM and 8 years of related functional experience, or a high school diploma with 13 years of related functional experience.",
      "security_clearance": "No",
      "contractor_id": 9367,
      "price_list_id": 653
    },
    {
      "contract_number": "GS-00F-329GA",
      "labor_category": "Consultant V",
      "hourly_rate": 238.4244,
      "source_sheet_name": "Price List",
      "source_row_number": 7,
      "raw_data": {
        "vendor_name": "OMNI CONSULTING SOLUTIONS LLC",
        "unique_catalog_item_id": "5.0",
        "title": "Consultant V",
        "description": "Consultant V is responsible for the researching and applying of standard business improvement techniques, procedures, and criteria in executing assigned tasks in business management areas to include contracts, finance, budgets, scheduling, project management, acquisition management and operational research. They typically perform the following kinds of functions to include but not limited to: collecting, normalizing, and inputting data, performing in-depth research, reconciling complex data/information across multiple systems and reports, utilizing complex software in the development of analytical models, interpreting results to generate multiple recommended courses of action, comprehending and applying concepts/guidance, effectively implementing instructions/policies into routine performance, and developing tools/applications to foster efficiency in day-to-day activities. They may lead team(s) as aproject manager or business area lead. They may be given the responsibility of leading the initiation, planning, execution, monitoring and controlling and closing of project(s). Consultants of this level have experiences and breadth of knowledge from multiple projects and have experiences identifying potential problems and delivering recommendations for the effectiveness to business procedures, standards, regulations and structures. They have direct communication with program managers and provide advisory advices routinely. They make decisions and recommendations that are recognized as authoritative and have a far-reaching impact on extensive business activities. Consultants of this level have gain recognition as experts within their field and can advise peers and others with sound business advices related to business management best practices, procedures, standards, systems utilities and professional resources. Consultant V have progressive work experience leading to a role considered as a senior technical/business",
        "sin": "541219, 541611",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "238.4244",
        "gsa_price_with_iff__d_": "238.4244",
        "gsa_price_with_iff__e_": "245.5771",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "12.0",
        "education_and_experience_substitution": "Acceptable substitutions are a Master's degree with 10 years of related functional experience, a Bachelor’s degree with a PMP or CDFM and 10 years of related functional experience, or a high school diploma with 15 years of related functional experience.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Acceptable substitutions are a Master's degree with 10 years of related functional experience, a Bachelor’s degree with a PMP or CDFM and 10 years of related functional experience, or a high school diploma with 15 years of related functional experience.",
      "security_clearance": "No",
      "contractor_id": 9367,
      "price_list_id": 653
    },
    {
      "contract_number": "GS-00F-329GA",
      "labor_category": "Consultant VI",
      "hourly_rate": 305.8379,
      "source_sheet_name": "Price List",
      "source_row_number": 8,
      "raw_data": {
        "vendor_name": "OMNI CONSULTING SOLUTIONS LLC",
        "unique_catalog_item_id": "6.0",
        "title": "Consultant VI",
        "description": "Consultant VI makes decisions and recommendations that are recognized as authoritative and have a far-reaching impact on projects, programs and organizations. They may lead team(s) as a project manager or business area lead on one or more programs/divisions. These individuals are strategic thought leaders in their field and integrate across functional disciplines. Their strategic proficiency allows for efficient and effective business development. They anticipate and avoid unnecessary risks and challenges while challenging the status quo. These leaders can interpret complex and sometimes conflicting information to find optimal solutions. They apply their knowledge to synthesize information by recognizing patterns, push through ambiguity and seek new insights. They are decision makers in difficult times, find common ground, generate buy-in to their ideas, and strive to continuously advance the state of the art of their functional discipline. They are recognized as subject matter experts by peers and their professional community. They typically work independently to integrate multiple analyses and inputs to provide recommendations to senior leaders. They integrate products and recommendations from multiple functional teams. They possess experience in planning, organizing, controlling and directing the technical, administrative, financial, contractual, and personnel actions required in the performance of a contract.",
        "sin": "541219, 541611",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "305.8379",
        "gsa_price_with_iff__d_": "305.8379",
        "gsa_price_with_iff__e_": "315.013",
        "minimum_education": "Masters",
        "minimum_years_of_education": "15.0",
        "education_and_experience_substitution": "Acceptable substitutions are a PhD degree with 10 years of related functional experience, a Master’s degree with a PMP or CDFM and 13 years of related functional experience, a Bachelor’s degree with a PMP or CDFM and 15 years of related functional experience, a Bachelor’s degree with 17 years of related functional experience, or a high school diploma with 21 years of related functional experience.",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Masters",
      "years_experience": "Acceptable substitutions are a PhD degree with 10 years of related functional experience, a Master’s degree with a PMP or CDFM and 13 years of related functional experience, a Bachelor’s degree with a PMP or CDFM and 15 years of related functional experience, a Bachelor’s degree with 17 years of related functional experience, or a high school diploma with 21 years of related functional experience.",
      "security_clearance": "No",
      "contractor_id": 9367,
      "price_list_id": 653
    }
  ],
  "parsed_at": "2025-11-06T11:53:25.221942"
}