{
  "contract_number": "GS-00F-162CA",
  "contractor_id": 9549,
  "price_list_id": 1429,
  "labor_categories": [
    {
      "contract_number": "GS-00F-162CA",
      "labor_category": "Executive Director",
      "hourly_rate": 243.0428,
      "source_sheet_name": "Price List",
      "source_row_number": 3,
      "raw_data": {
        "vendor_name": "RACK-WILDNER & REESE, INC.",
        "unique_catalog_item_id": "Akoya-00001",
        "title": "Executive Director",
        "description": "Provide executive consulting to heads of agencies, directors, and senior managers on organizational change, and communications activities that require senior executive level experience because of the activities’ potential for significant public attention, financial or operational effect on the organization, or the potential to result in legislative or regulatory changes that will affect the organization.  Lead a team of senior executive consultants in organizational change and communications activities in support of organization-wide management, organization, and business improvements.  Develop, lead, and conduct senior executive level workshops, conferences, training sessions, and pilot projects that require senior executive level experience to properly address the use of approaches, processes, tools, or theories for management, organization, or business improvement.  Develop and conduct senior executive level workshops, conferences, training sessions, and pilot projects that require senior executive level experience in leading or managing organization-wide activities.  Facilitate business, organizational, and management improvement or organizational change, and communications activities that require a mastery of the respective area of expertise, or in situations where the use of a consultant with senior executive level experience will enable the customer to have the necessary level of confidence that the activities will be successfully conducted.  Assist in identifying and resolving critical issues, including giving feedback and negotiating change activities with top level officials, if necessary. Customize workshops, conferences, and courses for an organization’s needs that call for senior executive level experience due to the intricate or complicated nature of the activity or complexity of the issue to be addressed.  Make presentations or give speeches relating to organizational change.",
        "sin": "541810, 541820, 541511, 541611, 561920, 512110, 541910, 541430, 541613, 541690",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "243.0428",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "20.0",
        "education_and_experience_substitution": "Masters + 15 Years of Experience   PHD + 10 Years of Experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Executive,Consulting,Facilitate,Lead,Management",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Masters + 15 Years of Experience   PHD + 10 Years of Experience",
      "security_clearance": "No",
      "contractor_id": 9549,
      "price_list_id": 1429
    },
    {
      "contract_number": "GS-00F-162CA",
      "labor_category": "Sr. Executive Consultant I",
      "hourly_rate": 210.1864,
      "source_sheet_name": "Price List",
      "source_row_number": 4,
      "raw_data": {
        "vendor_name": "RACK-WILDNER & REESE, INC.",
        "unique_catalog_item_id": "Akoya-00010",
        "title": "Sr. Executive Consultant I",
        "description": "Provide executive consulting to heads of agencies, directors, and senior managers on organizational change and communications activities, with a special focus on the Akoya strategic framework mapping process.  Through the use of the Akoya strategic framework mapping process, assist in strategic planning and characterization of key business drivers, communications plans, and process improvements, and assist with analysis of operational, service-quality, and customer-related performance.  Assist heads of organizations, directors, and senior managers in analyzing complex organizational, communications, and technical problems, and in structuring information for their solution.  Lead a team of senior executive consultants in organizational change and communications activities in support of management, organization, and business improvements organization-wide.  Develop, lead, and conduct senior executive level workshops and pilot projects that require senior executive level experience to properly address the use of approaches, processes, tools, or theories for management, organization, or business improvement.  Develop and conduct senior executive level workshops, conferences, and pilot projects that require senior executive level experience in leading or managing organization-wide activities.  Customize workshops, conferences, and courses for an organization’s needs that call for senior executive level experience due to the intricate or complicated nature of the activity or issue to be addressed.  Oversee negotiation of delivery/task orders and design phases of tasks. Plan and organize resources to accomplish communication tasks.  Provide senior level management in coordination of communication efforts with all federal agency executives and senior level managers.  Plan, organize, and oversee work efforts; assign and manage resources; supervise personnel; ensure quality management; and monitor overall project and contract performance.  Make presentations or give speeches relating to organizational change.",
        "sin": "541810, 541820, 541511, 541611, 561920, 512110, 541910, 541430, 541613, 541690",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "210.1864",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "15.0",
        "education_and_experience_substitution": "Masters + 10 Years of Experience  PHD + 7 Years of Experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Executive,Consulting,Facilitate,Lead,Management",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Masters + 10 Years of Experience  PHD + 7 Years of Experience",
      "security_clearance": "No",
      "contractor_id": 9549,
      "price_list_id": 1429
    },
    {
      "contract_number": "GS-00F-162CA",
      "labor_category": "Sr. Executive Consultant II",
      "hourly_rate": 184.3708,
      "source_sheet_name": "Price List",
      "source_row_number": 5,
      "raw_data": {
        "vendor_name": "RACK-WILDNER & REESE, INC.",
        "unique_catalog_item_id": "Akoya-00011",
        "title": "Sr. Executive Consultant II",
        "description": "• Provide executive consulting to senior managers on strategic planning and technology transfer. • Develop and conduct senior executive level workshops, conferences, and pilot projects that require senior executive level experience in leading or managing organization-wide activities. • Customize workshops and conferences for an organization’s needs in strategic planning and policy development that call for senior executive level experience due to the intricate or complicated nature of the activity or issue to be addressed. • Oversee negotiation of delivery/task orders and design phases of tasks. Plan and organize resources to accomplish communication tasks. • Oversee negotiation of delivery/task orders and design phases of event tasks. Plan and organize resources to accomplish tasks including:  o Ascertain client needs for the event in terms of budget as well as desired location(s), ease of travel, per diem costs, sleeping room requirements, facility requirements, A/V, food and beverage, internet access, parking, public transportation, etc.  o Ascertain audiovisual requirements, including projection of still images and video, sound system, and remote broadcasts.  o Negotiate with, and collect information related to per diem rates, amenities, and concessions, from venues qualified to host the event.  o Provide a cost-comparison document to the client and assist senior leaders in analyzing data sets for each venue under consideration.  o Represent the client on site visits to inspect venues under consideration.  o Conduct final negotiations with the facility and provide final terms to client for approval.  o Advise senior leaders on event themes, topics, and speakers.  o Lead the development effort for all online information that will be used to publicize the event, including online registration forms, a registration database, registration-related emails, and hotel/travel/local area information.  o Lead the development of all print documents used to conduct the event, including the design, writing, editing, and production of pocket folders, handouts, brochures, fact sheets, local information, hotel maps, wall banners, navigational signage, name tags, programs, etc.  o Obtain hotel reservation numbers with which to update the client.  o Organize and coordinate local site tours as needed.  o Set up any pre-meetings, side meetings, lunches, and post-event sessions necessary.  o Provide onsite management during the entirety of the event.  o Oversee post-event mailings, shipping, and cleanup.  o Create surveys to ascertain the effectiveness of the event.  o Reconcile the facility invoice and settle the account on behalf of the client. • Provide senior level management in coordination of event efforts with all federal agency executives and senior level managers. • Plan, organize, and oversee work efforts; assign and manage resources; supervise personnel; ensure quality management; and monitor overall project and contract performance.",
        "sin": "541810, 541820, 541511, 541611, 561920, 512110, 541910, 541430, 541613, 541690",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "184.3708",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "education_and_experience_substitution": "Masters + 7 Years of Experience  PHD + 5 Years of Experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Executive,Consulting,Oversee,Negotiation,Planning",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Masters + 7 Years of Experience  PHD + 5 Years of Experience",
      "security_clearance": "No",
      "contractor_id": 9549,
      "price_list_id": 1429
    },
    {
      "contract_number": "GS-00F-162CA",
      "labor_category": "Sr. Executive Consultant III",
      "hourly_rate": 178.2932,
      "source_sheet_name": "Price List",
      "source_row_number": 6,
      "raw_data": {
        "vendor_name": "RACK-WILDNER & REESE, INC.",
        "unique_catalog_item_id": "Akoya-00012",
        "title": "Sr. Executive Consultant III",
        "description": "• Facilitate business, organizational, and management improvement in organizational change, strategic planning, and policy development  activities, where the use of a consultant with senior executive level experience will enable the customer to have the necessary level of  confidence that the activities will be successful. • Assist in the use of the Akoya strategic framework mapping process in strategic planning, policy assessments, and characterization of key  business drivers, communications plans, and process improvements, and assist with analysis of operational, service quality, and customer related performance. • Provide executive consulting to heads of agencies, directors, and senior managers on the management, considerations, parameters, and  execution of conferences, meetings, and other organized gatherings. • Through the use of the Akoya strategic communications planning process, assist in strategic planning and characterization of key goals,  audiences, messages, and delivery options. • Oversee negotiation of delivery/task orders and design phases of event tasks. Plan and organize resources to accomplish tasks including:   Advise senior leaders on event themes, topics, and speakers.   Lead the development effort for all online information that will be used to publicize the event, including online registration forms, a  registration database, registration-related emails, and hotel/travel/local area information.   Lead the development of all print documents used to conduct the event, including the design, writing, editing, and production  of pocket folders, handouts, brochures, fact sheets, local information, hotel maps, wall banners, navigational signage, name tags,  programs, etc.   Create surveys to ascertain the effectiveness of the event. • Provide senior level management in coordination of event efforts with all federal agency executives and senior level managers. • Plan, organize, and oversee work efforts; assign and manage resources; supervise personnel; ensure quality management; and monitor  overall project and contract performance",
        "sin": "541810, 541820, 541511, 541611, 561920, 512110, 541910, 541430, 541613, 541690",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "178.2932",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "7.0",
        "education_and_experience_substitution": "Masters + 5 Years of Experience  PHD + 3 Years of Experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Management,Executive,Consulting,Planning,Oversee",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Masters + 5 Years of Experience  PHD + 3 Years of Experience",
      "security_clearance": "No",
      "contractor_id": 9549,
      "price_list_id": 1429
    },
    {
      "contract_number": "GS-00F-162CA",
      "labor_category": "Communications Director",
      "hourly_rate": 167.5919,
      "source_sheet_name": "Price List",
      "source_row_number": 7,
      "raw_data": {
        "vendor_name": "RACK-WILDNER & REESE, INC.",
        "unique_catalog_item_id": "Akoya-00020",
        "title": "Communications Director",
        "description": "• Provide executive consulting to senior managers on communications planning and various aspects of video production and event planning. • Customize workshops and conferences for an organization’s needs that call for senior executive level experience due to the intricate or  complicated nature of the activity or issue to be addressed. • Facilitate high-level problem solving on communication issues. • Direct and/or draft high-level materials. • Plan, organize, staff, direct, and manage performance of work associated with event task orders within the relevant subject matter domain  of the project and the Principal Consultant’s practice area. • Fully responsible for providing technical guidance and expertise to project staff and ensuring that the methods, tools, and techniques  applied in performance of the work represent the state of the art. • Responsible for monitoring the technical quality of work products and ensuring that products meet quality standards. Substantially  contributes to product content. • In coordination with contract and task order management, plan work efforts, ensuring that schedules and budgets are appropriate for  accomplishment of project objectives, and direct the work efforts of project staff. • Work with customers in providing consultative advice in areas of expertise.",
        "sin": "541810, 541820, 541511, 541611, 561920, 512110, 541910, 541430, 541613, 541690",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "167.5919",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "education_and_experience_substitution": "Masters + 7 Years of Experience  PHD + 5 Years of Experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Executive,Consulting,Communications,Organize,Monitoring",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Masters + 7 Years of Experience  PHD + 5 Years of Experience",
      "security_clearance": "No",
      "contractor_id": 9549,
      "price_list_id": 1429
    },
    {
      "contract_number": "GS-00F-162CA",
      "labor_category": "Senior Communications Consultant I",
      "hourly_rate": 117.3209,
      "source_sheet_name": "Price List",
      "source_row_number": 8,
      "raw_data": {
        "vendor_name": "RACK-WILDNER & REESE, INC.",
        "unique_catalog_item_id": "Akoya-00030",
        "title": "Senior Communications Consultant I",
        "description": "• Provide consulting to senior managers on communications planning and implementation. • Lead a team of senior consultants in communications planning in support of organization-wide management, organization, and business  improvements. • Develop and conduct senior level workshops and conferences, and assist in developing and conducting pilot projects that require senior  level experience in leading or managing organization- wide activities. • Structure team processes to identify, assess, and resolve issues related to communications and customer satisfaction. • Facilitate team problem-solving on communication issues. • Draft important materials. • Plan, organize, staff, direct, and manage performance of work associated with event subtasks within the relevant subject matter domain of  the project and the consultant’s practice area to include:   Participate in meetings with senior leaders regarding the management, considerations, parameters, and execution of conferences,  meetings, and other organized gatherings.   Collect data from possible venues and compile into documents for review by the client.   Create and program electronic surveys to assess the effectiveness of the event. • Provide technical guidance and expertise to project staff, ensuring that the methods, tools, and techniques applied in performance of the  work reflect the state of the art. Contribute substantially to project work products and activities and monitor the technical quality of work  products, ensuring that products meet quality standards. • Plan work efforts, ensuring that schedules and budgets are appropriate for accomplishment of project objectives, and direct the work  efforts of project staff. • Work with customers in providing consultative advice in areas of expertise. • Work independently or under the general guidance of the Principal Consultant.",
        "sin": "541810, 541820, 541511, 541611, 561920, 512110, 541910, 541430, 541613, 541690",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "117.3209",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "7.0",
        "education_and_experience_substitution": "Masters + 5 Years of Experience  PHD + 3 Years of Experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Consulting,Communications,Support,Workshops,Plan",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Masters + 5 Years of Experience  PHD + 3 Years of Experience",
      "security_clearance": "No",
      "contractor_id": 9549,
      "price_list_id": 1429
    },
    {
      "contract_number": "GS-00F-162CA",
      "labor_category": "Senior Communications Consultant II",
      "hourly_rate": 103.738,
      "source_sheet_name": "Price List",
      "source_row_number": 9,
      "raw_data": {
        "vendor_name": "RACK-WILDNER & REESE, INC.",
        "unique_catalog_item_id": "Akoya-00031",
        "title": "Senior Communications Consultant II",
        "description": "• Provide consulting on communications planning and implementation. • Assist senior consultants in communications planning and facilitation in support of organization-wide management, organization, and  business improvements. • Develop and conduct workshops and assist in developing and conducting conferences that require experience in leading or managing  communications activities. • Assist in identifying, assessing, and resolving issues related to communications and customer satisfaction. • Assist with facilitation of team problem-solving on communication issues. • Draft materials as needed. • Develop presentations relating to communications. • Under the technical guidance and expertise of Principal and Senior Consultants, contribute substantially to the performance of event  project activities and the preparation of work products including:   Create online and email forms and documents in support of the registration effort.   Create informational web sites or web pages in support of the event.   Provide onsite meeting and registration support. • Under the technical guidance and expertise of Principal and Senior Consultants, contributes substantially to the performance of project  activities and the preparation of work products including:   Operate highly technical audio or other video production support equipment.   Advise the director and producer on issues related to sound quality and acoustics on a video location.   Assist with setup and teardown of video production equipment as needed. • Ensure that the methods, tools, and techniques applied in performance of the work reflect the state of the art. • Monitor the quality of work products, ensuring that products meet quality standards. • Assist in planning work efforts, ensuring that schedules and budgets are appropriate for accomplishment of project objectives. • Some interaction with customers in providing consultative advice in areas of expertise. • Work as part of project team, with technical and managerial guidance provided; may be required to work independently.",
        "sin": "541810, 541820, 541511, 541611, 561920, 512110, 541910, 541430, 541613, 541690",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "103.738",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "Masters + 3 Years of Experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Consulting,Planning,Workshops,Technical Guidance,Communications",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Masters + 3 Years of Experience",
      "security_clearance": "No",
      "contractor_id": 9549,
      "price_list_id": 1429
    },
    {
      "contract_number": "GS-00F-162CA",
      "labor_category": "Senior Communications Consultant III",
      "hourly_rate": 100.5552,
      "source_sheet_name": "Price List",
      "source_row_number": 10,
      "raw_data": {
        "vendor_name": "RACK-WILDNER & REESE, INC.",
        "unique_catalog_item_id": "Akoya-00032",
        "title": "Senior Communications Consultant III",
        "description": "• Provide consulting on communications planning and implementation. • Assist senior consultants in communications planning and facilitation in support of organization-wide management, organization, and  business improvements. • Develop and conduct workshops and assist in developing and conducting conferences that require experience in leading or managing  communications activities. • Assist in designing and conducting facilitation services in support of communications planning and process improvement. • Customize workshops and conferences for an organization’s needs that require communications experience. • Assist in identifying, assessing, and resolving issues related to communications and customer satisfaction. • Assist with facilitation of team problem-solving on communication issues. • Draft materials as needed. • Develop presentations relating to communications",
        "sin": "541810, 541820, 541511, 541611, 561920, 512110, 541910, 541430, 541613, 541690",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "100.5552",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Consulting,Workshops,Facilitation Services,Communications",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 9549,
      "price_list_id": 1429
    },
    {
      "contract_number": "GS-00F-162CA",
      "labor_category": "Communications Specialist I",
      "hourly_rate": 80.6851,
      "source_sheet_name": "Price List",
      "source_row_number": 11,
      "raw_data": {
        "vendor_name": "RACK-WILDNER & REESE, INC.",
        "unique_catalog_item_id": "Akoya-00040",
        "title": "Communications Specialist I",
        "description": "• Assist communications consultants in providing consulting on communications planning and implementation. • Research information based on guidance provided by subject matter experts, and compile summaries. • Draft fact sheets, articles, booklets, reports, and plans based on factual information provided by subject matter experts. • Assist in conducting facilitation services in support of communications planning and related process improvement. • Participate in the planning, organizing, management, and performance of work associated with event subtasks including:   Assemble handout materials for distribution to event attendees.   Maintain the event database containing names and contact information of attendees",
        "sin": "541810, 541820, 541511, 541611, 561920, 512110, 541910, 541430, 541613, 541690",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "80.6851",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Communications,Research,Management,Planning,Implementation",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 9549,
      "price_list_id": 1429
    },
    {
      "contract_number": "GS-00F-162CA",
      "labor_category": "Communications Specialist II",
      "hourly_rate": 70.0494,
      "source_sheet_name": "Price List",
      "source_row_number": 12,
      "raw_data": {
        "vendor_name": "RACK-WILDNER & REESE, INC.",
        "unique_catalog_item_id": "Akoya-00041",
        "title": "Communications Specialist II",
        "description": "• Assist communications consultants in structuring and editing communications documents. • Research information based on guidance provided by subject-matter experts, and compile summaries. • Draft, review, and revise written communications, using The Chicago Manual of Style or other recognized writing standards. • Provide expert assistance in preparing documents for publication",
        "sin": "541810, 541820, 541511, 541611, 561920, 512110, 541910, 541430, 541613, 541690",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "70.0494",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Communications,Research,Draft,Review,Prepare",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 9549,
      "price_list_id": 1429
    },
    {
      "contract_number": "GS-00F-162CA",
      "labor_category": "Communications Specialist III",
      "hourly_rate": 58.3395,
      "source_sheet_name": "Price List",
      "source_row_number": 13,
      "raw_data": {
        "vendor_name": "RACK-WILDNER & REESE, INC.",
        "unique_catalog_item_id": "Akoya-00042",
        "title": "Communications Specialist III",
        "description": "• Assist in drafting fact sheets, articles, booklets, reports, and plans based on factual information provided by subject-matter experts. • Research information based on guidance provided by subject-matter experts, and compile summaries. • Draft, review, and revise written communications, using The Chicago Manual of Style or other recognized writing standards. • Provide assistance in preparing documents for publication. • Under the technical guidance and expertise of practice area consultants and project management staff, contribute substantially to the  performance of project activities and the preparation of work products including:   Assist the video production team in the pre-production phase through mailings, research, communications with talent and  locations, etc.   Work to support the video production in terms of relaying messages, setting up and tearing down equipment, assisting with  makeup, wardrobe, and props, and purchasing supplies.   Maintain video production paperwork, including script notes, continuity, and talent releases. • Provide state-of-the-art methods, tools, and techniques in performance",
        "sin": "541810, 541820, 541511, 541611, 561920, 512110, 541910, 541430, 541613, 541690",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "58.3395",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "0.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Communications,Research,Prepare Work Products",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 9549,
      "price_list_id": 1429
    },
    {
      "contract_number": "GS-00F-162CA",
      "labor_category": "Sr. Info/Graphic Design Consultant I",
      "hourly_rate": 162.0776,
      "source_sheet_name": "Price List",
      "source_row_number": 14,
      "raw_data": {
        "vendor_name": "RACK-WILDNER & REESE, INC.",
        "unique_catalog_item_id": "Akoya-00050",
        "title": "Sr. Info/Graphic Design Consultant I",
        "description": "Provide executive consulting to senior executive managers on conceptualizing and implementing information and graphic design in  strategic communications. • Manage a team of graphic designers in conceptualizing and implementing information and graphic design concepts, graphic and visual  supporting elements, structure, and format for internal and external communications. • Facilitate and conduct planning meetings involving senior executive managers to brainstorm and develop information and graphic design  concepts and strategies for effective communications. • Direct the application of new technologies and processes for development and production of information and graphic design. • Manage multiple information and graphic design projects through development, execution, and production. • Lead multiple projects that involve conceptualizing, structuring, and presenting information and graphic design. • Generate information and graphic design communication products.",
        "sin": "541810, 541820, 541511, 541611, 561920, 512110, 541910, 541430, 541613, 541690",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "162.0776",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "15.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Executive,Consulting,Manage,Graphic Design",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 9549,
      "price_list_id": 1429
    },
    {
      "contract_number": "GS-00F-162CA",
      "labor_category": "Sr. Info /Graphic Design Consultant II",
      "hourly_rate": 129.3451,
      "source_sheet_name": "Price List",
      "source_row_number": 15,
      "raw_data": {
        "vendor_name": "RACK-WILDNER & REESE, INC.",
        "unique_catalog_item_id": "Akoya-00051",
        "title": "Sr. Info /Graphic Design Consultant II",
        "description": "• Provide consulting to senior managers on implementing information and graphic design aspects of strategic communications. • Manage a team of graphic designers in implementing information and graphic design concepts, graphic and visual supporting elements,  structure, and format for internal and external communications. • Facilitate and conduct planning meetings involving senior managers to brainstorm and develop information and graphic design concepts  and strategies for effective communications. • Apply new technologies and processes for development and production of information and graphic design. • Manage information and graphic design projects through development, execution, and production. • Lead projects that involve conceptualizing, structuring, and presenting information and graphic design. • Generate information and graphic design for communication products.",
        "sin": "541810, 541820, 541511, 541611, 561920, 512110, 541910, 541430, 541613, 541690",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "129.3451",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Consulting,Graphic Design,Implementing,Strategic Communications",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 9549,
      "price_list_id": 1429
    },
    {
      "contract_number": "GS-00F-162CA",
      "labor_category": "Program Support Manager",
      "hourly_rate": 63.6967,
      "source_sheet_name": "Price List",
      "source_row_number": 16,
      "raw_data": {
        "vendor_name": "RACK-WILDNER & REESE, INC.",
        "unique_catalog_item_id": "Akoya-00060",
        "title": "Program Support Manager",
        "description": "• Develop and implement procedures, tailored if necessary, to coordinate the production of project documents and to ensure full program  support throughout the process. • Provide management and oversight of the full program support team. • Perform specialized administrative support tasks of non-routine and non-repetitive nature to assist principal, administrative or manager/ directors. • Assigned professional level tasks requiring independent judgment, initiative and tact. • Contacts may include all levels of company and may be confidential in nature. • Involves a thorough knowledge of company procedures and services. • Accountable for assigned projects",
        "sin": "541810, 541820, 541511, 541611, 561920, 512110, 541910, 541430, 541613, 541690",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "63.6967",
        "minimum_education": "High_School",
        "minimum_years_of_education": "5.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Procedures,Program Support,Management,Specialized",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "High_School",
      "security_clearance": "No",
      "contractor_id": 9549,
      "price_list_id": 1429
    },
    {
      "contract_number": "GS-00F-162CA",
      "labor_category": "Administrative Support Specialist",
      "hourly_rate": 46.9965,
      "source_sheet_name": "Price List",
      "source_row_number": 17,
      "raw_data": {
        "vendor_name": "RACK-WILDNER & REESE, INC.",
        "unique_catalog_item_id": "Akoya-00070",
        "title": "Administrative Support Specialist",
        "description": "Support the consulting, facilitation, training, communications, and survey services by organizing, coordinating, and implementing technical  and administrative support for all client projects. • Assist client communication through the use of the Internet. • Input and manage databases.",
        "sin": "541810, 541820, 541511, 541611, 561920, 512110, 541910, 541430, 541613, 541690",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "46.9965",
        "minimum_education": "High_School",
        "minimum_years_of_education": "0.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Support,Input and Manage Databases",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "High_School",
      "security_clearance": "No",
      "contractor_id": 9549,
      "price_list_id": 1429
    },
    {
      "contract_number": "GS-00F-162CA",
      "labor_category": "Organizational Development Director",
      "hourly_rate": 226.2469,
      "source_sheet_name": "Price List",
      "source_row_number": 18,
      "raw_data": {
        "vendor_name": "RACK-WILDNER & REESE, INC.",
        "unique_catalog_item_id": "Akoya-00080",
        "title": "Organizational Development Director",
        "description": "• Provide executive consulting to agency heads, directors, and senior managers on organizational and individual development activities  requiring senior executive level experience because the activities have potential for profound public attention, financial or operational  effect on the organization, or the potential to result in legislative or regulatory changes that will affect the organization. • Conceptualize, plan, and implement a system-wide approach to staff development that moves the organization toward its vision and  mission, supports the efforts of the agency heads, directors, and senior managers, and best uses resources to maximize results. • Lead a team of senior executive consultants in organizational change, training, and communications activities in support of organization wide management, organization, and business improvements. • Develop, lead, and conduct senior executive level workshops, conferences, training sessions and pilot projects that require senior executive  level experience to successfully apply the use of approaches, processes, tools, or theories for organizational development. • Design curriculum and/or evaluate off-the-shelf programs for quality, consistency, and relevance to the overall needs of the organization. • Facilitate business, organizational, and management improvement in organizational change, training, and communications activities that  require a mastery of the respective area of expertise, or in situations where the use of a consultant with senior executive level experience  will enable the customer to have the necessary level of confidence that the activities will be successful. • Create and educate high-impact teams of individuals with equal responsibility but with different needs and agendas to further the  development of the organization. • Facilitate cross-functional, cross-level teams to enable them to handle issues that arise from involvement of participants with differing  status and/or position. • Make presentations, give speeches, and write articles relating to organizational and individual development.",
        "sin": "541611, 541613, 541690",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "226.2469",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "20.0",
        "education_and_experience_substitution": "Masters + 15 Years of Experience  PHD + 10 Years of Experience",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Executive,Consulting,Lead,Facilitate,High-Impact",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Masters + 15 Years of Experience  PHD + 10 Years of Experience",
      "security_clearance": "No",
      "contractor_id": 9549,
      "price_list_id": 1429
    },
    {
      "contract_number": "GS-00F-162CA",
      "labor_category": "Sr. Information Graphic Designer III",
      "hourly_rate": 80.0695,
      "source_sheet_name": "Price List",
      "source_row_number": 19,
      "raw_data": {
        "vendor_name": "RACK-WILDNER & REESE, INC.",
        "unique_catalog_item_id": "Akoya-00090",
        "title": "Sr. Information Graphic Designer III",
        "description": "• Provide consulting to managers on information and graphic design to support internal and external communications. • Manage projects that involve conceptualizing, structuring, presenting, executing, and producing information and graphic design. • Conduct planning meetings to brainstorm and develop information and graphic design concepts and strategies for effective  communications. • Apply technologies and processes for development and production of information and graphic design. • Generate information and graphic design for communication products.",
        "sin": "541611, 541613, 541690",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "80.0695",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Consulting,Graphic Design,Manage,Development",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 9549,
      "price_list_id": 1429
    },
    {
      "contract_number": "GS-00F-162CA",
      "labor_category": "Information Graphic Designer",
      "hourly_rate": 73.73,
      "source_sheet_name": "Price List",
      "source_row_number": 20,
      "raw_data": {
        "vendor_name": "RACK-WILDNER & REESE, INC.",
        "unique_catalog_item_id": "Akoya-00091",
        "title": "Information Graphic Designer",
        "description": "• Be responsible for aspects of projects that involve conceptualizing, structuring, presenting, executing, and producing information and  graphic design. • Develop information and graphic designs for effective communications. • Apply technologies and processes for development and production of information and graphic design. • Generate information and graphic design for communication products",
        "sin": "541611, 541613, 541690",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "73.73",
        "minimum_education": "Associates",
        "minimum_years_of_education": "0.0",
        "education_and_experience_substitution": "Equivalent Design Certification",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Present,Execute,Graphics Design,Develop,Communications",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Associates",
      "years_experience": "Equivalent Design Certification",
      "security_clearance": "No",
      "contractor_id": 9549,
      "price_list_id": 1429
    },
    {
      "contract_number": "GS-00F-162CA",
      "labor_category": "Program Support Specialist",
      "hourly_rate": 48.6207,
      "source_sheet_name": "Price List",
      "source_row_number": 21,
      "raw_data": {
        "vendor_name": "RACK-WILDNER & REESE, INC.",
        "unique_catalog_item_id": "Akoya-00100",
        "title": "Program Support Specialist",
        "description": "• Based on experience working in program support, assist the program manager with approaches for structuring deliverables for submission  to clients. • Research information to assist in providing program support. • Provide simple analysis of data obtained through research or provided by subject matter specialists for the purpose of helping to present  the information in reports.",
        "sin": "541611, 541613, 541690",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "48.6207",
        "minimum_education": "High_School",
        "minimum_years_of_education": "3.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Program Support,Structure,Deliverables,Research",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "High_School",
      "security_clearance": "No",
      "contractor_id": 9549,
      "price_list_id": 1429
    },
    {
      "contract_number": "GS-00F-162CA",
      "labor_category": "Computer System Analyst",
      "hourly_rate": 72.931,
      "source_sheet_name": "Price List",
      "source_row_number": 22,
      "raw_data": {
        "vendor_name": "RACK-WILDNER & REESE, INC.",
        "unique_catalog_item_id": "Akoya-00110",
        "title": "Computer System Analyst",
        "description": "• Support the management, organizational, or business improvement process by providing specific technical expertise in the area of  computer software applications. • Assist in applying computer technology in analyzing and developing electronic communications via the Internet. • Develop project tracking systems, incorporating records, files, and documents using desktop hardware and software.",
        "sin": "541611, 541613, 541690",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "72.931",
        "minimum_education": "Associates",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "Equivalent Technical Certification",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Support,Technical Experise,Computer,Software,Applications",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Associates",
      "years_experience": "Equivalent Technical Certification",
      "security_clearance": "No",
      "contractor_id": 9549,
      "price_list_id": 1429
    },
    {
      "contract_number": "GS-00F-162CA",
      "labor_category": "Word Processor",
      "hourly_rate": 42.137,
      "source_sheet_name": "Price List",
      "source_row_number": 23,
      "raw_data": {
        "vendor_name": "RACK-WILDNER & REESE, INC.",
        "unique_catalog_item_id": "Akoya-00120",
        "title": "Word Processor",
        "description": "• Support the preparation of draft and final deliverable documents by proofreading documents, drafting letters forwarding information to  clients, and applying computer graphics and spreadsheet programs. • Assist in locating and duplicating materials as needed for project support. • Provide assistance in making travel arrangements and obtaining pertinent information regarding reimbursements for travel. • Input and manage databases.",
        "sin": "541611, 541613, 541690",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "42.137",
        "minimum_education": "High_School",
        "minimum_years_of_education": "0.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Support,Proofreading,Drafting,Input and Mange Databases",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "High_School",
      "security_clearance": "No",
      "contractor_id": 9549,
      "price_list_id": 1429
    }
  ],
  "parsed_at": "2025-11-06T11:47:36.612386"
}