{
  "contract_number": "GS-00F-177DA",
  "contractor_id": 5368,
  "price_list_id": 1199,
  "labor_categories": [
    {
      "contract_number": "GS-00F-177DA",
      "labor_category": "Director/Principal",
      "hourly_rate": 314.31,
      "source_sheet_name": "Price List",
      "source_row_number": 3,
      "raw_data": {
        "vendor_name": "FACILITY PROGRAMMING LTD",
        "unique_catalog_item_id": "001-SERVICES",
        "title": "Director/Principal",
        "description": "This position is responsible for overseeing all areas of the firm. Provides leadership to position the company at the forefront of the industry. Defines the long and short- term objectives of the firm. Develops a strategic operating plan to achieve these objectives and to promote revenue, profitability and growth as an organization. Oversees company operations to ensure production efficiency, quality, service and cost-effective management of resources. Evaluates performance and contributions of the senior staff in achieving the established objectives. Promotes a culture that reflects the firm’s values, encourages good performance and rewards productivity. Recruits and directs Human Resources for the firm. Establishes and disseminates professional standards, guidelines and procedures to the firm. Provides guidance and is responsible to inspire, motivate, and mentor the staff. Serves as advisor to senior management. Participates in the development and implementation of professional development programs and coordinates with senior management to ensure participation. Participates in and provides direction for all quality assurance initiatives Responsible for all initiatives that support, promote and improve the services offered by the firm. Directs any initiatives required to keep the services provided by the firm current, effective, value-added and best in class. Keeps senior management informed of these developments and engages their input on process improvement. Builds and maintains effective relationships with existing and potential clients to generate new business opportunities. Maintains high public visibility, acting as a representative of the firm internally and through participation in external functions, events and industry related organizations.  Requirement of 15 years related experience in architectural or similar business management. Bachelor’s degree in Planning, Architecture, Engineering or related field required; Master’s degree in related field or MBA preferred.",
        "sin": "541611.0",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "314.31",
        "gsa_price_with_iff__a_": "320.28",
        "gsa_price_with_iff__b_": "326.37",
        "gsa_price_with_iff__c_": "332.57",
        "gsa_price_with_iff__d_": "338.89",
        "gsa_price_with_iff__e_": "345.33",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "15.0",
        "security_clearance_required": "No",
        "minimum_security_clearance_level": "T1",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Architectural Programming,Strategic Facility Planning,Pre-design and Pre-project Planning,Space Utilization,Needs Assessment and Feasibility Studies",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 5368,
      "price_list_id": 1199
    },
    {
      "contract_number": "GS-00F-177DA",
      "labor_category": "Senior Consultant/Team Leader",
      "hourly_rate": 258.77,
      "source_sheet_name": "Price List",
      "source_row_number": 4,
      "raw_data": {
        "vendor_name": "FACILITY PROGRAMMING LTD",
        "unique_catalog_item_id": "002-SERVICES",
        "title": "Senior Consultant/Team Leader",
        "description": "This position reports directly to Director/Principal. This position is responsible for overseeing the operational areas of the firm, as well as one or more project teams; each team is responsible for multiple projects at any one time. Assists the Director in developing the strategic operating plan of the firm. Directs day-to-day operations of the firm to ensure production efficiency, quality, service and cost-effective management of resources. Evaluates performance and contributions of the Project Managers and staff in achieving established objectives. Serves as technical advisor, provides senior-level input and evaluation on projects and will demonstrate creativity, foresight and mature judgment in anticipating and solving problems. Manages all aspects of large and complex projects; tracks and controls scope of work, resource utilization, schedules, and work accomplishments, and initiates corrective actions as required. Manages project communications and documentation. Estimates fees, determines scopes of work and prepares proposals and contracts. Maintains continuous contact with the client and acts as primary liaison to bring the budget, schedule and scope of work to completion to the client’s satisfaction. Builds and maintains effective relationships with existing and potential clients to ensure a high level of client satisfaction and to generate new business opportunities. Travel as necessary for client and/or project meetings.  Requirement of a minimum of 10 years related experience in an architectural, engineering or similar firm. Six plus years project management experience. Architectural License and LEED accreditation preferred. Bachelor’s degree in Planning, Architecture, Engineering or related field required; Master’s degree in related field preferred.",
        "sin": "541611.0",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "258.77",
        "gsa_price_with_iff__a_": "263.69",
        "gsa_price_with_iff__b_": "268.7",
        "gsa_price_with_iff__c_": "273.81",
        "gsa_price_with_iff__d_": "279.01",
        "gsa_price_with_iff__e_": "284.31",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "security_clearance_required": "No",
        "minimum_security_clearance_level": "T1",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Architectural Programming,Strategic Facility Planning,Pre-design and Pre-project Planning,Space Utilization,Needs Assessment and Feasibility Studies",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 5368,
      "price_list_id": 1199
    },
    {
      "contract_number": "GS-00F-177DA",
      "labor_category": "Project Manager",
      "hourly_rate": 258.77,
      "source_sheet_name": "Price List",
      "source_row_number": 5,
      "raw_data": {
        "vendor_name": "FACILITY PROGRAMMING LTD",
        "unique_catalog_item_id": "003-SERVICES",
        "title": "Project Manager",
        "description": "This position reports to Senior Consultant or Director. This position is responsible for a project team including all aspects of multiple complex projects being performed by the team. Evaluates performance and contributions of team members and staff in achieving established objectives. Serves as technical advisor, provides senior-level input and evaluation on projects and will demonstrate creativity, foresight and mature judgment in anticipating and solving problems. Manages all aspects of projects; tracks and controls scope of work, resource utilization, schedules, and work accomplishments, and initiates corrective actions as required. Manages project communications and documentation. Estimates fees, determines scopes of work and prepares proposals and contracts Maintains continuous contact with the client to bring the budget, schedule and scope of work to completion to the client’s satisfaction. Builds and maintains effective relationships with existing and potential clients to ensure a high level of client satisfaction and to generate new business opportunities. Travel as necessary for client and/or project meetings. A minimum of 8 years related experience in an architectural, engineering or similar firm is a requirement. Five plus years project management experience. Architectural License and LEED accreditation and experience preferred. Master’s degree in Planning, Architecture, Engineering or related field preferred or Bachelor’s degree in Planning, Architecture, Engineering or related field with at least 5 years of experience.",
        "sin": "541611.0",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "258.77",
        "gsa_price_with_iff__a_": "263.69",
        "gsa_price_with_iff__b_": "268.7",
        "gsa_price_with_iff__c_": "273.81",
        "gsa_price_with_iff__d_": "279.01",
        "gsa_price_with_iff__e_": "284.31",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "security_clearance_required": "No",
        "minimum_security_clearance_level": "T1",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Architectural Programming,Strategic Facility Planning,Pre-design and Pre-project Planning,Space Utilization,Needs Assessment and Feasibility Studies",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 5368,
      "price_list_id": 1199
    },
    {
      "contract_number": "GS-00F-177DA",
      "labor_category": "Consultant",
      "hourly_rate": 194.96,
      "source_sheet_name": "Price List",
      "source_row_number": 6,
      "raw_data": {
        "vendor_name": "FACILITY PROGRAMMING LTD",
        "unique_catalog_item_id": "004-SERVICES",
        "title": "Consultant",
        "description": "This position reports to Project Manager. This position is responsible for providing professional input and production on multiple projects simultaneously. Provides technical support on design, planning, and coordination of projects. Independently makes decisions and provides solutions to project related problems. Utilizes software and other tools to produce material for project deliverables. Coordinates project communications and documentation. Reviews all technical data and work product for accuracy. Able to interact positively with senior management of the firm, clients, and other consultants. Demonstrates self-motivation and possesses high standards of quality. Travel as necessary for client and/or project meetings. A minimum of 2 years related experience in an architecture, engineering, design, finance or similar field is requirement. Bachelor’s degree in Planning, Architecture, Engineering or related field required.",
        "sin": "541611.0",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "194.96",
        "gsa_price_with_iff__a_": "198.66",
        "gsa_price_with_iff__b_": "202.43",
        "gsa_price_with_iff__c_": "206.28",
        "gsa_price_with_iff__d_": "210.2",
        "gsa_price_with_iff__e_": "214.19",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "2.0",
        "security_clearance_required": "No",
        "minimum_security_clearance_level": "T1",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Architectural Programming,Strategic Facility Planning,Pre-design and Pre-project Planning,Space Utilization,Needs Assessment and Feasibility Studies",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 5368,
      "price_list_id": 1199
    },
    {
      "contract_number": "GS-00F-177DA",
      "labor_category": "Technical Support",
      "hourly_rate": 171.32,
      "source_sheet_name": "Price List",
      "source_row_number": 7,
      "raw_data": {
        "vendor_name": "FACILITY PROGRAMMING LTD",
        "unique_catalog_item_id": "005-SERVICES",
        "title": "Technical Support",
        "description": "This position reports to Project Manager and/or Consultant. This position is responsible for providing technical support and production on multiple projects simultaneously. Analyzes problems and recommends solutions to project related problems. Utilizes software and other tools to produce material for project deliverables. Coordinates project communications and documentation. Reviews all technical data and work product for accuracy. Able to interact positively in a team environment. Demonstrates self-motivation and possesses high standards of quality. Entry-level position, zero-to-two years’ experience required. Associates degree required.",
        "sin": "541611.0",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "171.32",
        "gsa_price_with_iff__a_": "174.58",
        "gsa_price_with_iff__b_": "177.9",
        "gsa_price_with_iff__c_": "181.28",
        "gsa_price_with_iff__d_": "184.72",
        "gsa_price_with_iff__e_": "188.23",
        "minimum_education": "Associates",
        "minimum_years_of_education": "2.0",
        "security_clearance_required": "No",
        "minimum_security_clearance_level": "T1",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Architectural Programming,Strategic Facility Planning,Pre-design and Pre-project Planning,Space Utilization,Needs Assessment and Feasibility Studies",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Associates",
      "security_clearance": "No",
      "contractor_id": 5368,
      "price_list_id": 1199
    }
  ],
  "parsed_at": "2025-11-06T11:54:06.496556"
}