{
  "contract_number": "GS-21F-0146X",
  "contractor_id": 6887,
  "price_list_id": 958,
  "labor_categories": [
    {
      "contract_number": "GS-21F-0146X",
      "labor_category": "Crew Member",
      "hourly_rate": 84.4,
      "source_sheet_name": "Price List",
      "source_row_number": 3,
      "raw_data": {
        "vendor_name": "INVASIVE PLANT CONTROL, INC.",
        "unique_catalog_item_id": "IPC-0001",
        "title": "Crew Member",
        "description": "Ability to correctly identify all invasive plant with minimal review, and to discriminate invasive plants from any native vegetation of similar appearance. Have a sound academic knowledge of ecological principles as they relate to vegetation management. Have a working, current knowledge of resource management methods, biological processes and vegetation sample techniques. Have knowledge of data organization, record keeping, and global positioning system (GPS). Knowledge, ability, and willingness to handle herbicides in the course of vegetation management. Ability to work under adverse physical and weather conditions, including high humidity and temperatures, inclement weather, exposure to poisonous plants, biting insects, and in difficult terrain. Ability to operate and conduct field maintenance of vehicles and to recognize and avoid hazards associated with operating same. Knowledge of treatment history of previously treated sites. Familiarity with invasive plant data management protocols and requirements of the client. Ability to mix, handle, and apply herbicides in accordance with label directions and crew supervisor instructions. Ability to handle and maintain tools, equipment, and supplies in good working order for daily operations.",
        "sin": "325320.0",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "84.4",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "0.0",
        "education_and_experience_substitution": "4 additional years and a HS Diploma",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Invasive,Plant,Crew",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "4 additional years and a HS Diploma",
      "security_clearance": "No",
      "contractor_id": 6887,
      "price_list_id": 958
    },
    {
      "contract_number": "GS-21F-0146X",
      "labor_category": "Crew Leader",
      "hourly_rate": 115.09,
      "source_sheet_name": "Price List",
      "source_row_number": 4,
      "raw_data": {
        "vendor_name": "INVASIVE PLANT CONTROL, INC.",
        "unique_catalog_item_id": "IPC-0002",
        "title": "Crew Leader",
        "description": "Operates transportation equipment such as 4X4 truck with or without trailer for the purpose of traveling to work sites in a safe and courteous manner. Operates field transportation equipment for the purpose of transporting him/herself and up to a ten member work crew. Conducts daily inspection and maintenance of truck and equipment. Conducts daily inspection and inventory of safety equipment for him/herself and crew. Transfers, mixes, transports, and applies non?restricted use herbicides (NRH) and adjuvants or directly supervises <10 man crew for the application of NRH. All instructions must be followed as labeled for all activities. Operates equipment as needed for the proper application of herbicides and adjuvants or directly supervises <10 man crew in the proper use of application equipment, including backpack sprayer, ATV, Argo, swamp buggy, airboat, skiff w/ outboard motor, and 4X4 truck. Operates spray apparatus, including electric pump, gas powered pumps, and hand pumps or directly supervises <10 man crew. Conducts daily inspections and maintenance of equipment and spray apparatus. Assumes responsibility for crew safety, navigation, and training. Properly completes daily work logs and reporting logs for equipment maintenance and delivers to Project Manager.",
        "sin": "325320.0",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "115.09",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "2.0",
        "education_and_experience_substitution": "4 additional years and a HS Diploma",
        "required_certifications_or_licenses": "No",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Invasive,Plant,Crew",
        "domestic__overseas_or_domestic_and_overseas": "Domestic_and_Overseas"
      },
      "education_level": "Bachelors",
      "years_experience": "4 additional years and a HS Diploma",
      "security_clearance": "No",
      "contractor_id": 6887,
      "price_list_id": 958
    }
  ],
  "parsed_at": "2025-11-06T11:53:28.443523"
}