{
  "contract_number": "GS-35F-0525W",
  "contractor_id": 12125,
  "price_list_id": 388,
  "labor_categories": [
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Cloud Program Management Support - Senior",
      "hourly_rate": 152.61,
      "source_sheet_name": "Price List",
      "source_row_number": 3,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "CLOUDLCAT001",
        "title": "Cloud Program Management Support - Senior",
        "description": "Cloud Program Management personnel is responsible for planning and directing work and/or monitoring progress and taking corrective action when necessary. Individuals will be responsible for delivering on highly-visible and mission critical elements, be capable of performing duties independently, and be responsible for successful outcomes of the program. Personnel may oversee the efforts of less senior staff, be capable of briefing to more senior individuals, federal and contractor, and/or be responsible for the efforts of all staff assigned to specific jobs under their purview. Personnel must be familiar with both traditional waterfall (e.g. PMP) and agile delivery methods to manage multiple project teams and milestones, although only one certification is required.\n\nMinimum Education: Bachelor’s Degree in Computer Science, Engineering, or Information Technology\nMinimum Experience: 15 years",
        "sin": "518210C",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "152.61",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "15.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "program planning,stakeholder engagement,agile,waterfall,PMP",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Cloud Product Manager Support - Professional",
      "hourly_rate": 128.56,
      "source_sheet_name": "Price List",
      "source_row_number": 4,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "CLOUDLCAT002",
        "title": "Cloud Product Manager Support - Professional",
        "description": "Cloud Product Manager personnel is responsible for interfacing with a client and user facing role to help government modernize an application. Personnel will be responsible for creating short and long-term milestones, as well as prioritizing tasks and stewarding the vision and strategy beyond a near-term migration. In addition, they will lead the delivery, ongoing success, and continuous improvement of one or more digital portfolios, products and/or platforms, through effective analysis of qualitative and quantitative data for diverse user groups. Personnel must be capable of managing one or more cross-functional team(s) to deliver the right product to the right audience, using the right technologies and processes, helping identify potential updates to policies and procedures.  Personnel must be familiar with both traditional waterfall (e.g. PMP) and agile delivery methods to manage multiple project teams and milestones, although only one certification is required.",
        "sin": "518210C",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "128.56",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "7.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "product strategy,user-centric design,cross-functional teams,agile product management,product vision",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Cloud Project Management Support - Junior",
      "hourly_rate": 100.27,
      "source_sheet_name": "Price List",
      "source_row_number": 5,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "CLOUDLCAT003",
        "title": "Cloud Project Management Support - Junior",
        "description": "Cloud Project Management personnel is responsible for assisting more senior positions and/or performing functional duties under the oversight of more senior positions. Personnel will also be responsible for collecting data, reporting progress, and ensuring the quality and accuracy of deliverables. Personnel must be familiar with both traditional waterfall (e.g. PMP) and agile delivery methods to manage multiple project teams and milestones, although no certification is required.",
        "sin": "518210C",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "100.27",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "4.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "task tracking,project support,agile exposure,waterfall exposure,data collection",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Cloud Subject Matter Expert (SME) - Senior",
      "hourly_rate": 175.3,
      "source_sheet_name": "Price List",
      "source_row_number": 6,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "CLOUDLCAT004",
        "title": "Cloud Subject Matter Expert (SME) - Senior",
        "description": "Cloud Subject Matter Expert personnel is typically recognized for a given area of expertise and able to provide guidance on technologies, policies and strategies. Personnel typically perform the following kinds of functions: Initiates, supervises, and/or develops requirements, helps arbitrate and advice on complex problems and opportunities; Provides strategic advice, technical guidance and expertise staff and leadership; Provides detailed analysis, evaluation and recommendations for improvements, identifies and develops optimization and/or maintenance efforts for client-specific or mission critical challenges/issues; Consults with client to define needs or supervises studies and leads surveys to collect and analyze data to provide advice and recommend solutions.  Personnel must be familiar with multiple Cloud Services Providers technology and services, although at least one certification is required.",
        "sin": "518210C",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "175.3",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "15.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "technical advisory,cloud strategy,multi-cloud,AWS,Azure",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Cloud Solutions Architect - Senior",
      "hourly_rate": 143.88,
      "source_sheet_name": "Price List",
      "source_row_number": 7,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "CLOUDLCAT005",
        "title": "Cloud Solutions Architect - Senior",
        "description": "Cloud Solutions Architect personnel is responsible for designing, developing, testing, operating, and sustaining secure computing architectures to include: cloud, data centers, and overall infrastructure optimization activities. Individuals must be capable of collecting solution requirements, documenting requirements and performance objectives, detailing metrics and benchmarking measurements for evaluation in an independent fashion. Experience should include modern data processing environments, including cloud computing and DevSecOps patterns.  Personnel must be capable of leading the technical strategy for agile development teams. Personnel is responsible for ensuring strategic alignment of technical design and architecture to meet the agency’s strategic direction and be capable of decomposing business and system architecture to support clean-interface multi-team development. Personnel will be responsible for ensuring product roadmaps, backlogs, and measurable success criteria, writing user stories (i.e., can establish a path to delivery for breaking down stories), are developed with input from the team, users, and stakeholders.  Personnel must be familiar with multiple Cloud Services Providers technology and services, although at least one certification is required.",
        "sin": "518210C",
        "predominant_work_site": "Customer_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "143.88",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "solution architecture,cloud infrastructure,AWS,Azure,DevSecOps",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Cloud Security Engineer - Senior",
      "hourly_rate": 136.65,
      "source_sheet_name": "Price List",
      "source_row_number": 8,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "CLOUDLCAT006",
        "title": "Cloud Security Engineer - Senior",
        "description": "Cloud Security Engineer personnel is responsible for the development and delivery of system security and information assurance documentation, consistent with federal standards to support system certification and accreditation. Personnel must be willing to advocate for a modern, DevSecOps-style, approach for conducting testing and conveying control information, and capable of devising policy recommendations to streamline and accelerate successful security outcomes. Personnel must be capable of performing security audits, risk analysis, application-level vulnerability testing, and security code reviews as well as developing and implementing solutions to mitigate new attack vectors. Personnel must have experience serving as the security engineer of complex technology implementations in a product-centric environment. Comfortable with bridging the gap between legacy development or operations teams and working toward a shared culture and vision. Experience with white-hat hacking and fundamental computer science concepts strongly desired.  Personnel must be familiar with cloud specific or general security principles and best practices (Federal information security policies, practices and legal requirements including FISMA, RMF, FITARA, NIST and FedRAMP), although only one certification is required (e.g., CISSP).",
        "sin": "518210C",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "136.65",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "7.0",
        "security_clearance_required": "Yes",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "infrastructure",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "Yes",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Cloud Developer - Senior",
      "hourly_rate": 141.14,
      "source_sheet_name": "Price List",
      "source_row_number": 9,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "CLOUDLCAT007",
        "title": "Cloud Developer - Senior",
        "description": "Cloud Developer personnel is responsible to author, document, review, test, and debug code and configuration for infrastructure components (e.g. Hardware, Software, Operating System, Middleware, etc.), including for security vulnerabilities, risks and remediation. Personnel must have experience using modern, open source software to prototype and deploy backend web applications, including all aspects of server-side processing, data storage, and integration with frontend development. Personnel must be capable of reviewing legacy application environments, analyzing appropriate implementation alternatives, designing development plans, documenting all components of existing and future environments, and communicating technical concepts to a non-technical audience. Personnel will serve as a senior software architect/developer to oversee the efforts of less senior staff and/or be responsible for all development efforts of a particular project or product. Personnel are responsible for managing migration activities, developing documentation and automation to ensure repeatability and accuracy of delivery, using “infrastructure as code” practices.  Personnel must have experience with continuous integration / continuous deployment or delivery (CI/CD), IDE, Application Programming Interface (API), agile methodologies (e.g., SCRUM, Lean, SAFe), user Interface / user Experience (UI/UX), development Frameworks (e.g., HTML5, CSS3, CSS frameworks like LESS and SASS, Responsive Design, Bootstrap), section 508 compliance, and Relational and non-relational databases. \n\nMinimum Education: Bachelor’s Degree in Computer Science, Engineering, or Information Technology\nMinimum Experience: 7 years",
        "sin": "518210C",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "141.14",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "6.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "cloud,serverless,microservices,APIs",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Cloud DevSecOps Practitioner - Senior",
      "hourly_rate": 139.57,
      "source_sheet_name": "Price List",
      "source_row_number": 10,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "CLOUDLCAT008",
        "title": "Cloud DevSecOps Practitioner - Senior",
        "description": "Cloud DevSecOps Practitioner personnel is responsible for maintaining a number of automation and orchestration technologies and will be responsible for creating and configuring flexible solutions for other development, delivery, security, operations, and oversight teams, ensuring system uptime, security, and performance.  Personnel will be required to assess, deploy, and manage a number of infrastructure management tools including infrastructure optimization and orchestration solutions. Personnel must be capable of overseeing the efforts of less senior staff, briefing more senior individuals, federal and contractor, and/or be responsible for the efforts of staff assigned to specific jobs under their purview. \nPersonnel must support the learning and cultural transformation by facilitating shared standards and participating in communities of practice as the organization matures and new capabilities are identified.",
        "sin": "518210C",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "139.57",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "4.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "DevSecOps,automation,orchestration,infrastructure management,cultural transformation",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Cloud Infrastructure Optimization Consultant - Senior",
      "hourly_rate": 151.08,
      "source_sheet_name": "Price List",
      "source_row_number": 11,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "CLOUDLCAT009",
        "title": "Cloud Infrastructure Optimization Consultant - Senior",
        "description": "Cloud Infrastructure Optimization Consultant personnel is responsible for performing IT assessments – providing guidance, feedback, and recommendations, serving as a senior escalation point for IT issues and presenting IT recommendations and action plans to clients. Personnel must have hands-on experience with major data center migration and consolidation management practices. Personnel must have experience with software / hardware virtualization tools (e.g., Microsoft Hyper and VMware and with cloud solutions such as Microsoft Office 365, Azure, SharePoint and other Microsoft Services), data center configuration and energy management practices, infrastructure related operating systems, networking and firewall, and security related tools such as anti-virus, anti-malware, intrusion detection and prevention, encryption.",
        "sin": "518210C",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "151.08",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "infrastructure assessment,data center migration,virtualization,Azure,Microsoft 365",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Cloud Administrator - Professional",
      "hourly_rate": 87.2,
      "source_sheet_name": "Price List",
      "source_row_number": 12,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "CLOUDLCAT010",
        "title": "Cloud Administrator - Professional",
        "description": "Cloud Administrator Professional personnel is responsible for managing and maintaining systems and/or software solutions. Personnel should function at a journey-level proficiency and be able to operate semi-independently, reporting to a senior-level labor category when exceptions arise, or milestones have been met. Personnel must be capable of directing the work of less-senior engineers across a number of disciplines (cloud computing, networking, security, development, data, and databases) as well as conducting those same configuration, programming, and delivery activities should the need arise. Personnel are responsible for completing migration activities, delivering documentation and conducting validation and assurance activities.",
        "sin": "518210C",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "87.2",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "system maintenance,cloud configuration,migration,system validation,semi-independent operation",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Cloud Engineer - Junior",
      "hourly_rate": 81.1,
      "source_sheet_name": "Price List",
      "source_row_number": 13,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "CLOUDLCAT011",
        "title": "Cloud Engineer - Junior",
        "description": "Cloud Engineer personnel is responsible for conducting research and planning activities, evaluating products and technical alternatives, as well as developing, deploying, and documenting technical solutions. Personnel in this category are responsible for assisting more senior positions and/or performing functional duties under the oversight of more senior positions.",
        "sin": "518210C",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "81.1",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "cloud research,technical planning,documentation,solution deployment,product evaluation",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Cloud Designer - Senior",
      "hourly_rate": 134.85,
      "source_sheet_name": "Price List",
      "source_row_number": 14,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "CLOUDLCAT012",
        "title": "Cloud Designer - Senior",
        "description": "Cloud Designer personnel is responsible for capturing the goals of users and the agency as well as evaluating opportunities and constraints and providing strategic recommendations for enhancements to leveraging cloud services. Personnel will be well-versed in current visual design standards and trends and will be responsible for managing project design reviews, developing guidance (such as style guides and usability testing) and coaching for team members and ensuring compliance of application release management, outage management and change control processes and standards. Personnel will have experience focusing on improving usability, user experience, and driving adoption and engagement by planning, recruiting, and facilitating the usability testing of a system. \n\nPersonnel is responsible for conducting user research, analysis/synthesis, to develop requirement specifications & experience goals, personas, storyboards, scenarios, flowcharts, design prototypes, and usability / design specifications to create products that meet the needs of users. Individuals will work on highly-visible stakeholder interviews, user requirements analysis, task analysis, conceptual modeling, information architecture, interaction design, and usability testing and must be effective at communicating research findings, conceptual ideas, detailed design, and design rationale and goals both verbally and visually.  Personnel have the ability to develop proof-of-concepts and prototypes of easy-to-navigate user interfaces (UIs) that consists of web pages with graphics, icons, and color schemes that are visually appealing. Personnel may oversee the efforts of less senior staff, be capable of briefing to more senior individuals, federal and contractor, and/or be responsible for the efforts of all staff assigned to specific jobs under their purview.",
        "sin": "518210C",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "134.85",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "7.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "design,user",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Cloud Researcher - Professional",
      "hourly_rate": 121.36,
      "source_sheet_name": "Price List",
      "source_row_number": 15,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "CLOUDLCAT013",
        "title": "Cloud Researcher - Professional",
        "description": "Cloud Researcher personnel is responsible for specifying, collecting, and presenting key performance data and analysis for a given digital service and/or business process. Personnel must support the team by generating new and useful information and translating it into actions that will allow them to iteratively improve their service for users. Personnel must possess analytical and problem-solving skills necessary for quickly developing recommendations based on the quantitative and qualitative evidence gathered via web analytics, financial data, and user feedback. Individuals must be capable of explaining technical concepts to senior officials with limited technological background, and comfortable working with data, from gathering and analysis through to design and presentation. Personnel must be able to share examples of best practice in digital performance management and support the procurement of the necessary digital platforms, that support automation and near real-time collection and presentation of operational data, helping overcome delivery obstacles to improving policies, processes, and overall performance in agencies by collaboratively to overcome those obstacles.",
        "sin": "518210C",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "121.36",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "4.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "performance metrics,web analytics,user feedback,data presentation,digital service improvement",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Cloud Analyst - Junior",
      "hourly_rate": 71.92,
      "source_sheet_name": "Price List",
      "source_row_number": 16,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "CLOUDLCAT014",
        "title": "Cloud Analyst - Junior",
        "description": "Cloud Analyst personnel is responsible for; supporting agencies by analyzing propositions and assessing decision-making factors such as strategic alignment, cost/benefit, and risk; working closely with more senior leaders to define a product approach to meet user needs; defining required skills and processes, and mapping internal, agency, and external (partners/specialist contractors) resources. Personnel have an eye for detail, excellent communication skills, ability to rationalize complex information and to make it understandable for others to work, and ability to interrogate reported information and challenge sources where inconsistencies are found. Personnel must be capable of independently analyzing and mapping the risks of an approach and propose mitigation solutions, and work with more senior managers to measure, analyze, and report progress.  Personnel must have experience with Digital/Web services and solutions, ideally where open source and cloud technologies and agile development methodologies have been applied.",
        "sin": "518210C",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "71.92",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "strategic alignment,cost-benefit analysis,risk assessment,digital services,decision support",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Cloud Learning Specialist - Professional",
      "hourly_rate": 82.71,
      "source_sheet_name": "Price List",
      "source_row_number": 17,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "CLOUDLCAT015",
        "title": "Cloud Learning Specialist - Professional",
        "description": "Cloud Learning Specialist personnel is responsible for creating and improving content and training efforts by leading the research & development of interactive and experiential learning for participants. Personnel must be able to advise how to improve the iteration of content and collaborate across the team to improve the quality and effectiveness of documentation and delivery. Personnel will participate, as needed, on an agile delivery teams and oversee the efforts of staff to document, using plain language guidelines, content to communicate technically sophisticated topics, such as cloud and DevSecOps. Personnel must be capable of producing and editing content as well as planning and facilitating learning and content workshops, brainstorming sessions, and directing the development of content and learning modules.",
        "sin": "518210C",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "82.71",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "cloud training,content development,experiential learning,plain language,agile collaboration",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Cloud Data Analyst - Professional",
      "hourly_rate": 92.63,
      "source_sheet_name": "Price List",
      "source_row_number": 18,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "CLOUDLCAT016",
        "title": "Cloud Data Analyst - Professional",
        "description": "Cloud Data Analyst personnel is responsible for collecting, analyzing, and presenting key data and analysis for a given service. Individuals support the team by generating new and useful information and insights and translating them into actions that allow iterative service to improve for users. Professional individuals must possess critical analytical and problem-solving skills for quickly developing recommendations based on the quantitative and qualitative evidence gathered. Personnel must be comfortable working with relational and non-relational data and processing systems, from gathering and analysis through to design and presentation. This includes being confident in explaining data-driven decision-making concepts to senior officials with limited background in this area. Personnel may oversee the efforts of less senior staff, be capable of briefing more senior individuals, federal and contractor and communicating performance against key indicators to stakeholders.",
        "sin": "518210C",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "92.63",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "4.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "data analytics,relational databases,non-relational data,data-driven insights,performance metrics",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Subject Matter Expert",
      "hourly_rate": 228.28,
      "source_sheet_name": "Price List",
      "source_row_number": 19,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "LCAT541001",
        "title": "Subject Matter Expert",
        "description": "Subject matter experts are recognized by their peers through certifications and awards as leading experts in the fields of computer software design and implementation, business re-engineering, enterprise modeling, strategic planning, business planning and systems architecture plans. Areas of expertise include:\n\n• Program management\n• Federal government regulations and business processes\n• Current technology standards and practices\n• Strategy Analysis\n• Enterprise data modeling\n• Warehouse Architecture\n• Business Logic Diagramming\n• Enterprise Architecture Models",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "228.28",
        "gsa_price_with_iff__a_": "228.28",
        "gsa_price_with_iff__b_": "235.02",
        "gsa_price_with_iff__c_": "241.95",
        "gsa_price_with_iff__d_": "249.09",
        "gsa_price_with_iff__e_": "256.43",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "15.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "subject matter expert,certifications,awards,program management,federal regulations",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Program Manager",
      "hourly_rate": 194.05,
      "source_sheet_name": "Price List",
      "source_row_number": 20,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "LCAT541002",
        "title": "Program Manager",
        "description": "Program managers are experienced software and systems engineering managers and business division leaders who are experts in strategic analysis, enterprise modeling and leading multiple development teams. Typically they have experience in department and division management and are capable at working with all management levels   of any organization. Areas of expertise include:\n\n• Program management\n• Federal government regulations and business processes\n• Current technology standards and practices\n• Strategy Analysis\n• Enterprise data modeling\n• Service Oriented Architecture\n• Business Process Management",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "194.05",
        "gsa_price_with_iff__a_": "194.05",
        "gsa_price_with_iff__b_": "199.77",
        "gsa_price_with_iff__c_": "205.67",
        "gsa_price_with_iff__d_": "211.74",
        "gsa_price_with_iff__e_": "217.98",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "15.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "program management,software engineering,systems engineering,business process,enterprise modeling",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Project Manager",
      "hourly_rate": 166.33,
      "source_sheet_name": "Price List",
      "source_row_number": 21,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "LCAT541003",
        "title": "Project Manager",
        "description": "Project Managers Staff personnel are experienced systems and software engineering managers who are capable of leading a team through all phases of the software development cycle.\n\nAreas of expertise include:\n• Project management and automated project management tools\n• Federal government regulations and business processes\n• Current technology standards and practices\n• System architecture design and analysis\n• Business area data modeling and design\n• Project Management Professional (PMP) Certified",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "166.33",
        "gsa_price_with_iff__a_": "166.33",
        "gsa_price_with_iff__b_": "171.23",
        "gsa_price_with_iff__c_": "176.28",
        "gsa_price_with_iff__d_": "181.48",
        "gsa_price_with_iff__e_": "186.84",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "7.0",
        "required_certifications_or_licenses": "PMP",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "project management,software development lifecycle,PMP,federal regulations,architecture design",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Solution Architect",
      "hourly_rate": 177.41,
      "source_sheet_name": "Price List",
      "source_row_number": 22,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "LCAT541004",
        "title": "Solution Architect",
        "description": "Solution Architect staff personnel specialize in architecting enterprise solutions. They work with client senior managers to identify project requirements as well as come up with building blocks for the solution. They supervise teams and may provide not only technical, but functional experience as well. Areas of expertise include:\n\n• Enterprise Data Modeling\n• Data Integration\n• Service Oriented Architecture\n• Business Process Management\n• Business Activity Monitoring\n• SQL, PL/SQL\n• J2EE Frameworks\n• .Net\n• Cyber Security Methods",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "177.41",
        "gsa_price_with_iff__a_": "177.41",
        "gsa_price_with_iff__b_": "182.65",
        "gsa_price_with_iff__c_": "188.04",
        "gsa_price_with_iff__d_": "193.58",
        "gsa_price_with_iff__e_": "199.29",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "solution architect,enterprise solutions,data integration,SOA,BPM",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Principal Software/ Systems Engineer",
      "hourly_rate": 140.83,
      "source_sheet_name": "Price List",
      "source_row_number": 23,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "LCAT541005",
        "title": "Principal Software/ Systems Engineer",
        "description": "Principal Software/Systems Engineer personnel specialize in implementing enterprise solutions. They work with client senior managers and solution architect to identify project teams. Areas of expertise include:\n\n• Data Integration\n• Service Oriented Architecture\n• Business Process Management\n• Business Activity Monitoring\n• SQL, PL/SQL\n• J2EE Frameworks\n• .Net\n• Cyber Security Methods",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "140.83",
        "gsa_price_with_iff__a_": "140.83",
        "gsa_price_with_iff__b_": "144.98",
        "gsa_price_with_iff__c_": "149.26",
        "gsa_price_with_iff__d_": "153.66",
        "gsa_price_with_iff__e_": "158.19",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "7.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "software engineer,systems engineer,enterprise solutions,implementation,SOA",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Principal Business Analyst",
      "hourly_rate": 138.61,
      "source_sheet_name": "Price List",
      "source_row_number": 24,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "LCAT541006",
        "title": "Principal Business Analyst",
        "description": "Principal Business Analyst personnel specializes in the analysis of the organization business strategic needs. They work in team settings to support the business process modelling , reengineering and improvement efforts. They support the interpretation or definitions of business rules and requirements for technical systems. Areas of expertise include:\n\n• Strategic Planning\n• Operating/Business model analysis - the definition and analysis of the organizations policies and market business approaches.\n• Process definition and design\n• IT/Technical business analysis",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "138.61",
        "gsa_price_with_iff__a_": "138.61",
        "gsa_price_with_iff__b_": "142.7",
        "gsa_price_with_iff__c_": "146.91",
        "gsa_price_with_iff__d_": "151.24",
        "gsa_price_with_iff__e_": "155.71",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "7.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "business analyst,strategic analysis,process design,business modeling,IT analysis",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Senior Software/ Systems Engineer",
      "hourly_rate": 130.84,
      "source_sheet_name": "Price List",
      "source_row_number": 25,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "LCAT541007",
        "title": "Senior Software/ Systems Engineer",
        "description": "Senior Software Engineer personnel specialize in implementing enterprise solutions. They work in team settings to design, implement and deploy solutions. Areas of expertise include:\n• Java Programming\n• C# Programming\n• SharePoint\n• Service Oriented Architecture\n• Business Process Management\n• Business Activity Monitoring\n• SQL, PL/SQL\n• Networking",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "130.84",
        "gsa_price_with_iff__a_": "130.84",
        "gsa_price_with_iff__b_": "134.7",
        "gsa_price_with_iff__c_": "138.67",
        "gsa_price_with_iff__d_": "142.76",
        "gsa_price_with_iff__e_": "146.97",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Java,SharePoint",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Senior Business Analyst",
      "hourly_rate": 127.51,
      "source_sheet_name": "Price List",
      "source_row_number": 26,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "LCAT541008",
        "title": "Senior Business Analyst",
        "description": "A Senior Business Analyst personnel specializes in the analysis of the organization business strategic needs. They work in team settings to support the business process modeling, reengineering and improvement efforts. They support the interpretation or definitions of business rules and requirements for technical systems. Areas of expertise include:\n\n• Strategic Planning\n• Operating/Business model analysis - the definition and analysis of the organizations policies and market business approaches.\n• Process definition and design\n• IT/Technical business analysis",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "127.51",
        "gsa_price_with_iff__a_": "127.51",
        "gsa_price_with_iff__b_": "131.28",
        "gsa_price_with_iff__c_": "135.15",
        "gsa_price_with_iff__d_": "139.14",
        "gsa_price_with_iff__e_": "143.24",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "business analyst,strategic analysis,business modeling,process design,IT analysis",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Software/Systems Engineer",
      "hourly_rate": 110.89,
      "source_sheet_name": "Price List",
      "source_row_number": 27,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "LCAT541009",
        "title": "Software/Systems Engineer",
        "description": "Software Engineer personnel specialize in implementing enterprise solutions. They work in team settings to design, implement and deploy solutions. Areas of expertise include:\n\n• Java Programming\n• C# Programming\n• SharePoint\n• Service Oriented Architecture\n• Business Process Management\n• Business Activity Monitoring\n• SQL, PL/SQL\n• Networking",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "110.89",
        "gsa_price_with_iff__a_": "110.89",
        "gsa_price_with_iff__b_": "114.16",
        "gsa_price_with_iff__c_": "117.53",
        "gsa_price_with_iff__d_": "120.99",
        "gsa_price_with_iff__e_": "124.56",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "software,engineer,Java,SharePoint",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Business Analyst",
      "hourly_rate": 99.79,
      "source_sheet_name": "Price List",
      "source_row_number": 28,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "LCAT541010",
        "title": "Business Analyst",
        "description": "A Business Analyst personnel specializes in the analysis of the organization business strategic needs. They work in team settings to support the business process modeling, reengineering and improvement efforts. They support the interpretation or definitions of business rules and requirements for technical systems. Areas of expertise include:\n\n• Strategic Planning\n• Operating/Business model analysis - the definition and analysis of the organizations policies and market business approaches.\n• Process definition and design\n• IT/Technical business analysis",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "99.79",
        "gsa_price_with_iff__a_": "99.79",
        "gsa_price_with_iff__b_": "102.73",
        "gsa_price_with_iff__c_": "105.76",
        "gsa_price_with_iff__d_": "108.88",
        "gsa_price_with_iff__e_": "112.1",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "business analyst,strategic analysis,business modeling,process design,IT analysis",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Technical Writer",
      "hourly_rate": 67.16,
      "source_sheet_name": "Price List",
      "source_row_number": 29,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "LCAT541011",
        "title": "Technical Writer",
        "description": "Technical Writer personnel provides technical writing assistance in support of the development of client documentation such as User Guides, Concept of Operations and other project related documentation. Areas of expertise include:\n\n• Spreadsheets such as Microsoft’s Word, Adobe Acrobat, Adobe PhotoShop, Adobe illustrator\n• Knowledge of government budget formulation policies\n• Knowledge government personnel management policies\n• Basic accounting concepts",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "67.16",
        "gsa_price_with_iff__a_": "67.16",
        "gsa_price_with_iff__b_": "69.15",
        "gsa_price_with_iff__c_": "71.19",
        "gsa_price_with_iff__d_": "73.29",
        "gsa_price_with_iff__e_": "75.45",
        "minimum_education": "High_School",
        "minimum_years_of_education": "2.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "technical writer,documentation,user guides,Adobe,Photoshop",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "High_School",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Support Staff",
      "hourly_rate": 51.57,
      "source_sheet_name": "Price List",
      "source_row_number": 30,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "LCAT541012",
        "title": "Support Staff",
        "description": "Support Staff personnel provide clerical assistance such as budget preparation, filing, and contract administration. Areas of expertise include:\n\n• Spreadsheets such as Microsoft’s Excel\n• Government budget formulation policies\n• Government personnel management policies\n• Basic accounting concepts",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "51.57",
        "gsa_price_with_iff__a_": "51.57",
        "gsa_price_with_iff__b_": "53.09",
        "gsa_price_with_iff__c_": "54.66",
        "gsa_price_with_iff__d_": "56.27",
        "gsa_price_with_iff__e_": "57.93",
        "minimum_education": "High_School",
        "minimum_years_of_education": "2.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "clerical support,budget,filing,contract admin,Excel",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "High_School",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Sr. Technical Writer",
      "hourly_rate": 125.43,
      "source_sheet_name": "Price List",
      "source_row_number": 31,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "LCAT541013",
        "title": "Sr. Technical Writer",
        "description": "Technical Writer personnel is responsible for general technical writing duties (e.g. meeting minutes, action items, agendas, reports, meeting materials, standard operating procedures, policies, guidance documents, and other technical deliverables); Develop documentations that aligns with the writing style and expectations of the client and intended audience; Perform data management to maintain a repository of information that is easily accessible and searchable; Edits existing and new documentation to assure accuracy, clarity, and conformance to the latest standards and guidelines; and Support the editing of briefing materials",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "125.43",
        "gsa_price_with_iff__a_": "125.43",
        "gsa_price_with_iff__b_": "129.13",
        "gsa_price_with_iff__c_": "132.94",
        "gsa_price_with_iff__d_": "136.87",
        "gsa_price_with_iff__e_": "140.9",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "technical writing,SOPs,editing,documentation,briefing materials",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Sr. Software Architect",
      "hourly_rate": 172.14,
      "source_sheet_name": "Price List",
      "source_row_number": 32,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "LCAT541014",
        "title": "Sr. Software Architect",
        "description": "Software Architect personnel is responsible for serving as the team leader for the innovation and creation of new company software and program features. Software Architect will oversee a team of programmers and will seek to manage and facilitate the proper design of large websites or programs within products. From software coding to innovative design, the Senior Software Architect will be key to creating a seamless software experience for customers. The Software Architect will work on both technical and design aspects of various projects.  Creativity as well as detailed understanding of coding and solid leadership will be essential for this position.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "172.14",
        "gsa_price_with_iff__a_": "172.14",
        "gsa_price_with_iff__b_": "177.22",
        "gsa_price_with_iff__c_": "182.45",
        "gsa_price_with_iff__d_": "187.83",
        "gsa_price_with_iff__e_": "193.37",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "software architect,team lead,software design,innovation,leadership",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Sr. Database Administrator",
      "hourly_rate": 142.42,
      "source_sheet_name": "Price List",
      "source_row_number": 33,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "LCAT541015",
        "title": "Sr. Database Administrator",
        "description": "Sr. Database Administrator personnel is responsible for Install, design and maintain database system software and implement database security.\nPersonnel will also monitor and analyze database performance and ensure effective and efficient utilization of database\nsystems/processes.  Personnel will maintain database dictionaries and support tools; develop and maintain accurate system documentation in addition to participating in the development and maintenance of strategic, architectural and tactical plans for the\ndatabase and data warehouse environments; be conversant with, and cognizant of, the future direction of\nsystems.  Senior Database Administrator personnel will also provide technical leadership on database systems and solutions. Personnel will provide individual mentoring and training on databases and tools in addition to recommending, testing and evaluating new technologies, software tools, and required",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "142.42",
        "gsa_price_with_iff__a_": "142.42",
        "gsa_price_with_iff__b_": "146.62",
        "gsa_price_with_iff__c_": "150.95",
        "gsa_price_with_iff__d_": "155.4",
        "gsa_price_with_iff__e_": "159.99",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "database admin,DBA,install,design,maintain",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Computer Operations",
      "hourly_rate": 63.86,
      "source_sheet_name": "Price List",
      "source_row_number": 34,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "LCAT541016",
        "title": "Computer Operations",
        "description": "Computer Operations personnel is responsible for running computer operations as well as ensuring that computer systems and hardware are in good working order. Their tasks include maintaining work order schedules, inputting commands into computer terminals, performing routine maintenance and installing software updates along with a myriad of other tasks.  Computer Operators are required to have a strong understanding of computer systems, the ability to follow directions, and excellent analytical thinking and problem solving skills. Some of the responsibilities will include imputing commands from computer terminal and overseeing that operations are carried out without error in addition to maintaining a calendar detailing work order to ensure that all tasks can be completed on time. Personnel will check that local area networks are functioning properly, and resolve or repair issues when they are identified",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "63.86",
        "gsa_price_with_iff__a_": "63.86",
        "gsa_price_with_iff__b_": "65.74",
        "gsa_price_with_iff__c_": "67.68",
        "gsa_price_with_iff__d_": "69.68",
        "gsa_price_with_iff__e_": "71.74",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "computer operations,systems maintenance,hardware,software updates,troubleshooting",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Sr. Data Architect",
      "hourly_rate": 146.27,
      "source_sheet_name": "Price List",
      "source_row_number": 35,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "LCAT541017",
        "title": "Sr. Data Architect",
        "description": "Senior Data Architect personnel is responsible for developing database solutions to store and retrieve company information. Personnel will also install and configure information systems to ensure functionality in addition to analyzing structural requirements for new software and applications. Senior Data Architect personnel will migrate data from legacy systems to new solutions and will design conceptual and logical data models and flowcharts.  Personnel will also be responsible for improving system performance by conducting tests, troubleshooting and integrating new elements and will optimize new and current database systems.  Personnel will also define security and backup procedures in addition to coordinating with the Data Science department to identify future needs and requirements. Personnel will need to have proven work experience as a Data Architect, Data Scientist, Data Analyst or similar role and in-depth understanding of database structure principles. Experience gathering and analyzing system requirements and knowledge of data mining and segmentation techniques is also required.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "146.27",
        "gsa_price_with_iff__a_": "146.27",
        "gsa_price_with_iff__b_": "150.59",
        "gsa_price_with_iff__c_": "155.03",
        "gsa_price_with_iff__d_": "159.6",
        "gsa_price_with_iff__e_": "164.31",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "data architect,database,solutions,data models,performance optimization",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Sr. Cybersecurity Analyst",
      "hourly_rate": 140.89,
      "source_sheet_name": "Price List",
      "source_row_number": 36,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "LCAT541018",
        "title": "Sr. Cybersecurity Analyst",
        "description": "Senior Cybersecurity Analyst personnel will be responsible for monitoring the organization’s computer networks and systems to identify any violations and security breaches that need to be resolved. Senior Cybersecurity Analysts will be responsible for installing and utilizing software, such as firewalls and data encryption programs, to help protect the company’s data and sensitive information. Personnel will also conduct tests on systems.  Cybersecurity Analysts will carry out regular tests to simulate attacks so they can identify areas where the company is vulnerable and ways in which its systems might be exploited by hackers and viruses in addition to developing processes and standards. Cybersecurity Analyst personnel will develop processes and regulations to ensure the company’s systems stay as safe as possible, in addition to developing security standards for all employees to adhere to. This involves researching the latest information technology security trends and software to help prevent any issues. Personnel will also prepare reports and will prepare and create regular reports to document any process implementation, improvements made, and security breaches that caused damage to the company.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "140.89",
        "gsa_price_with_iff__a_": "140.89",
        "gsa_price_with_iff__b_": "145.04",
        "gsa_price_with_iff__c_": "149.32",
        "gsa_price_with_iff__d_": "153.73",
        "gsa_price_with_iff__e_": "158.26",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "cybersecurity,network monitoring,breach detection,firewalls,encryption",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Sr. Quality Assurance Specialist",
      "hourly_rate": 101.77,
      "source_sheet_name": "Price List",
      "source_row_number": 37,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "LCAT541019",
        "title": "Sr. Quality Assurance Specialist",
        "description": "Senior Quality Assurance Specialist personnel will be responsible for outlining quality assurance policies and procedures and will interpret and comply with quality assurance standards in addition to making sure that quality assurance standards are adequate.  Personnel will elaborate the procedures of sampling and guidelines for collection and reporting quality data and will oversee the implementation and ensure efficiency of inspection and quality systems.  Personnel will also plan, perform and oversee inspection and testing of products to ensure the quality deliverable and will document quality assurance activities, such as internal audits.  The Senior Quality Assurance Specialist personnel will analyze customer grievances and other non-compliance issues\nand will gather and organize statistical quality data in addition to inspecting data to detect areas for improvement and elaborating, recommending and overseeing improvement actions.  Personnel will also report on results of quality activities. Will also be responsible for identifying coaching needs and take actions in accordance with these needs in order to ensure compliance with quality standards.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "101.77",
        "gsa_price_with_iff__a_": "101.77",
        "gsa_price_with_iff__b_": "104.77",
        "gsa_price_with_iff__c_": "107.86",
        "gsa_price_with_iff__d_": "111.04",
        "gsa_price_with_iff__e_": "114.32",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "quality assurance,QA,policies,procedures,inspection",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Principal  Network/Telecom Engineer",
      "hourly_rate": 136.21,
      "source_sheet_name": "Price List",
      "source_row_number": 38,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "LCAT541020",
        "title": "Principal  Network/Telecom Engineer",
        "description": "Principal Network/Telecom Engineer personnel's primary responsibility to develop, design, implement and maintain network / telephony infrastructure and security to support all identified business needs, including VOIP telephony system and will own solution design in support of project delivery, technology roadmap execution and third-level support to Network Operations, including problem resolution and will be responsible for schedule, budget and quality of networking solutions. Personnel will make recommendations regarding operational improvements and will maintain and support of, LAN/WAN/VOIP architecture and network hardware, software, and applications in addition to providing ongoing review of capacity requirements in order to align with budget planning. Principal Network/Telecom Engineer personnel will define and coordinate standards, project management, and technology research and will ensure up-to-date system and network documentation and inventories. Principal Network/Telcom Engineer personnel is responsible to stay at the forefront of innovation by maintaining current knowledge of products, services, and market dynamics. Personnel will be responsible for utilizing, monitoring, mapping and alerting software to proactively collect data and conduct real-time analysis of the performance of the network and telecom systems, mitigating business-impacting events in addition to maintaining documentation for all operational / support processes for the systems supported by the network and telecom team; automate repetitive processes where appropriate. Personnel will remain  current with new technologies and techniques as appropriate",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "136.21",
        "gsa_price_with_iff__a_": "136.21",
        "gsa_price_with_iff__b_": "140.23",
        "gsa_price_with_iff__c_": "144.37",
        "gsa_price_with_iff__d_": "148.63",
        "gsa_price_with_iff__e_": "153.01",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "7.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "network engineer,telecom,VOIP,LAN,WAN",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Int IT Analyst",
      "hourly_rate": 108.78,
      "source_sheet_name": "Price List",
      "source_row_number": 39,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "LCAT541021",
        "title": "Int IT Analyst",
        "description": "Int IT Analyst personnel must combine strong analytical skills and problem-solving abilities with project management skills. The Int IT Analyst should have excellent interpersonal skills are crucial to reconciling the sometimes disparate needs of management, technical personnel and end-users. The IT Analyst must also be acutely aware of the latest technology and how best to leverage its capabilities for an organization. The Int IT Analyst will work under tight deadlines and will work closely and effectively with cross fictional teams.  The Int IT Analyst will work under tight deadlines.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "108.78",
        "gsa_price_with_iff__a_": "108.78",
        "gsa_price_with_iff__b_": "111.99",
        "gsa_price_with_iff__c_": "115.29",
        "gsa_price_with_iff__d_": "118.69",
        "gsa_price_with_iff__e_": "122.19",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "6.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "IT analyst,problem-solving,project management,technology awareness,team collaboration",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Sr. IT Analyst",
      "hourly_rate": 118.38,
      "source_sheet_name": "Price List",
      "source_row_number": 40,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "LCAT541022",
        "title": "Sr. IT Analyst",
        "description": "Senior IT Analyst personnel will be responsible for communicating with stakeholders to understand their requirements and will  need to be able to develop and analyze functional specifications.  Senior IT Analyst must combine strong analytical skills and problem-solving abilities with project management skills. The Int IT Analyst should have excellent interpersonal skills are crucial to reconciling the sometimes disparate needs of management, technical personnel and end-users. The IT Analyst must also be acutely aware of the latest technology and how best to leverage its capabilities for an organization. The Int IT Analyst will work under tight deadlines and will work closely and effectively with cross fictional teams.  The Int IT Analyst will work under tight deadlines.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "118.38",
        "gsa_price_with_iff__a_": "118.38",
        "gsa_price_with_iff__b_": "121.87",
        "gsa_price_with_iff__c_": "125.47",
        "gsa_price_with_iff__d_": "129.17",
        "gsa_price_with_iff__e_": "132.98",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "IT analyst,communication,requirements gathering,functional specs,project management",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Sr. SCRUM Master",
      "hourly_rate": 144.91,
      "source_sheet_name": "Price List",
      "source_row_number": 41,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "LCAT541023",
        "title": "Sr. SCRUM Master",
        "description": "Senior Scrum Master will be responsible to facilitating daily scrum, sprint planning, sprint demo and retrospective meetings. The Scrum Master should be a friendly communicative person, because when team is moving fast in Agile, communication is the effective force which holds the team together.  The Scrum Master also needs to forecast the numbers of deliverables possible in an iteration, which is based on evidence and reliable source. The Scrum Master will be responsible for managing the scrum process with the coordination of scrum team in Agile methodology. Will also be responsible to remove the impediments for the scrum team.  The Scrum Master will help product owner to make the product backlogs in good shape and make them ready for the next sprint.\nWill also be responsible to conduct retrospective meetings in addition to acting as safeguard for the team.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "144.91",
        "gsa_price_with_iff__a_": "144.91",
        "gsa_price_with_iff__b_": "149.19",
        "gsa_price_with_iff__c_": "153.59",
        "gsa_price_with_iff__d_": "158.12",
        "gsa_price_with_iff__e_": "162.78",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "scrum master,agile,sprint planning,retrospective,impediment removal",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Sr. Application Programmer",
      "hourly_rate": 130.87,
      "source_sheet_name": "Price List",
      "source_row_number": 42,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "LCAT541024",
        "title": "Sr. Application Programmer",
        "description": "The Senior Application Programmer's role is to define, develop, test, analyze, and maintain new software\napplications in support of the achievement of business requirements. This includes writing, coding,\ntesting, and analyzing software programs and applications. The Senior Application Programmer personnel will also\nresearch, design, document, and modify software specifications throughout the production life cycle. This\nindividual will also provide mentoring, support and guidance to the Senior Application Programmer's role. The programmer will conduct research on emerging application development software products, languages, and standards in support of procurement and development efforts in addition to being in being responsible to recommend, schedule, and perform software improvements and upgrades.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "130.87",
        "gsa_price_with_iff__a_": "130.87",
        "gsa_price_with_iff__b_": "134.73",
        "gsa_price_with_iff__c_": "138.71",
        "gsa_price_with_iff__d_": "142.8",
        "gsa_price_with_iff__e_": "147.01",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "application developer,software development,testing,code,documentation",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Int. Network Administrator",
      "hourly_rate": 98.32,
      "source_sheet_name": "Price List",
      "source_row_number": 43,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "LCAT541025",
        "title": "Int. Network Administrator",
        "description": "Int. Network Administrator personnel is responsible for designing, organizing, modifying, installing, and supporting a company's computer systems. Designs and installs LANs, WANs, Internet and intranet systems, and network segments. Some of the responsibilities include to install and support LANs, WANs, network segments, Internet, and intranet systems in addition to installing and maintaining network hardware and software. Will also be responsible for analyzing and isolating issues in addition to monitoring networks to ensure security and availability to specific users. The Int. Network Administrator will evaluate and modify system's performance and will also identify user needs while determining network and system requirements.  The Int. Network Administrator will maintain integrity of the network, server deployment, and security and will ensure network connectivity throughout a company's LAN/WAN infrastructure is on par with technical considerations. Will also design and deploy networks and will perform network address assignment while using routing protocols and routing table configuration.  The Int. Network Administrator personnel will assign configuration of authentication and authorization of directory services and will also maintain network facilities in individual machines, such as drivers and settings of personal computers as well as printers.  The Int. Network Administrator will maintain network servers such as file servers, VPNgateways, intrusion detection systems in addition to administering servers, desktop computers, printers, routers, switches, firewalls, phones, personal digital assistants, smartphones, software deployment, security updates and patches.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "98.32",
        "gsa_price_with_iff__a_": "98.32",
        "gsa_price_with_iff__b_": "101.22",
        "gsa_price_with_iff__c_": "104.2",
        "gsa_price_with_iff__d_": "107.28",
        "gsa_price_with_iff__e_": "110.44",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "network admin,LAN,WAN,network security,troubleshooting",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Principal System Analyst",
      "hourly_rate": 129.89,
      "source_sheet_name": "Price List",
      "source_row_number": 44,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "LCAT541026",
        "title": "Principal System Analyst",
        "description": "Principal System Analyst personnel will evaluate causes as well as effects of business problems, analyze options plus propose solutions and will collaborate with varied business or system analysts, project team and business performing through project and organizational needs. \"The Principal System Analyst personnel will review Technical System Design (TSD) as well as QA Test Strategy/Plan documents. and will be involved in QA bug resolution plus update functional specification document as required. The Principal System Analyst will manage change control procedure and issue related list and will ensure every issue is well researched and recorded and supervise workflow for entire open items. The Principal System Analyst will also provide expertise on subject matter on various applications and will coordinate efforts of project estimation for review with cross organization technical as well as business teams in addition to leading and directing business requirements as well as design sessions for all new platforms and applications.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "129.89",
        "gsa_price_with_iff__a_": "129.89",
        "gsa_price_with_iff__b_": "133.72",
        "gsa_price_with_iff__c_": "137.67",
        "gsa_price_with_iff__d_": "141.73",
        "gsa_price_with_iff__e_": "145.91",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "7.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "system analyst,problem analysis,solution proposal,QA,test strategy",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Sr. Budget Analyst",
      "hourly_rate": 113.5,
      "source_sheet_name": "Price List",
      "source_row_number": 45,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "LCAT541027",
        "title": "Sr. Budget Analyst",
        "description": "Senior Budget Analyst personnel will oversee an organization budget or business’ spending to ensure that funds are allocated appropriately and used according to plan. They help to maintain records and create reports and proposals while working to analyze data and recommend funding for various programs. Budget Analyst personnel will also evaluate program effectiveness to determine if redistribution of funds is needed. Some primary duties include developing organizational budget with managers and reviewing proposals for completeness, accuracy and compliance with company standards.  The Senior Budget Analyst personnel will also be responsible for consolidating the organizational budget for review and vetting funding requests for merit and authenticity\nwhile monitoring spending and keeping the organization within its set budget.  Senior Budget Analyst personnel will also be responsible for preparing reports and estimating future financial needs in addition to defending budget recommendations with data and evidence-based analyses.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "113.5",
        "gsa_price_with_iff__a_": "113.5",
        "gsa_price_with_iff__b_": "116.85",
        "gsa_price_with_iff__c_": "120.3",
        "gsa_price_with_iff__d_": "123.85",
        "gsa_price_with_iff__e_": "127.5",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "budget analyst,financial analysis,budget planning,data analysis,funding evaluation",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Sr. System Engineer",
      "hourly_rate": 142.01,
      "source_sheet_name": "Price List",
      "source_row_number": 46,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "LCAT541028",
        "title": "Sr. System Engineer",
        "description": "Senior System Engineer personnel will be responsible of ensuring the stability, integrity, and efficient operation of the information systems that support core organizational functions. This will be achieved by monitoring, maintaining, supporting, and optimizing all networked software and associated operating systems. The Senior Systems Engineer will apply proven communication, analytical, and problem-solving skills to help identify, communicate, and resolve issues in order to maximize the benefit of IT systems investments.  The Senior System Engineer personnel will also mentor and provide guidance to the Systems Engineer staff. The Senior System Engineer personnel will collaborate with network staff to ensure smooth and reliable operation of software and systems for fulfilling business objectives and processes. The Senior System Engineer will work with executive team members, decision makers, and stakeholders to define business requirements and systems goals, and to identify and resolve business systems issues.  The Senior System Engineer personnel will also design and deploy new applications and enhancements to existing applications, software and operating systems in addition to performing cost-benefit and return on investment analyses for proposed systems to aid management in making implementation decisions.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "142.01",
        "gsa_price_with_iff__a_": "142.01",
        "gsa_price_with_iff__b_": "146.2",
        "gsa_price_with_iff__c_": "150.51",
        "gsa_price_with_iff__d_": "154.95",
        "gsa_price_with_iff__e_": "159.52",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "design,user",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Principal System Engineer",
      "hourly_rate": 178.73,
      "source_sheet_name": "Price List",
      "source_row_number": 47,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "LCAT541029",
        "title": "Principal System Engineer",
        "description": "Principal System Engineer will be responsible of supervising, and ensuring the stability, integrity, and efficient operation of the information systems that support core organizational functions. Will faction as the expert or project leader.  The Principal System Engineer will lead the monitoring, maintaining, supporting, and optimizing all networked software and associated operating systems. The Principal Systems Engineer will apply proven communication, analytical, and problem-solving skills to help identify, communicate, and resolve issues in order to maximize the benefit of IT systems investments.  The Principal  System Engineer will also mentor and provide guidance to the Systems Engineer staff. The Principal System Engineer will collaborate with network staff to ensure smooth and reliable operation of software and systems for fulfilling business objectives and processes. The Principal System Engineer will work with executive team members, decision makers, and stakeholders to define business requirements and systems goals, and to identify and resolve business systems issues.  The Principal System Engineer personnel will also design and deploy new applications and enhancements to existing applications, software and operating systems in addition to performing cost-benefit and return on investment analyses for proposed systems to aid management in making implementation decisions.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "178.73",
        "gsa_price_with_iff__a_": "178.73",
        "gsa_price_with_iff__b_": "184",
        "gsa_price_with_iff__c_": "189.43",
        "gsa_price_with_iff__d_": "195.02",
        "gsa_price_with_iff__e_": "200.77",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "7.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "communications analyst,call center,system upgrades,tier 3 support,requirements gathering",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Sr. User Experience User Interface Designer",
      "hourly_rate": 113.74,
      "source_sheet_name": "Price List",
      "source_row_number": 48,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "LCAT541030",
        "title": "Sr. User Experience User Interface Designer",
        "description": "Senior UX/UI Designer personnel will be responsible to ensure the work we produce maintains a high quality level while working with a team of other software product designers and developers. Senior UX/UX  Designer personnel should be ready to lead various critical aspects within our offering/services including research and strategy, information architecture, and interaction design to create high quality graphical user interfaces on multiple platforms. The UI/UX Designer will collaborate closely with teammates and clients throughout the entire lifecycle of IT projects. To succeed, the selected candidate will need to be very attentive to details. \nKey Responsibilities Include: \n• A heavy emphasis on user interface design for software products\n• Great eye and passionate for visual design\n• Define visual interfaces that adhere to and extend the defined wireframes and specifications\n• Create and communicate end-to-end scenarios, interaction models, and screen designs to clients and executives\n• Collaborate with other designers to evangelize new interface guidelines and design patterns\n• Actively seek to understand business requirements to develop solutions\n• Work with project management to create digital experiences on time and on budget\n• Ability to think beyond the user interface to touch brands and marketing\n• Comfortable presenting your work to clients and working with feedback\n\nMinimum Education: Bachelor’s Degree in Computer Science, Engineering, or Information Technology\nMinimum Experience: 5 years",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "113.74",
        "gsa_price_with_iff__a_": "113.74",
        "gsa_price_with_iff__b_": "117.09",
        "gsa_price_with_iff__c_": "120.55",
        "gsa_price_with_iff__d_": "124.1",
        "gsa_price_with_iff__e_": "127.77",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "design,experience",
        "domestic__overseas_or_domestic_and_overseas": "Domestic",
        "dol_occupation_code": "x",
        "dol_wage_determination": "x"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    },
    {
      "contract_number": "GS-35F-0525W",
      "labor_category": "Sr. Communication Analyst",
      "hourly_rate": 109.03,
      "source_sheet_name": "Price List",
      "source_row_number": 49,
      "raw_data": {
        "vendor_name": "TECHTREND, INC.",
        "unique_catalog_item_id": "LCAT541031",
        "title": "Sr. Communication Analyst",
        "description": "Senior Communications Analyst personnel will define project requirements and provide estimates on timing for project tasks. Using expert industry knowledge, this role will perform advanced tasks including building out call centers, code development for advancing call center capabilities, and performing system upgrades. The Senior Communications Analyst will provide high-level input to any system architecture change and provide Tier 3/expert level support. This role will be required to partner with customers and various internal/external organizations to ensure deliverables are met. Mentoring, coaching junior analysts will be part of this roles responsibility.  The Senior Communications Analyst will perform routine systems tasks and resolve assigned Help Desk tickets in a manner consistent with service level guidelines and customer service expectations in addition to interacting with customers and establish customer relationships to gather and analyze customer needs, assess available resources and determine optimal solutions.\nrt on Cisco communication platforms, execute procedures for end-user oriented break/fix repair, and move, add, change (MAC) requests.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "109.03",
        "gsa_price_with_iff__a_": "109.03",
        "gsa_price_with_iff__b_": "112.25",
        "gsa_price_with_iff__c_": "115.56",
        "gsa_price_with_iff__d_": "118.97",
        "gsa_price_with_iff__e_": "122.48",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "communications analyst,call center,system upgrades,tier 3 support,requirements gathering",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 12125,
      "price_list_id": 388
    }
  ],
  "parsed_at": "2025-11-06T11:53:52.837760"
}