{
  "contract_number": "GS-35F-469DA",
  "contractor_id": 11406,
  "price_list_id": 39,
  "labor_categories": [
    {
      "contract_number": "GS-35F-469DA",
      "labor_category": "Cloud Expert Subject Matter Expert",
      "hourly_rate": 373.9406,
      "source_sheet_name": "Price List",
      "source_row_number": 3,
      "raw_data": {
        "vendor_name": "SOLERITY INC",
        "unique_catalog_item_id": "PSS-101",
        "title": "Cloud Expert Subject Matter Expert",
        "description": "Provides consultation and strategic guidance to agency Information Technology (IT) staff to help shape IT strategy and direction for large, complex agency IT ecosystems. As part of an Enterprise Architecture (EA) program team, develops and maintains key agency EA products to include: Application Lifecycle Management (ALM) strategy, Continuous Integration (CI), and Continuous Deployment (CD) processes, and techniques under an overarching enterprise Platform-as-a-Service, DevOps, and Cloud Strategy. Responsible for building and maintaining a CI/CD strategy for the IRS and by extension, the DevOps strategy for application development, as well as operations management. Handles Cloud Strategy and Application Rationalization for Cloud Deployment, Cloud Vendor, or Platform Selection, and Cloud Migration strategy. Builds and maintains a cloud infrastructure strategy for federal agencies through providing inputs and advising clients as a Subject Matter Expert (SME), sometimes by creating the solution architecture or overseeing Proofs of Concept (POCs), to build multiple software POCs to assess the various needs of the client from the perspective of security, networking, and cloud infrastructure providers. Provides inputs and advice as a SME, sometimes by creating a solution architecture or overseeing POCs, to build multiple software POCs using the various types of application stack and PaaS solutions, inbuilt or external DevOps tools and methodologies, and come up with an incrementally updated policy, guideline, and checklist documents for the enterprise to use. Provides input for the new Internal Reference Manuals (IRMs) or rewrite older ones to administer formal approvals for the processes and tools associated with the PaaS and DevOps technologies.",
        "sin": "518210C",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "373.9406",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "education_and_experience_substitution": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
      "security_clearance": "No",
      "contractor_id": 11406,
      "price_list_id": 39
    },
    {
      "contract_number": "GS-35F-469DA",
      "labor_category": "Cloud Functional Analyst",
      "hourly_rate": 144.9901,
      "source_sheet_name": "Price List",
      "source_row_number": 4,
      "raw_data": {
        "vendor_name": "SOLERITY INC",
        "unique_catalog_item_id": "PSS-102",
        "title": "Cloud Functional Analyst",
        "description": "Analyzes cloud-related business requirements and project objectives and develops application functional specifications. Analyzes computer input, designs complex data sets, and envisions the data. Researches and develops original solutions to help client solve big data problems and to build holistic solutions for the client to help save time, money, and resources. Communicates with technical and non-technical users, business stakeholders or clients, developers, end-users, and Project Managers (PMs). Gathers and evaluates project requirements, meets with customers and partners to outline expectations, and defines stakeholder alignment. Discusses best practices for cloud for sales, service, and social projects across multiple methodologies. Keeps up to date on current and road-mapped cloud features, functionality, and terminology. Manages follow-ups and action items from meetings with Consultants, Service Delivery Managers, and/or Account Managers. Serves as a functional advisor and problem solver to stakeholders to assist them in understanding and optimizing data and their use of the product to define, build, and deploy online applications. Researches new developments. Writes advanced analytics on cloud-based technologies. Serves as a SME for updating and automating",
        "sin": "518210C",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "144.9901",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "6.0",
        "education_and_experience_substitution": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
      "security_clearance": "No",
      "contractor_id": 11406,
      "price_list_id": 39
    },
    {
      "contract_number": "GS-35F-469DA",
      "labor_category": "Cloud Network Engineer Senior",
      "hourly_rate": 145.115,
      "source_sheet_name": "Price List",
      "source_row_number": 5,
      "raw_data": {
        "vendor_name": "SOLERITY INC",
        "unique_catalog_item_id": "PSS-103",
        "title": "Cloud Network Engineer Senior",
        "description": "Ensures a seamless integration between on-premises infrastructure operations and optimal, efficient, and secure consolidated operations for cloud services. Develops and implements a role-based access control strategy integrated with on-premises Active Directory services. Manages Cloud providers’ applications, infrastructure, and systems. Develops, implements, and enforces standard procedures to provision and manages Cloud-based network, storage, and infrastructure constructs; and enforces standard procedures to provision and manage virtual assets, services, and databases. Ensures resilience, sizing, and capacity requirements are met; monitors Service-Level Agreements (SLAs), and burn rates. Possesses working knowledge of software development and the ability to identify and troubleshoot issues with little oversight.",
        "sin": "518210C",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "145.115",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "education_and_experience_substitution": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
      "security_clearance": "No",
      "contractor_id": 11406,
      "price_list_id": 39
    },
    {
      "contract_number": "GS-35F-469DA",
      "labor_category": "Cloud Program Manager",
      "hourly_rate": 190.6325,
      "source_sheet_name": "Price List",
      "source_row_number": 6,
      "raw_data": {
        "vendor_name": "SOLERITY INC",
        "unique_catalog_item_id": "PSS-104",
        "title": "Cloud Program Manager",
        "description": "Conducts financial and budgetary analysis to define project worth and to ascertain which system best fits user needs and company standards. Selects project team members and assigns tasks and responsibilities. Provides direction and technical guidance to project team members; communicates job expectations; and plans, monitors, and appraises job results. Plans, initiates, coordinates, and enforces systems, policies, and procedures. Manages, coordinates, and establishes priorities for complete life-cycle of projects including the planning, design, programming, testing, and implementation of business solutions designed to meet requirements of various departments in the company such as distribution, finance, and manufacturing. Designs project plans, which identify needs and define major tasks and milestones based on scope, resources, budget, and personnel. Determines project needs and acquires resources required for the success of the project. Coordinates the development of new systems and/or applications projects, the modification of existing systems or applications, or changes in current methods or techniques. Coordinates project performance with the other work of the affected department or departments.",
        "sin": "518210C",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "190.6325",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "15.0",
        "education_and_experience_substitution": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
      "security_clearance": "No",
      "contractor_id": 11406,
      "price_list_id": 39
    },
    {
      "contract_number": "GS-35F-469DA",
      "labor_category": "Cloud Senior Functional Analyst",
      "hourly_rate": 155.467,
      "source_sheet_name": "Price List",
      "source_row_number": 7,
      "raw_data": {
        "vendor_name": "SOLERITY INC",
        "unique_catalog_item_id": "PSS-105",
        "title": "Cloud Senior Functional Analyst",
        "description": "Analyzes cloud-related business requirements and project objectives, and develops application functional specifications. Analyzes computer input, designs complex data sets, and envisions the data. Researches and develops original solutions to help client solve big data problems and to build holistic solutions for the client to help save time, money, and resources. Communicates with technical and non-technical users, business stakeholders or clients, developers, end-users, and PMs. Gathers and evaluates project requirements, meets with customers and partners to outline expectations, and defines stakeholder alignment. Discusses best practices for cloud for sales, service, and social projects across multiple methodologies. Keeps up to date on current and road-mapped cloud features, functionality, and terminology. Manages follow-ups and action items from meetings with Consultants, Service Delivery Managers, and/or Account Managers. Serves as a functional advisor and problem solver to stakeholders to assist them in understanding and optimizing data and their use of the product to define, build, and deploy online applications. Researches new developments. Writes advanced analytics on cloud-based technologies, serves as a SME for updating and automating traditional analytical techniques through cloud-based solutions or automation and scripting.",
        "sin": "518210C",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "155.467",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "education_and_experience_substitution": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "Lexis Nexis,GOVLAW,PUPM",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
      "security_clearance": "No",
      "contractor_id": 11406,
      "price_list_id": 39
    },
    {
      "contract_number": "GS-35F-469DA",
      "labor_category": "Cloud Senior Subject Matter Expert",
      "hourly_rate": 287.629,
      "source_sheet_name": "Price List",
      "source_row_number": 8,
      "raw_data": {
        "vendor_name": "SOLERITY INC",
        "unique_catalog_item_id": "PSS-106",
        "title": "Cloud Senior Subject Matter Expert",
        "description": "Provides consultation and strategic guidance to agency IT staff to help shape IT strategy and direction for large, complex agency IT ecosystems. As part of an EA program team, develops, and maintains key agency EA products to include: ALM strategy, CI, and CD processes and techniques under an overarching enterprise Platform-as-a-Service, DevOps, and Cloud Strategy. Builds and maintain a CI/CD strategy for the IRS, and by extension, the DevOps strategy for application development as well as operations management. Initiates Cloud Strategy and Application Rationalization for Cloud Deployment, Cloud Vendor or Platform Selection, and Cloud Migration strategy. Builds and maintains a cloud infrastructure strategy for federal agencies through providing inputs and advising clients as a SME, sometimes by creating the solution architecture or overseeing POCs, to build multiple software POCs to assess the various needs of the client from the perspective of security, networking, and cloud infrastructure providers. Provide inputs and advice as a SME, sometimes by creating a solution architecture or overseeing POCs, to build multiple software POCs using the various types of application stack and PaaS solutions, inbuilt or external DevOps tools and methodologies, and come up with an incrementally updated policy, guideline, and checklist",
        "sin": "518210C",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "287.629",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "6.0",
        "education_and_experience_substitution": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
      "security_clearance": "No",
      "contractor_id": 11406,
      "price_list_id": 39
    },
    {
      "contract_number": "GS-35F-469DA",
      "labor_category": "Cloud System Administrator",
      "hourly_rate": 166.8489,
      "source_sheet_name": "Price List",
      "source_row_number": 9,
      "raw_data": {
        "vendor_name": "SOLERITY INC",
        "unique_catalog_item_id": "PSS-107",
        "title": "Cloud System Administrator",
        "description": "Sets up public and/or private cloud systems, understanding and depending on type of workload, and deploys them in an automated way; and monitors, moves, and alters the systems using a prescribed methodology. Establishes and implements standards for cloud operations according to specifications and parameters. Determines business needs, and selects a cloud provider(s) that best fits the requirements. Questions and determines cost, business use, location of users, security, and other vectors, which brings he position closer to the business and its goals. Troubleshoots when problems arise, and plans for future cloud capacity requirements. Administers, develops, configures, implements, and maintains the systems that comprise the underlying cloud platform. Sets up public and/or private cloud systems, understanding and depending on type of workload, and deploys them in an automated way; and monitors, moves, and alters the systems using a prescribed methodology. Establishes and implements standards for cloud operations according to specifications and parameters. Determines business needs, and selects a cloud provider(s) that best fits the requirements. Questions and determines cost, business use, location of users, security, and other vectors, which brings the position closer to the business and its goals. Troubleshoots when problems arise, and plans for future cloud capacity requirements. Coordinates and works with others on various parts of the implementation. Schedules, performs, and monitors system backups and, when necessary, performs data recoveries. Recommends upgrades according to growth statistics and forecasts. Schedules, plans, and performs system upgrades, including coordinating the transition from test to production environments. Provides technical support for system users.",
        "sin": "518210C",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "166.8489",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "4.0",
        "education_and_experience_substitution": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "OLM",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
      "security_clearance": "No",
      "contractor_id": 11406,
      "price_list_id": 39
    },
    {
      "contract_number": "GS-35F-469DA",
      "labor_category": "Cloud Systems Administrator - Developmental",
      "hourly_rate": 94.0834,
      "source_sheet_name": "Price List",
      "source_row_number": 10,
      "raw_data": {
        "vendor_name": "SOLERITY INC",
        "unique_catalog_item_id": "PSS-108",
        "title": "Cloud Systems Administrator - Developmental",
        "description": "Cloud Systems Administrator - Developmental maintains and supports the integrity of the operating system environment and various computer systems. Administers, installs, and troubleshoots a variety of operating systems. Being a Systems Administrator, performs systems maintenance tasks, such as system back-up, recovery, and file maintenance. Schedules, installs, and tests system software upgrades. Additionally, Systems Administrator configures software and resolves technical problems. Monitors and maintains software licensing and maintenance agreements. Typically reports to a project leader or manager. Occasionally directed in several aspects of the work.",
        "sin": "518210C",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "94.0834",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "1.0",
        "education_and_experience_substitution": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
      "security_clearance": "No",
      "contractor_id": 11406,
      "price_list_id": 39
    },
    {
      "contract_number": "GS-35F-469DA",
      "labor_category": "Database Administrator",
      "hourly_rate": 150.2442,
      "source_sheet_name": "Price List",
      "source_row_number": 11,
      "raw_data": {
        "vendor_name": "SOLERITY INC",
        "unique_catalog_item_id": "PSS-109",
        "title": "Database Administrator",
        "description": "Provides all activities related to the administration of computerized databases. Projects long-range requirements for database administration and design in conjunction with other managers in the information systems function. Designs, creates, and maintains databases in a client/server environment. Conducts quality control and auditing of databases in a client/server environment to ensure accurate and appropriate use of data. Advises users on access to various client/server databases. Designs, implements, and maintains complex databases with respect to JCL, access methods, access time, device allocation, validation checks, organization, protection and security, documentation, and statistical methods. Applies knowledge and experience with database technologies, development methodologies, and front-end /back-end programming languages (e.g., SQL). Performs database programming and supports systems design. Includes maintenance of database dictionaries, overall monitoring of standards and procedures, file design and storage, and integration of systems through database design.",
        "sin": "54151S",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "150.2442",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
      "security_clearance": "No",
      "contractor_id": 11406,
      "price_list_id": 39
    },
    {
      "contract_number": "GS-35F-469DA",
      "labor_category": "Expert SME",
      "hourly_rate": 373.9406,
      "source_sheet_name": "Price List",
      "source_row_number": 12,
      "raw_data": {
        "vendor_name": "SOLERITY INC",
        "unique_catalog_item_id": "PSS-110",
        "title": "Expert SME",
        "description": "Serves as a SME, possessing in-depth knowledge on subjects relating to the conduct, activities, governance, business practices, or operations. Provides expert support, analysis, and research with only broad direction into exceptionally complex problems and processes relating to the subject matter. Provides extensive technical knowledge, analysis of, understanding, and experience in the application of technical principles, theories, and concepts in the required technical field, as well as having full knowledge of other related disciplines. Handles exceptionally complex problems that need extensive knowledge of the subject matter for effective development and implementation of solutions. Provides technical solutions to a wide range of complex problems. Provides technical expertise in a particular area of IT (e.g. Information Systems Architecture, Telecommunications Systems Design, Architecture, Implementation, Information Systems Integration, Software Development Methodologies, Security Engineering, Communications, Network Systems Management, etc.) or a specific functional area (e.g. finance, logistics, operations research, planning, policy, technical intelligence, etc.).",
        "sin": "54151S",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "373.9406",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "education_and_experience_substitution": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
      "security_clearance": "No",
      "contractor_id": 11406,
      "price_list_id": 39
    },
    {
      "contract_number": "GS-35F-469DA",
      "labor_category": "Functional Analyst",
      "hourly_rate": 145.115,
      "source_sheet_name": "Price List",
      "source_row_number": 13,
      "raw_data": {
        "vendor_name": "SOLERITY INC",
        "unique_catalog_item_id": "PSS-111",
        "title": "Functional Analyst",
        "description": "Responsible for identifying and documenting all specific functional requirements associated with implementing the application. Develops a comprehensive functional description of current and future system and process requirements through structured interviews, focus groups, documentation review, and other data gathering techniques. Interfaces with technical personnel to identify specific system requirements and risks. Works directly with agency/organization functional staff members to identify specific application views and data requirements to ensure that the final system incorporates required functionality.",
        "sin": "54151S",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "145.115",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "6.0",
        "education_and_experience_substitution": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
      "security_clearance": "No",
      "contractor_id": 11406,
      "price_list_id": 39
    },
    {
      "contract_number": "GS-35F-469DA",
      "labor_category": "Help Desk Support",
      "hourly_rate": 47.4839,
      "source_sheet_name": "Price List",
      "source_row_number": 14,
      "raw_data": {
        "vendor_name": "SOLERITY INC",
        "unique_catalog_item_id": "PSS-112",
        "title": "Help Desk Support",
        "description": "Provides telephone and in-person support to users in the areas of e-mail, directories, standard windows desktop COTS applications, and applications developed under this contract for predecessors. Serves as the initial point of contact for troubleshooting hardware/software PC and printer problems. Has demonstrated ability to communicate orally and in writing and a positive customer service attitude.",
        "sin": "54151S",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "47.4839",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
      "security_clearance": "No",
      "contractor_id": 11406,
      "price_list_id": 39
    },
    {
      "contract_number": "GS-35F-469DA",
      "labor_category": "Network Engineer Sr",
      "hourly_rate": 145.115,
      "source_sheet_name": "Price List",
      "source_row_number": 15,
      "raw_data": {
        "vendor_name": "SOLERITY INC",
        "unique_catalog_item_id": "PSS-113",
        "title": "Network Engineer Sr",
        "description": "Shall have a Bachelor's Degree in Computer Science, Information Systems, or Network Engineering and at least eight (8) years of experience in network engineering (LAN/WAN), architecture, monitoring, security, and protection. Or the individual shall have five (5) years of full time CS work that can be substituted for the Bachelor's degree and at least eight (8) years of experience in network engineering (LAN/WAN), architecture, monitoring, security, and protection. Must have datacenter network design and architecture experience to include the installation and configurations of Cisco routers, switches, firewalls, and IPSEC vi1tual private networks.",
        "sin": "54151S",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "145.115",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "education_and_experience_substitution": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
      "security_clearance": "No",
      "contractor_id": 11406,
      "price_list_id": 39
    },
    {
      "contract_number": "GS-35F-469DA",
      "labor_category": "Program Manager",
      "hourly_rate": 190.6325,
      "source_sheet_name": "Price List",
      "source_row_number": 16,
      "raw_data": {
        "vendor_name": "SOLERITY INC",
        "unique_catalog_item_id": "PSS-114",
        "title": "Program Manager",
        "description": "Serves as the Contractor counterpart to the ordering activity program/technical managers. Responsible for adhering to work standards, assigning schedules, reviewing work, supervising contractor personnel and communicating policies, procedures, and goals of the organization to personnel. Manages a diverse group of functional activities, subordinate groups of technical and administrative personnel. Manages substantial program/technical support operations involving multiple projects/task orders and personnel at diverse locations. Organizes, directs, and coordinates planning and execution of all program/technical support activities. Has demonstrated information technology expertise and communications skills to be able to interface with all levels of management. Simultaneously plans and manages the transition of several highly technical projects. Establishes and alters (as necessary) management structure to effectively direct program/technical support activities. Meets and confers with ordering activity management officials regarding the status of specific projects. Responsible for the contractor program/technical activities and problems, issues, or conflicts regarding resolution.",
        "sin": "54151S",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "190.6325",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "15.0",
        "education_and_experience_substitution": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
      "security_clearance": "No",
      "contractor_id": 11406,
      "price_list_id": 39
    },
    {
      "contract_number": "GS-35F-469DA",
      "labor_category": "Project Administrator",
      "hourly_rate": 97.371,
      "source_sheet_name": "Price List",
      "source_row_number": 17,
      "raw_data": {
        "vendor_name": "SOLERITY INC",
        "unique_catalog_item_id": "PSS-115",
        "title": "Project Administrator",
        "description": "Provides expertise to conduct investigations and studies and presents recommendations and solutions related to short and long range program planning requirements. Classifies and summarizes data for the preparation and submission of reports on a recurring basis. Provides advice and assistance to managers which directly affect the conduct and attainment of agency goals and objectives.",
        "sin": "54151S",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "97.371",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "education_and_experience_substitution": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
      "security_clearance": "No",
      "contractor_id": 11406,
      "price_list_id": 39
    },
    {
      "contract_number": "GS-35F-469DA",
      "labor_category": "Project Manager",
      "hourly_rate": 116.6809,
      "source_sheet_name": "Price List",
      "source_row_number": 18,
      "raw_data": {
        "vendor_name": "SOLERITY INC",
        "unique_catalog_item_id": "PSS-116",
        "title": "Project Manager",
        "description": "Directs completion of complex information technology tasks within estimated timeframe and budget constraints. Schedules and assigns duties to subordinates and subcontractors and ensures assignments are completed as directed. Enforces work standards and reviews/resolves work discrepancies to ensure compliance with contract requirements. Interfaces with the Contractor's Program Manager as well as ordering activity management personnel including, but not limited to, the Contracting Officer (CO) and the Contracting Officer's Technical Representative (COTR). Reports in writing and orally to contractor management and ordering activity representative. Provides competent technical leadership and is responsible for program direction through successful performance of a variety of detailed, diverse elements of information technology projects. Assists the Program Manager in working with the ordering activity Contracting Representative to ensure work standards and schedules are being met. Assists in managing a group on functional activities and subordinate groups of technical and administrative personnel.",
        "sin": "54151S",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "116.6809",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "12.0",
        "education_and_experience_substitution": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
      "security_clearance": "No",
      "contractor_id": 11406,
      "price_list_id": 39
    },
    {
      "contract_number": "GS-35F-469DA",
      "labor_category": "Project Manager - Full Performer",
      "hourly_rate": 81.3697,
      "source_sheet_name": "Price List",
      "source_row_number": 19,
      "raw_data": {
        "vendor_name": "SOLERITY INC",
        "unique_catalog_item_id": "PSS-117",
        "title": "Project Manager - Full Performer",
        "description": "Directs completion of complex information technology tasks within estimated timeframe and budget constraints. Schedules and assigns duties to subordinates and subcontractors and ensures assignments are completed as directed. Enforces work standards and reviews/resolves work discrepancies to ensure compliance with contract requirements. Interfaces with the Contractor's Program Manager as well as ordering activity management personnel including, but not limited to, the CO and the COTR. Reports in writing and orally to contractor management and ordering activity representative. Provides competent technical leadership and is responsible for program direction through successful performance of a variety of detailed, diverse elements of information technology projects. Assists the Program Manager in working with the ordering activity Contracting Representative to ensure work standards and schedules are being met. Assists in managing a group on functional activities and subordinate groups of technical and administrative personnel.",
        "sin": "54151S",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "81.3697",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "11.0",
        "education_and_experience_substitution": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
      "security_clearance": "No",
      "contractor_id": 11406,
      "price_list_id": 39
    },
    {
      "contract_number": "GS-35F-469DA",
      "labor_category": "Quality Assurance Analyst",
      "hourly_rate": 118.5848,
      "source_sheet_name": "Price List",
      "source_row_number": 20,
      "raw_data": {
        "vendor_name": "SOLERITY INC",
        "unique_catalog_item_id": "PSS-118",
        "title": "Quality Assurance Analyst",
        "description": "Develops and implements Quality Control (QC) methodologies to ensure compliance with QA standards, guidelines, and procedures in a large computer-based organization. Reviews information systems requirements and develops and implements test plans ensuring proposed data processing systems modules, programs, and systems are stress tested, error free and meet stated requirements before implementation. Must be adept at problem definition and resolution. Must be capable of documenting problems and preparing recommendations for their solution.",
        "sin": "54151S",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "118.5848",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
      "security_clearance": "No",
      "contractor_id": 11406,
      "price_list_id": 39
    },
    {
      "contract_number": "GS-35F-469DA",
      "labor_category": "Quality Assurance Analyst - SME",
      "hourly_rate": 161.9695,
      "source_sheet_name": "Price List",
      "source_row_number": 21,
      "raw_data": {
        "vendor_name": "SOLERITY INC",
        "unique_catalog_item_id": "PSS-119",
        "title": "Quality Assurance Analyst - SME",
        "description": "Recognized expert within the Company, who designs, researches, and develops highly advanced applications, which may result in new product/business opportunities for the Company. Leads efforts to capture new business through technical work and capability briefings. Ensures that QC procedures adequately evaluate products. Determines if current methods and techniques result in meeting reliability standards or require modification. Develops, modifies, applies, and maintains quality evaluation and control systems and protocols for processing materials into partially finished or finished materials product. Collaborates with engineering and manufacturing functions to ensure quality standards are in place. Devises and implements methods and procedures for inspecting, testing, and evaluating the precision and accuracy of products and production equipment. Designs and analyzes inspection and testing processes, mechanisms, and equipment; conducts QA tests; and performs statistical analysis to assess the cost of and determine the responsibility for products or materials that do not meet required standards and specifications. Audits quality systems for deficiency identification and correction. Ensures that corrective measures meet acceptable reliability standards and that documentation is compliant with requirements. May specialize in the areas of design, incoming material; production control, product evaluation, and reliability; inventory control; and/or research and development as they apply to product or process quality. May be certified in lean and six-sigma quality engineering methodologies.",
        "sin": "54151S",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "161.9695",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "20.0",
        "education_and_experience_substitution": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
      "security_clearance": "No",
      "contractor_id": 11406,
      "price_list_id": 39
    },
    {
      "contract_number": "GS-35F-469DA",
      "labor_category": "Security Specialist",
      "hourly_rate": 132.5157,
      "source_sheet_name": "Price List",
      "source_row_number": 22,
      "raw_data": {
        "vendor_name": "SOLERITY INC",
        "unique_catalog_item_id": "PSS-120",
        "title": "Security Specialist",
        "description": "Serves as an Intelligence Specialist (Cyber Operations) with responsibilities for participating in the production of all-source intelligence products pertaining to computer operation and planning activities Applies a wide range of intelligence analytic skills to monitor, assess, and report on cyberspace operations, capabilities, vulnerabilities, and personalities that could pose a threat to U.S. computers, communications, weapon systems, and operations. Advises stakeholders on key developments in their assigned area, including immediate and long-term responses. Conducts reviews, identifies gaps, recommends solutions, and ensures alignment with strategies. Supports decision-making and special projects on the preparation, production, and coordination of written products and briefings for stakeholders and leadership. In conjunction with senior analysts, develops and/or recommends complex analytic approaches to problems and situation for which data are incomplete, controversial, or which no precedents exists. Excellent communication skills.",
        "sin": "54151S",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "132.5157",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
      "security_clearance": "No",
      "contractor_id": 11406,
      "price_list_id": 39
    },
    {
      "contract_number": "GS-35F-469DA",
      "labor_category": "Senior Functional Analyst",
      "hourly_rate": 155.467,
      "source_sheet_name": "Price List",
      "source_row_number": 23,
      "raw_data": {
        "vendor_name": "SOLERITY INC",
        "unique_catalog_item_id": "PSS-121",
        "title": "Senior Functional Analyst",
        "description": "Analyzes user needs to determine functional and cross-functional requirements. Performs functional allocation to identify required tasks and their interrelationships. Identifies resources required to complete each task. Works directly with agency/organization functional staff members to identify specific application views and data requirements to ensure that the final system incorporates required functionality. Responsible for feasibility studies, time and cost estimates, and the establishment and implementation of new or revised applications systems and programs. Assists in projecting software and hardware requirements. Demonstrates the ability to work independently. Shows leadership skills and has led a team on three successful projects. Has current knowledge of functions being developed or automated.",
        "sin": "54151S",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "155.467",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "education_and_experience_substitution": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
      "security_clearance": "No",
      "contractor_id": 11406,
      "price_list_id": 39
    },
    {
      "contract_number": "GS-35F-469DA",
      "labor_category": "Senior SME",
      "hourly_rate": 287.6394,
      "source_sheet_name": "Price List",
      "source_row_number": 24,
      "raw_data": {
        "vendor_name": "SOLERITY INC",
        "unique_catalog_item_id": "PSS-122",
        "title": "Senior SME",
        "description": "Serves as a SME, possessing in-depth knowledge on subjects relating to the conduct, activities, governance, business practices, or operations. Provides expert support, analysis, and research with only broad direction into exceptionally complex problems and processes relating to the subject matter. Provides extensive technical knowledge, analysis of, understanding, and experience in the application of technical principles, theories, and concepts in the required technical field, as well as having full knowledge of other related disciplines exceptionally complex problems that need extensive knowledge of the subject matter for effective development, and implementation of solutions. Provides technical solutions to a wide range of complex problems. Provides technical expertise in a particular area of IT (e.g. Information Systems Architecture, Telecommunications Systems Design, Architecture, Implementation, Information Systems Integration, Software Development Methodologies, Security Engineering, Communications, Network Systems Management, etc.) or a specific functional area (e.g. finance, logistics, operations research, planning, policy, technical intelligence, etc.).",
        "sin": "54151S",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "287.6394",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "6.0",
        "education_and_experience_substitution": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
      "security_clearance": "No",
      "contractor_id": 11406,
      "price_list_id": 39
    },
    {
      "contract_number": "GS-35F-469DA",
      "labor_category": "Senior Web Developer",
      "hourly_rate": 155.3317,
      "source_sheet_name": "Price List",
      "source_row_number": 25,
      "raw_data": {
        "vendor_name": "SOLERITY INC",
        "unique_catalog_item_id": "PSS-123",
        "title": "Senior Web Developer",
        "description": "Consults with clients and other project team members to design, build, and manage websites. Develops installation programs for websites. May negotiate contracts/agreements with software vendors and other internet companies. Relies on experience and judgment to plan and accomplish goals. Performs a variety of complicated tasks. May lead and direct the work of others. A wide degree of creativity and latitude is expected. Typically reports to a project leader or manager.",
        "sin": "54151S",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "155.3317",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
      "security_clearance": "No",
      "contractor_id": 11406,
      "price_list_id": 39
    },
    {
      "contract_number": "GS-35F-469DA",
      "labor_category": "Software Developer",
      "hourly_rate": 114.0799,
      "source_sheet_name": "Price List",
      "source_row_number": 26,
      "raw_data": {
        "vendor_name": "SOLERITY INC",
        "unique_catalog_item_id": "PSS-124",
        "title": "Software Developer",
        "description": "Developing new software applications in partnership with business analysts and technical architects. Upgrading existing software as the user organization’s needs change. Localizing software products for different international markets. Testing software to ensure the code is correct, fixing ('debugging') errors where they occur, and rerunning and rechecking the program until it produces the correct results. Working with trainers and technical writers to develop user support materials.",
        "sin": "54151S",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "114.0799",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "education_and_experience_substitution": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
      "security_clearance": "No",
      "contractor_id": 11406,
      "price_list_id": 39
    },
    {
      "contract_number": "GS-35F-469DA",
      "labor_category": "Software Developer - Expert",
      "hourly_rate": 130.102,
      "source_sheet_name": "Price List",
      "source_row_number": 27,
      "raw_data": {
        "vendor_name": "SOLERITY INC",
        "unique_catalog_item_id": "PSS-125",
        "title": "Software Developer - Expert",
        "description": "Recognized expert within the Company, who designs, researches, and develops highly advanced applications, which may result in new product/business opportunities for the Company. Leads efforts to capture new business through technical work and capability briefings. Ensures that QC procedures adequately evaluate products. Determines if current methods and techniques result in meeting reliability standards or require modification. Develops, modifies, applies, and maintains quality evaluation and control systems and protocols for processing materials into partially finished or finished materials product. Collaborates with engineering and manufacturing functions to ensure quality standards are in place. Devises and implements methods and procedures for inspecting, testing, and evaluating the precision and accuracy of products and production equipment. Designs and analyzes inspection and testing processes, mechanisms, and equipment; conducts QA tests; and performs statistical analysis to assess the cost of and determines the responsibility for, products or materials that do not meet required standards and specifications. Audits quality systems for deficiency identification and correction. Ensures that corrective measures meet acceptable reliability standards and that documentation is compliant with requirements. May specialize in the areas of design, incoming material, production control, product evaluation, and reliability, inventory control, and/or research and development as they apply to product or process quality. May be certified in lean and six-sigma quality engineering methodologies.",
        "sin": "54151S",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "130.102",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "12.0",
        "education_and_experience_substitution": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
      "security_clearance": "No",
      "contractor_id": 11406,
      "price_list_id": 39
    },
    {
      "contract_number": "GS-35F-469DA",
      "labor_category": "Software Engineer",
      "hourly_rate": 168.7217,
      "source_sheet_name": "Price List",
      "source_row_number": 28,
      "raw_data": {
        "vendor_name": "SOLERITY INC",
        "unique_catalog_item_id": "PSS-126",
        "title": "Software Engineer",
        "description": "Analyzes and studies complex system requirements. Designs software tools and subsystems to support software reuse and domain analyses and manages their implementation. Supports the development of unique system software as well as the integration of Commercial Off-The-Shelf (COTS) software integration. Manages software development and support using formal specifications, data flow diagrams, other accepted design techniques, and Computer Aided Software Engineering (CASE) tools. Interprets software requirements and design specifications code, and integrates and tests software components. Estimates software development costs and schedule. Reviews existing programs and assists in making refinements, reducing operating time, and improving current techniques. Supervises software configuration management.",
        "sin": "54151S",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "168.7217",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "education_and_experience_substitution": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
      "security_clearance": "No",
      "contractor_id": 11406,
      "price_list_id": 39
    },
    {
      "contract_number": "GS-35F-469DA",
      "labor_category": "Sr. Documentation Specialist",
      "hourly_rate": 82.098,
      "source_sheet_name": "Price List",
      "source_row_number": 29,
      "raw_data": {
        "vendor_name": "SOLERITY INC",
        "unique_catalog_item_id": "PSS-127",
        "title": "Sr. Documentation Specialist",
        "description": "Supervises and coordinates daily activities of documentation staff within the department. Ensures new and existing publications are in accordance with established documentation procedures. Ensures any necessary internal process documentation. May require an associate's degree or its equivalent and at least five (5) years of experience in the field or in a related area. Familiar with a variety of the field's concepts, practices, and procedures. Relies on extensive experience and judgment to plan and accomplish goals. Performs a variety of tasks. Leads and directs the work of others. A wide degree of creativity and latitude is expected. Typically reports to a manager or head of a unit/department. Manages the documentation department in accordance with organizational policies and goals. Develops standard documentation methods to effectively communicate product concepts and use. Ensures any necessary internal process documentation.",
        "sin": "54151S",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "82.098",
        "minimum_education": "Associates",
        "minimum_years_of_education": "7.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Associates",
      "security_clearance": "No",
      "contractor_id": 11406,
      "price_list_id": 39
    },
    {
      "contract_number": "GS-35F-469DA",
      "labor_category": "Systems Administrator",
      "hourly_rate": 166.8489,
      "source_sheet_name": "Price List",
      "source_row_number": 30,
      "raw_data": {
        "vendor_name": "SOLERITY INC",
        "unique_catalog_item_id": "PSS-128",
        "title": "Systems Administrator",
        "description": "Supervises the monitoring of network facilities. Ensures high quality transmission on network. Directs testing and analysis of all elements of the network facility (including hardware, software, power, communications, lines, modems, and terminals). Supervises testing and analysis of all elements of the network facilities (including software, power, communications machinery, lines, modems, and terminals). Serves as key contact for remote locations and customers to obtain clarification of problems and provides resolution of system failures and degradations. Optimizes system operations and resource utilization and performs system capacity analysis and planning. Provides assistance to users in accessing and using business/computer systems. Monitors and supports computer processing. Coordinates input, output, and file media. Distributes output and controls computer operation.",
        "sin": "54151S",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "166.8489",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "4.0",
        "education_and_experience_substitution": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
      "security_clearance": "No",
      "contractor_id": 11406,
      "price_list_id": 39
    },
    {
      "contract_number": "GS-35F-469DA",
      "labor_category": "Systems Administrator - Developmental",
      "hourly_rate": 94.0834,
      "source_sheet_name": "Price List",
      "source_row_number": 31,
      "raw_data": {
        "vendor_name": "SOLERITY INC",
        "unique_catalog_item_id": "PSS-129",
        "title": "Systems Administrator - Developmental",
        "description": "Develops solutions to routine technical problems of limited scope following detailed instructions. Work is supervised. Maintains smooth operation of multi-user computer systems, including coordination with network engineers. Monitors and manages system resources, including CPU usage, disk usage, and response times to maintain operating efficiency. Performs systems security administration functions, including creating user profiles and accounts. Other duties may include setting up administrator accounts; maintaining system documentation; tuning system performance; and installing system wide software and allocating mass storage space. Interacts with users and evaluates vendor products. Makes recommendations to purchase hardware and software, coordinates installation, and provides backup recovery. Develops and monitors policies and standards for allocation related to the use of computing resources. May be assigned responsibility for less experienced staff.",
        "sin": "54151S",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "94.0834",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "1.0",
        "education_and_experience_substitution": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
      "security_clearance": "No",
      "contractor_id": 11406,
      "price_list_id": 39
    },
    {
      "contract_number": "GS-35F-469DA",
      "labor_category": "Systems Engineer",
      "hourly_rate": 163.3948,
      "source_sheet_name": "Price List",
      "source_row_number": 32,
      "raw_data": {
        "vendor_name": "SOLERITY INC",
        "unique_catalog_item_id": "PSS-130",
        "title": "Systems Engineer",
        "description": "Applies software, hardware, and standards information technology skills in the analysis, specification, development, integration, and acquisition of systems for information management applications. Provides technical leadership developing solutions for engineering studies. Evaluates and recommends COTS applications and methodologies that can be acquired to provide interoperable, portable, and scalable information technology solutions. Performs analysis and validation of reusable software/hardware components to ensure the integration of these components into interoperable information management designs.",
        "sin": "54151S",
        "predominant_work_site": "Virtual",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "163.3948",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "4.0",
        "education_and_experience_substitution": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "years_experience": "Associate’s + 2 years’ experience or 4 years’ relevant experience, Professional certification in lieu of the Bachelor’s degree",
      "security_clearance": "No",
      "contractor_id": 11406,
      "price_list_id": 39
    }
  ],
  "parsed_at": "2025-11-06T11:56:31.274126"
}