{
  "contract_number": "GS-35F-705GA",
  "contractor_id": 13321,
  "price_list_id": 1351,
  "labor_categories": [
    {
      "contract_number": "GS-35F-705GA",
      "labor_category": "Application Architect",
      "hourly_rate": 119.48,
      "source_sheet_name": "Price List",
      "source_row_number": 3,
      "raw_data": {
        "vendor_name": "ZION CLOUD SOLUTIONS LLC",
        "unique_catalog_item_id": "LCAT-001",
        "title": "Application Architect",
        "description": "Responsible for translating the requirements created by functional analysts into the architecture for that solution and describing it through the set of architecture and design documents. Those documents are then used by the rest of the development team to implement the solution. The process of defining architecture by the solutions architect often involves selection of the most appropriate technology for the problem being solved, impact assessment as well as technical and operational feasibility. Also, Responsible for developing the high-level strategy to solve business problems. Ensure solutions adhere to enterprise standards. May be aligned to an applications or a technology stack. Proficient in Object Oriented Programming languages. Familiarity with Government IT solutions involving multiple Federal/State agencies and platforms. Preferred Certifications: TOGAF Certification, Cloud Solution Architect Certification(s)",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "119.48",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "7.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "architecture,design,technology,programming,applications",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 13321,
      "price_list_id": 1351
    },
    {
      "contract_number": "GS-35F-705GA",
      "labor_category": "Application Programmer",
      "hourly_rate": 86.36,
      "source_sheet_name": "Price List",
      "source_row_number": 4,
      "raw_data": {
        "vendor_name": "ZION CLOUD SOLUTIONS LLC",
        "unique_catalog_item_id": "LCAT-002",
        "title": "Application Programmer",
        "description": "Develops, enhances, tests, supports, maintains and debugs software applications that support business units or support functions. A senior member of the technical team responsible for assisting senior business leaders and management. May provide strategic technical direction and system architecture for individual initiatives. Utilizes in-depth knowledge of technological alternatives and business system requirements to recommend innovations that enhance and/or provide a competitive advantage to the organization. Leads or has responsibility for estimation of effort for software application for one or more programmers. Coordinates collaboration with external programming teams to deliver software on time and within budget. Provides feedback and technical guidance to project managers on issues of critical importance to achieving business objectives. Is clearly recognized as a content expert by peers. Proficient in Object Oriented Programming, Expert with SDLC tools and Agile/Waterfall methodology. Familiarity with Government IT solutions involving multiple Federal/State agencies and platforms. Preferred Certifications: Technology based Certification such as Oracle Certified Java programmers, MS .NET Certification, AWS Certified Developer",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "86.36",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "software,technical,prgramming,developer",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 13321,
      "price_list_id": 1351
    },
    {
      "contract_number": "GS-35F-705GA",
      "labor_category": "Big Data Engineer",
      "hourly_rate": 86.36,
      "source_sheet_name": "Price List",
      "source_row_number": 5,
      "raw_data": {
        "vendor_name": "ZION CLOUD SOLUTIONS LLC",
        "unique_catalog_item_id": "LCAT-003",
        "title": "Big Data Engineer",
        "description": "Contributes strategic vision and integrates a broad range of ideas regarding Big Data analysis and development. Recognized across the organization for database expertise and sought as a resource for resolution of complex ETL problems. Undertakes the most complex Big Data projects involving multiple disciplines and may impact multiple Business unites, Exercises judgment within broadly defined practices and policies in selecting methods, techniques, and evaluation criterion for obtaining results. Acts as a subject matter expert in multiple Big Data management platforms and ETL Products. Skills and Experience include: Skills in Java, SQL, XML and Tomcat. Must have some exposure to Data Integration, or, preferably with Talend’s products. Preferred experience in Eclipse, SQL and Oracle environments. Knowledge in installation, configuration, optimization in Hadoop. Understand how and when to apply MapReduce. Knowledge in HBase, Hive, Sqoop, Oozie technologies. Knowledge in NoSQL technologies (Mongo, CouchDB, Cassandra, Neo4j). Exposed to Spark, Impala, HAWQ. Preferred Project Management. Professional (PMP) certification or equivalent skills. Technical aggressiveness, demonstrated ability to learn newtechnologies and business requirements. Demonstrated creative problem solving ability. Experience leading and managing engagements and implementations. Exceptional verbal, presentation, and written communication skills. Ability to work effectively independently as well as in a team environment. Preferred Certifications: Preferred Project, Management Professional (PMP) certification or equivalent skills. Technical aggressiveness, demonstrated ability to learn new technologies and business requirements. Demonstrated creative problem solving ability. Experience leading and managing engagements and implementations. Exceptional verbal, presentation, and written communication skills. Ability to work effectively independently as well as in a team environment",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "86.36",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "database,management,installation,configuration,optimization",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 13321,
      "price_list_id": 1351
    },
    {
      "contract_number": "GS-35F-705GA",
      "labor_category": "Cloud Engineer",
      "hourly_rate": 129.54,
      "source_sheet_name": "Price List",
      "source_row_number": 6,
      "raw_data": {
        "vendor_name": "ZION CLOUD SOLUTIONS LLC",
        "unique_catalog_item_id": "LCAT-004",
        "title": "Cloud Engineer",
        "description": "Design and implement architectural roadmaps regarding the data center Infrastructure-as-a-Service (IaaS) architecture. Develop and implement internal systems, processes, and best practices to be used by other teams designed to increase productivity. Participate in deep architectural discussions to ensure solutions are designed for successful deployment, security, and high availability in the cloud. Recommend architecture to meet business requirements. Design and maintain the customer facing and corporate global data center technologies with a focus on Infrastructure-as-a-Service (IaaS). Design, implement, and maintain server, storage, network, and security infrastructure. Design, implement, and test disaster recovery and business continuity architecture. Create and implement automation for cloud platforms as well as monitoring and alerting purposes. Ensure all infrastructure components meet proper performance and capacity standards. Troubleshoot production issues and respond to after-hours escalations. Verify and resolve configuration and other non-software related issues. Skills and Experience include: Design and implement architectural roadmaps regarding the data center Infrastructure-as-a-Service (IaaS) architecture. Develop and implement internal systems, processes, and best practices to be used by other teams designed to increase productivity. Participate in deep architectural discussions to ensure solutions are designed for successful deployment, security, and high availability in the cloud. Recommend architecture to meet business requirements. Design and maintain the customer facing and corporate global data center technologies with a focus on Infrastructure-as-a-Service (IaaS). Design, implement, and maintain server, storage, network, and security infrastructure. Design, implement, and test disaster recovery and business continuity architecture. Create and implement automation for cloud platforms as well as monitoring and alerting purposes. Ensure all infrastructure components meet proper performance and capacity standards. Troubleshoot production issues and respond to after-hours escalations. Verify and resolve configuration and other non-software related issues",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "129.54",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "7.0",
        "required_certifications_or_licenses": "AWS",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "design,architecture,processes,network,develop",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 13321,
      "price_list_id": 1351
    },
    {
      "contract_number": "GS-35F-705GA",
      "labor_category": "Systems Engineer",
      "hourly_rate": 86.36,
      "source_sheet_name": "Price List",
      "source_row_number": 7,
      "raw_data": {
        "vendor_name": "ZION CLOUD SOLUTIONS LLC",
        "unique_catalog_item_id": "LCAT-005",
        "title": "Systems Engineer",
        "description": "Responsible for matching current technology with the current needs. As part of this task, engages in the evaluation and installation of software, hardware, and other types of support equipment into a workable Server that supports a variety of functions. This person has fundamental knowledge of Systems Engineering infrastructure. Includes individuals performing high-level systems support. Responsibilities include providing problem determination and resolution, install and update newly developed software to assigned systems. Responsible for the operating system and associated subsystems. Provide system-level support of multi-user operating systems, hardware and software tools, including installation, configuration, maintenance, and support of these systems. Identify alternatives for optimizing computer resources. Ability to investigate and analyze information and to draw conclusions. Collect information to analyze and evaluate existing or proposed systems. Research, plan, install, configure, troubleshoot, maintain and upgrade operating systems. Research, plan, install, configure, troubleshoot, maintain and upgrade hardware and software interfaces with the operating system. Work as a team member with other technical staff, such as networking to ensure connectivity and compatibility between systems. Write and maintain system documentation. Responsible for capacity planning, disaster recovery, and security, where necessary. Possess extensive experience with operating systems, network protocols, systems programming and configurations, and/or hubs, switches, and routers",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "86.36",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "7.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "software,hardware,support,investigate,analyzing",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 13321,
      "price_list_id": 1351
    },
    {
      "contract_number": "GS-35F-705GA",
      "labor_category": "Network Administrator",
      "hourly_rate": 64.64,
      "source_sheet_name": "Price List",
      "source_row_number": 8,
      "raw_data": {
        "vendor_name": "ZION CLOUD SOLUTIONS LLC",
        "unique_catalog_item_id": "LCAT-006",
        "title": "Network Administrator",
        "description": "Responsible for matching current technology with the current needs. As part of this task, engages in the evaluation and installation of software, hardware, and other types of support equipment into a workable network that supports a variety of functions. This person has fundamental knowledge of Systems Engineering infrastructure. Includes individuals performing high-level systems support. Responsibilities include providing problem determination and resolution, install and update newly developed software to assigned systems. Responsible for the operating system and associated subsystems. Provide system-level support of multi-user operating systems, hardware and software tools, including installation, configuration, maintenance, and support of these systems. Identify alternatives for optimizing computer resources. Ability to investigate and analyze information and to draw conclusions. Collect information to analyze and evaluate existing or proposed systems. Research, plan, install, configure, troubleshoot, maintain and upgrade operating systems. Research, plan, install, configure, troubleshoot, maintain and upgrade hardware and software interfaces with the operating system. Work as a team member with other technical staff, such as networking to ensure connectivity and compatibility between systems. Write and maintain system documentation. Responsible for capacity planning, disaster recovery, and security, where necessary. Possess extensive experience with operating systems, network protocols, systems programming and configurations, and/or hubs, switches, and routers. Preferred Certification: Holds U.S. Government security clearance.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "64.64",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "required_certifications_or_licenses": "Cisco",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "evaluation,installation support,software",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 13321,
      "price_list_id": 1351
    },
    {
      "contract_number": "GS-35F-705GA",
      "labor_category": "IT Project Manager",
      "hourly_rate": 86.36,
      "source_sheet_name": "Price List",
      "source_row_number": 9,
      "raw_data": {
        "vendor_name": "ZION CLOUD SOLUTIONS LLC",
        "unique_catalog_item_id": "LCAT-007",
        "title": "IT Project Manager",
        "description": "Responsible for end-to-end management and delivery of a material change for a project of high complexity across multiple departments across multiple business units. Manages, leads and directs the work efforts of resources that may be functionally aligned as part of the project and/or organizationally aligned as direct reports. Responsible for the end-to-end integration of various work streams in order to deliver the intended project solution. Responsibilities include: Manage Project Scope, Timeline and Budget/Expenses; obtain and align resources to key project roles; establish clearly defined responsibilities and accountabilities; oversight/Manage/Lead project execution, integration and implementation; Risk Management and Mitigation Planning; Readiness / Change Adoption/Stakeholder Management; Quality Assurance, ensure that all applicable change requirements are satisfied; Acts as the primary point of contact and integration for the project; Acts as a Program Manager if required on an interim basis; Ability to represent / deputise senior project stakeholders where required",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "86.36",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "7.0",
        "required_certifications_or_licenses": "PMP",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "management,directs,budget,integration,project",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 13321,
      "price_list_id": 1351
    },
    {
      "contract_number": "GS-35F-705GA",
      "labor_category": "IT Security Specialist",
      "hourly_rate": 129.54,
      "source_sheet_name": "Price List",
      "source_row_number": 10,
      "raw_data": {
        "vendor_name": "ZION CLOUD SOLUTIONS LLC",
        "unique_catalog_item_id": "LCAT-008",
        "title": "IT Security Specialist",
        "description": "Responsible for providing security expertise. Provides baseline security standards and policies for multiple projects of very high complexity or very high visibility. Will be identifying potential threats and risks and making recommendations to prevent these issues. In-depth information security expertise. Information Technology or risk management experience. Requires overall high-level understanding of security along with technical security background (including some architecture experience). Key individual contributor, with accountability for enabling secure environments (processes and technologies) for the business and technology groups. Utilizes technical and business knowledge to design and implement secure, risk-based solutions, exercising judgment within broadly defined practices and policies. Results oriented, business focused, and successful at interfacing across multiple organizational units, at various levels. Mastery with information security topics, including the design, development, implementation or governance of information security solutions. Knowledge to design and implement secure, risk-based solutions, exercising judgment within broadly defined practices and policies",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "129.54",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "required_certifications_or_licenses": "CISSP",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "technology,architecture,design,jugdement,security",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 13321,
      "price_list_id": 1351
    },
    {
      "contract_number": "GS-35F-705GA",
      "labor_category": "Sr. Application Architect",
      "hourly_rate": 156.71,
      "source_sheet_name": "Price List",
      "source_row_number": 11,
      "raw_data": {
        "vendor_name": "ZION CLOUD SOLUTIONS LLC",
        "unique_catalog_item_id": "LCAT-009",
        "title": "Sr. Application Architect",
        "description": "The senior application architect provides multi-disciplinary knowledge, skills, and experience in software architecture and design, distributed application architecture and design, and distributed architecture frameworks. They are responsible for technical aspects of end to end secure software and application delivery. They are experts in full stack software development using Object oriented programing languages.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "156.71",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "12.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "software,application architecture,design",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 13321,
      "price_list_id": 1351
    },
    {
      "contract_number": "GS-35F-705GA",
      "labor_category": "Systems Architect",
      "hourly_rate": 128.33,
      "source_sheet_name": "Price List",
      "source_row_number": 12,
      "raw_data": {
        "vendor_name": "ZION CLOUD SOLUTIONS LLC",
        "unique_catalog_item_id": "LCAT-010",
        "title": "Systems Architect",
        "description": "System Architects design, configure, operate and perform maintenance on networking and computer systems — including hardware, software, web portals, internet and intranet connections, firewalls, servers, and security — that allow company infrastructures to function. They consider the size, resources, data needs, desired user experience and budget of each company to determine its computing needs.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "128.33",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "12.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "system architect,networking,software,hardware",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 13321,
      "price_list_id": 1351
    },
    {
      "contract_number": "GS-35F-705GA",
      "labor_category": "Network Architect",
      "hourly_rate": 136.4,
      "source_sheet_name": "Price List",
      "source_row_number": 13,
      "raw_data": {
        "vendor_name": "ZION CLOUD SOLUTIONS LLC",
        "unique_catalog_item_id": "LCAT-011",
        "title": "Network Architect",
        "description": "Network architects design and implement complex computer networks for organizations in various industries. In support of the organization’s current and future needs, they collaborate closely with other IT professionals to optimize networks for performance, security, and scalability. Typically, network architects work in office settings, either as part of an in-house IT team or as consultants.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "136.4",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "18.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "network architect,scalability,security,performance",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 13321,
      "price_list_id": 1351
    },
    {
      "contract_number": "GS-35F-705GA",
      "labor_category": "Sr. IT Project Manager",
      "hourly_rate": 117.71,
      "source_sheet_name": "Price List",
      "source_row_number": 14,
      "raw_data": {
        "vendor_name": "ZION CLOUD SOLUTIONS LLC",
        "unique_catalog_item_id": "LCAT-012",
        "title": "Sr. IT Project Manager",
        "description": "Senior IT project manager provides technical configuration and support to clients on a variety of software development projects, programs, IT Transformation and support programs. They are well versed in Project Management fundamentals, Agile ways of working as well as SCRUM and Kanban. They are able to lead technical projects and manage financial adherence and controls.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "117.71",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "15.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "configuration,SCRUM,Kanban,project management",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 13321,
      "price_list_id": 1351
    },
    {
      "contract_number": "GS-35F-705GA",
      "labor_category": "Sr. IT Business Analyst",
      "hourly_rate": 94.82,
      "source_sheet_name": "Price List",
      "source_row_number": 15,
      "raw_data": {
        "vendor_name": "ZION CLOUD SOLUTIONS LLC",
        "unique_catalog_item_id": "LCAT-013",
        "title": "Sr. IT Business Analyst",
        "description": "A senior IT business analyst is a business professional who assesses an organisation's processes and operations and determines opportunities to increase efficiency. They assist in IT system analysis, integration testing and recording the technical requirements, system design plans, security as well as operational plans for the IT System.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "94.82",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "IT system analysis,testing,design",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 13321,
      "price_list_id": 1351
    },
    {
      "contract_number": "GS-35F-705GA",
      "labor_category": "DevOps Architect",
      "hourly_rate": 146.04,
      "source_sheet_name": "Price List",
      "source_row_number": 16,
      "raw_data": {
        "vendor_name": "ZION CLOUD SOLUTIONS LLC",
        "unique_catalog_item_id": "LCAT-014",
        "title": "DevOps Architect",
        "description": "A DevOps architect leads the design and implementation of enterprise applications. DevOps architects are responsible for building platforms and frameworks to create consistent, verifiable, and automatic management of applications and infrastructure between non-production and production environments.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "146.04",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "DevOps architect,design,implementation,applications",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 13321,
      "price_list_id": 1351
    },
    {
      "contract_number": "GS-35F-705GA",
      "labor_category": "SR Web Developer",
      "hourly_rate": 106.21,
      "source_sheet_name": "Price List",
      "source_row_number": 17,
      "raw_data": {
        "vendor_name": "ZION CLOUD SOLUTIONS LLC",
        "unique_catalog_item_id": "LCAT-015",
        "title": "SR Web Developer",
        "description": "The senior web developer's responsibilities include identifying software delivery requirements, full stack code developoment, writing front end and back end code using secure software development practices, implementing Test Automation using Selenium and other 3rd party tools, designing a software devliery pipeline and communicating with clients to determine application specifications, creating schedules. Other responsibilities include writing code, working with a team of designers, security and infrastucture, as well as assisting with recruitment and training of all new junior web developers.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "106.21",
        "minimum_education": "Associates",
        "minimum_years_of_education": "10.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "web developer,specifications,code,Selenium",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Associates",
      "security_clearance": "No",
      "contractor_id": 13321,
      "price_list_id": 1351
    }
  ],
  "parsed_at": "2025-11-06T11:55:56.537213"
}