{
  "contract_number": "GS-35F-0365X",
  "contractor_id": 6884,
  "price_list_id": 1449,
  "labor_categories": [
    {
      "contract_number": "GS-35F-0365X",
      "labor_category": "Managing Principal",
      "hourly_rate": 224.89,
      "source_sheet_name": "Price List",
      "source_row_number": 3,
      "raw_data": {
        "vendor_name": "INTUEOR CONSULTING, INC.",
        "unique_catalog_item_id": "INTUEOR_001",
        "title": "Managing Principal",
        "description": "A Managing Principal requires a minimum of 20 years of consulting and/or directly relevant industry experience. Experience includes: executive level management and direction on client engagements, working experience in project definition and business and systems analysis, creation of competitive strategies, and integration of global business solutions. A Managing Principal works with the Project Director and other senior client staff to monitor quality and risk and identify potential issues and overall project problem areas and designs a strategy for addressing them. A Managing Principal is proficient in reviewing strategic plans and business strategies and design, organizational and infrastructure designs, and project deliverables to maintain a standard of consistency and quality throughout a project’s life cycle.\nA Managing Principal provides strong executive level management and direction. A Managing Principal not only brings a thorough understanding of the client’s industry, but also has an extensive tool set of skills to solve the client’s problems. A Managing Principal knows the client’s industry, and helps the client visualize where they need to be in their particular industry. This position includes being a leader in strategic, business, and action planning. A Managing Principal serves in an advisory capacity, providing members of the project team and the client organization a level of quality review to help guide the project to remain on schedule and within budget. A Managing Principal provides management and technical review, industry insight, issue resolution. This position is also responsible for ensuring quality assurance through the use of Quality Assurance and Risk Assessment Program deployed on all large engagements.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "224.89",
        "minimum_education": "Masters",
        "minimum_years_of_education": "20.0",
        "required_certifications_or_licenses": "none",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Masters",
      "security_clearance": "No",
      "contractor_id": 6884,
      "price_list_id": 1449
    },
    {
      "contract_number": "GS-35F-0365X",
      "labor_category": "Senior Principal Consultant",
      "hourly_rate": 184.99,
      "source_sheet_name": "Price List",
      "source_row_number": 4,
      "raw_data": {
        "vendor_name": "INTUEOR CONSULTING, INC.",
        "unique_catalog_item_id": "INTUEOR_002",
        "title": "Senior Principal Consultant",
        "description": "A Senior Principal Consultant requires a minimum of twenty years of consulting and/or directly relevant industry experience. Experience includes: executive level management and direction on client engagements, working experience in project definition and business and systems analysis, creation of competitive strategies, and integration of global business solutions. A Senior Principal Consultant works with the Project Director and other senior client staff to monitor quality and risk and identify potential issues and overall project problem areas and designs a strategy for addressing them. A Senior Principal Consultant is proficient in reviewing strategic plans and business strategies and design, organizational and infrastructure designs, and project deliverables to maintain a standard of consistency and quality throughout a project’s life cycle.\nA Senior Principal Consultant provides strong executive level management and direction. A Senior Principal Consultant not only brings a thorough understanding of the client’s industry, but also has an extensive tool set of skills to solve the client’s problems. A Senior Principal Consultant knows the client’s industry, and helps the client visualize where they need to be in their particular industry. This position includes being a leader in strategic, business, and action planning. A Senior Principal Consultant serves in an advisory capacity, providing members of the project team and the client organization a level of quality review to help guide the project to remain on schedule and within budget. A Senior Principal Consultant provides management and technical review, industry insight, issue resolution. This position is also responsible for ensuring quality assurance through the use of Quality Assurance and Risk Assessment Program deployed on all large engagements.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "184.99",
        "minimum_education": "Masters",
        "minimum_years_of_education": "20.0",
        "required_certifications_or_licenses": "none",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Masters",
      "security_clearance": "No",
      "contractor_id": 6884,
      "price_list_id": 1449
    },
    {
      "contract_number": "GS-35F-0365X",
      "labor_category": "Principal Consultant",
      "hourly_rate": 170.0,
      "source_sheet_name": "Price List",
      "source_row_number": 5,
      "raw_data": {
        "vendor_name": "INTUEOR CONSULTING, INC.",
        "unique_catalog_item_id": "INTUEOR_003",
        "title": "Principal Consultant",
        "description": "A Principal Consultant is a senior level position that requires a minimum of 18 years of consulting and/or directly relevant industry experience. Experience includes: executive level management and direction on client engagements, defining engagement strategy, objectives, and scope, including defining engagement deliverables, working experience in project definition and process and systems analysis, creation of competitive strategies, and integration of global solutions. A Principal Consultant is proficient in project estimation and resource planning efforts and in resolving global project issues, such as process and technical compatibility, client expectations, and timing. A Principal Consultant fosters overall soundness of analytical approach, and is able to suggest alternatives. A Principal Consultant manages project resources; champions firm initiatives, and leads developments in new business enterprises through innovation. Other experience includes coordinating multiple projects and team, and assisting clients in achieving desired program results.\nA Principal Consultant provides strong executive level management and direction. A Principal Consultant has served in this position for several years and has extensive industry knowledge and presence. A Principal Consultant not only brings a thorough understanding of the client’s industry, but also has an extensive tool set of skills to solve the client’s problems. This position includes being a leader in strategic, business, and action planning, maintains responsibility for formulating work standards, creating strategic project objectives, and managing client issues and feedback. In addition, the Principal Consultant directs client communications and is a senior communication person with client leaders and executives along with the Senior Principal Consultant and/or Program Manager.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "170.0",
        "minimum_education": "Masters",
        "minimum_years_of_education": "18.0",
        "required_certifications_or_licenses": "none",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Masters",
      "security_clearance": "No",
      "contractor_id": 6884,
      "price_list_id": 1449
    },
    {
      "contract_number": "GS-35F-0365X",
      "labor_category": "Senior Consultant",
      "hourly_rate": 160.0,
      "source_sheet_name": "Price List",
      "source_row_number": 6,
      "raw_data": {
        "vendor_name": "INTUEOR CONSULTING, INC.",
        "unique_catalog_item_id": "INTUEOR_004",
        "title": "Senior Consultant",
        "description": "A Senior Consultant requires a minimum of 15 years of consulting and/or directly relevant industry experience. Experience includes: Experience includes: executive level management and direction on client engagements, defining engagement strategy, objectives, and scope, including defining engagement deliverables, working experience in project definition and process and systems analysis, creation of competitive strategies, and integration of global solutions. A Senior Consultant is proficient in project estimation and resource planning efforts and in resolving global project issues, such as process and technical compatibility, client expectations, and timing. A Senior Consultant fosters overall soundness of analytical approach, and is able to suggest alternatives. A Senior Consultant manages project resources; champions firm initiatives, and leads developments in new business enterprises through innovation. Other experience includes coordinating multiple projects and team, and assisting clients in achieving desired program results.\nA Senior Consultant provides strong executive level management and direction. A Senior Consultant possesses a deep understanding of the client’s industry, and also has an extensive tool set of skills to solve the client’s problems. This position includes being a leader in strategic, business, and action planning, maintains responsibility for formulating work standards, creating strategic project objectives, and managing client issues and feedback.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "160.0",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "15.0",
        "required_certifications_or_licenses": "none",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 6884,
      "price_list_id": 1449
    },
    {
      "contract_number": "GS-35F-0365X",
      "labor_category": "Consultant",
      "hourly_rate": 148.01,
      "source_sheet_name": "Price List",
      "source_row_number": 7,
      "raw_data": {
        "vendor_name": "INTUEOR CONSULTING, INC.",
        "unique_catalog_item_id": "INTUEOR_005",
        "title": "Consultant",
        "description": "A  Consultant requires a minimum of 12 years of consulting and/or directly relevant industry experience includes: engagement experience in project scope and approach, focus on project delivery and business and technical integration, ability to drive business strategy and planning changes at the executive levels, oversight of key business and process enablers, and management of project resources. A Consultant maintains responsibility for managing the project team and daily operations of project development and fostering client comfort and feasibility with the project objectives and goals. Other experience includes communication with client and project managers and management of multiple projects across various industry lines.\nA Consultant provides strong senior-level management and has served in this position for several years. A Consultant has responsibility for overall project activities and is the primary point of contact with client executives. This position assumes responsibility for project delivery and oversight of key business enablers on projects and identification of needs for new tools. A Consultant assumes regular interaction and communications with the Contracting Officer (CO) and delegated government representatives. Maintains responsibility for managing business solutions, delegating appropriate resources, and fostering quality assurance principles across projects and deliverables and using problem solving techniques to resolve issues. A Consultant is also involved in process and productivity improvement, as well as, systems alignment. Organizational assessments, and program audits, and evaluations are also performed by this position.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "148.01",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "12.0",
        "required_certifications_or_licenses": "none",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 6884,
      "price_list_id": 1449
    },
    {
      "contract_number": "GS-35F-0365X",
      "labor_category": "Staff Consultant",
      "hourly_rate": 100.0,
      "source_sheet_name": "Price List",
      "source_row_number": 8,
      "raw_data": {
        "vendor_name": "INTUEOR CONSULTING, INC.",
        "unique_catalog_item_id": "INTUEOR_006",
        "title": "Staff Consultant",
        "description": "A Staff Consultant requires a minimum of seven years of consulting and/or directly relevant industry experience includes: engagement experience in project scope and approach, focus on project delivery and business and technical integration, ability to drive business strategy and planning changes at the executive levels, oversight of key business and process enablers, and management of project resources. A Staff Consultant maintains responsibility for managing the project team and daily operations of project development and fostering client comfort and feasibility with the project objectives and goals. Other experience includes communication with client and project managers and management of multiple projects across various industry lines.\nA Staff Consultant provides strong senior-level management and direction. A Staff Consultant helps and supports our client’s strategy, and provides business and action planning. A Staff Consultant is also involved in process and productivity improvement, as well as, systems alignment. Assumes responsibility for overall project delivery and oversight of key technical enablers on projects and identification of needs for new tools. A Staff Consultant assumes regular interaction and communications with the Contracting Officer (CO) and delegated government representatives. This position maintains responsibility for managing technical solutions, delegating appropriate resources, and fostering quality assurance principles across projects and deliverables. Specifically, A Staff Consultant will lead organizational assessments, and program audits, and evaluations are also performed by this position.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "100.0",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "7.0",
        "required_certifications_or_licenses": "none",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 6884,
      "price_list_id": 1449
    },
    {
      "contract_number": "GS-35F-0365X",
      "labor_category": "Junior Consultant / Associate",
      "hourly_rate": 75.0,
      "source_sheet_name": "Price List",
      "source_row_number": 9,
      "raw_data": {
        "vendor_name": "INTUEOR CONSULTING, INC.",
        "unique_catalog_item_id": "INTUEOR_007",
        "title": "Junior Consultant / Associate",
        "description": "A Junior Consultant/Associate has up to five years of consulting and/or directly relevant industry experience. Experience includes: senior-level management and direction on client engagements, extensive experience in all aspects of leading a project, understanding business needs, formulating project definitions, isolating success factors, and aligning firm objectives with client needs. A Junior Consultant/Associate maintains day-to-day interaction with the client, fostering successful program management through performance reviews, assessment and analysis, design and development of solutions, monitoring budget allotments, issues resolution, and implementation. Other experience includes management of local resources, administration of project work plans and processes, and core capabilities in information systems design and technical solutions.\nA Junior Consultant/Associate provides strong management and direction, focused on high-performance work. They are responsible for developing engagement work plans and selecting, modifying, and applying the appropriate consulting tools for each engagement. A Junior Consultant/Associate often assumes the role of project team lead, directing and monitoring the work of other project staff. They are responsible for ensuring the effective use of consulting tools and resources. They analyze work plan completeness, prepare status reports, and support quality control practices. They also assess client needs, evaluate alternative approaches, and provide actionable recommendations. Communicates client expectations to the project team and escalates issues to senior staff when necessary. Maintains technical knowledge within the industry and service line.\nAdditionally, a Junior Consultant/Associate helps identify key client challenges and works to develop creative solutions. This position may also perform organizational assessments, program audits, evaluations, system alignment, and process and productivity improvement.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "75.0",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "required_certifications_or_licenses": "none",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 6884,
      "price_list_id": 1449
    },
    {
      "contract_number": "GS-35F-0365X",
      "labor_category": "Business Analyst",
      "hourly_rate": 127.5,
      "source_sheet_name": "Price List",
      "source_row_number": 10,
      "raw_data": {
        "vendor_name": "INTUEOR CONSULTING, INC.",
        "unique_catalog_item_id": "INTUEOR_008",
        "title": "Business Analyst",
        "description": "A Business Analyst is a consultant that has a minimum of ten years of consulting and/or directly relevant industry experience and/or educational training in related fields. Experience includes: support program management and familiarity with client issues, assistance with design issues, leading client teams, analysis of project data, and development of appropriate deliverables. A Business Analyst is proficient in the use of firm tools and enablers to better support the overall objectives and goals of the program objectives. A Business Analyst demonstrates these skills by performing status reports, verifying work plan completeness, and communicating with team members. Other experience includes development of leadership/management skills, performing benchmark analyses, building organizational design models, and defining business and technical needs.\nA Business Analyst provides senior-level analytical and program support, and is focused on providing high performance work. A Business Analyst contributes to engagement work plan development and often leads assigned engagement tasks to completion within scope and budget. Serves as a senior level analytical correspondent within engagement team. Assumes responsibility for contributing to work plan development, reaching engagement milestones, and often leading specific project tasks. Applies business modeling, process modeling, and business design techniques. Conducts analysis of appropriate consulting tools to satisfy program requirements, and creates project deliverables. Formulates diagnoses through financial or statistical modeling, assesses appropriate alternatives, and offers conclusions to Project Manager. This position performs analyses and makes diagnoses, as well as defines symptoms and problems, and develops conclusions. A Business Analyst also participates in organizational assessments, and leads performance measures and indicators analysis.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "127.5",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "required_certifications_or_licenses": "none",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 6884,
      "price_list_id": 1449
    },
    {
      "contract_number": "GS-35F-0365X",
      "labor_category": "Project Manager",
      "hourly_rate": 160.0,
      "source_sheet_name": "Price List",
      "source_row_number": 11,
      "raw_data": {
        "vendor_name": "INTUEOR CONSULTING, INC.",
        "unique_catalog_item_id": "INTUEOR_009",
        "title": "Project Manager",
        "description": "Minimum of fifteen years experience is required. Experience required includes; complete project development from inception to deployment and ability to provide guidance and direction in multiple tasks. Proven expertise in the management and control of funds and resources and a demonstrated capability in managing complex multi-task contracts.\nResponsible for the effective management of funds and personnel, and is accountable for the quality and timely delivery of contractual items.  Operates within client guidance, contractual limitations, and Company business and policy directives. Serves as focal point of contact with Contracting Officer (CO) on program activities.  Ensures that all required resources including manpower, production standards, and facilities are available for program implementation. Participates in contract negotiations.  Performs day-to-day management of overall contract support operations, possibly involving multiple projects and groups of personnel at multiple locations.  Organizes, directs, and coordinates the planning and production of all contract support activities.  Demonstrates written and oral communication skills. Establishes and alters (as necessary) corporate management structure to direct effective contract support activities",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "160.0",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "15.0",
        "required_certifications_or_licenses": "none",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 6884,
      "price_list_id": 1449
    },
    {
      "contract_number": "GS-35F-0365X",
      "labor_category": "Deputy Project Manager",
      "hourly_rate": 159.99,
      "source_sheet_name": "Price List",
      "source_row_number": 12,
      "raw_data": {
        "vendor_name": "INTUEOR CONSULTING, INC.",
        "unique_catalog_item_id": "INTUEOR_010",
        "title": "Deputy Project Manager",
        "description": "Minimum of twelve years experience is required. Demonstrated capability in managing multi-task contracts. Experience required includes; complete project development from inception to deployment and ability to provide guidance and direction in multiple tasks.  Proven expertise in the management and control of funds and resources. Shall assist the Program Manager in working with the Government Contracting Officer (CO)\nLeads the project or multiple tasks and retains overall responsibility for performance including cost, schedule, deliverables and contractual compliance. May work under a Program Manager for multiple projects. Identifies, acquires, and utilizes company resources to achieve project.  Performs day-to-day management of assigned delivery order projects that involve multiple teams and management professionals who are involved in analyzing, designing, integrating, testing, documenting, converting, extending, and implementation.  Demonstrates proven skills in the technical areas addressed by the delivery order to be managed. Organizes, directs, and coordinates the planning and production of all activities associated with assigned delivery order projects. Demonstrates writing and oral communication skills",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "159.99",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "12.0",
        "required_certifications_or_licenses": "none",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 6884,
      "price_list_id": 1449
    },
    {
      "contract_number": "GS-35F-0365X",
      "labor_category": "Functional Manager",
      "hourly_rate": 140.0,
      "source_sheet_name": "Price List",
      "source_row_number": 13,
      "raw_data": {
        "vendor_name": "INTUEOR CONSULTING, INC.",
        "unique_catalog_item_id": "INTUEOR_011",
        "title": "Functional Manager",
        "description": "Minimum of fifteen years experience in their field of study.  Requires the highest level of technical knowledge, understanding and experience.  Analyzes complex problems and develops doctrine and documentation to apply unique solutions.  Is a recognized expert in their field of expertise.  \nProvides technical, managerial, and administrative direction for problem definition, analysis, requirements development, and implementation for complex to extremely complex systems in the subject matter area. Makes recommendations and advises on organization-wide system improvements, optimization or maintenance efforts.  Communicates with executive and senior leadership levels.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "140.0",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "15.0",
        "required_certifications_or_licenses": "none",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 6884,
      "price_list_id": 1449
    },
    {
      "contract_number": "GS-35F-0365X",
      "labor_category": "QA Manager",
      "hourly_rate": 159.99,
      "source_sheet_name": "Price List",
      "source_row_number": 14,
      "raw_data": {
        "vendor_name": "INTUEOR CONSULTING, INC.",
        "unique_catalog_item_id": "INTUEOR_012",
        "title": "QA Manager",
        "description": "Minimum of fifteen years experience in their field of study.  Requires the highest level of technical knowledge, understanding and experience.  At least five years of experience in quality control and quality assurance of technology systems, verification and validation, software/hardware testing and integration, and software metrics and their application to software quality assessment.  \nMust be capable of maintaining and establishing a process for evaluating software and associated documentation.  Must be able to determine the resources required for quality control.  Must be able to maintain the level of quality throughout the software life cycle.  Develops software quality assurance plans.  Conducts formal and informal reviews at predetermined points throughout the development life cycle",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "159.99",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "15.0",
        "required_certifications_or_licenses": "none",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 6884,
      "price_list_id": 1449
    },
    {
      "contract_number": "GS-35F-0365X",
      "labor_category": "Contract Administrator",
      "hourly_rate": 125.0,
      "source_sheet_name": "Price List",
      "source_row_number": 15,
      "raw_data": {
        "vendor_name": "INTUEOR CONSULTING, INC.",
        "unique_catalog_item_id": "INTUEOR_013",
        "title": "Contract Administrator",
        "description": "A Contract Administrator is an experienced Project Controller with at a minimum ten years of project experience. This position requires a completed undergraduate degree in Business Administration, MIS, Finance, Accounting, or related discipline. Experience includes: knowledge of core work-products, project planning, and project budgeting required for large engagements. Proficiency in project and financial support tools required to manage a large technology project from beginning to end.\nThis position is responsible for assisting the project director in setting up, monitoring, and delivering the project. Services include establishing project accounting and billing systems, developing project documentation, tracking team progress, managing major milestones, and establishing project standards. This position manages the project budget and all financials, tracks consulting time and expenses, prepares all client billings, monitors profitability, and reconciles project budgets.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "125.0",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "required_certifications_or_licenses": "none",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 6884,
      "price_list_id": 1449
    }
  ],
  "parsed_at": "2025-11-06T11:51:04.076302"
}