{
  "contract_number": "GS-35F-252DA",
  "contractor_id": 785,
  "price_list_id": 123,
  "labor_categories": [
    {
      "contract_number": "GS-35F-252DA",
      "labor_category": "Operations SME Jr",
      "hourly_rate": 60.1744,
      "source_sheet_name": "Price List",
      "source_row_number": 3,
      "raw_data": {
        "vendor_name": "ADNET SYSTEMS INC",
        "unique_catalog_item_id": "Adnet-001",
        "title": "Operations SME Jr",
        "description": "Junior SME will provide monitoring and Management of NASA key infrastructure devices for Exchange, file/print, storage and other devices that will be managed by centralized operations team. Has the ability to support effort to conceptualizes, designs, constructs, tests, implements and optimizes basic infrastructure systems that enable and support business and/or engineering/manufacturing functions.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "60.1744",
        "gsa_price_with_iff__a_": "61.2575",
        "gsa_price_with_iff__b_": "62.3602",
        "gsa_price_with_iff__c_": "63.4827",
        "gsa_price_with_iff__d_": "64.6253",
        "gsa_price_with_iff__e_": "65.7886",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "2.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "conceptualizes,designs,constructs,infrastructure,systems",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 785,
      "price_list_id": 123
    },
    {
      "contract_number": "GS-35F-252DA",
      "labor_category": "Enterprise Content Manager - Sr.",
      "hourly_rate": 87.0665,
      "source_sheet_name": "Price List",
      "source_row_number": 4,
      "raw_data": {
        "vendor_name": "ADNET SYSTEMS INC",
        "unique_catalog_item_id": "Adnet-002",
        "title": "Enterprise Content Manager - Sr.",
        "description": "Provides expert judgment and analysis for the design, development and implementation of technical products and systems. Resolves highly complex technical issues and conducts advanced research. Recommends alterations to development and design to improve quality of products and/or procedures. Requires a bachelor's degree in engineering and experience in the field or in a related area. Familiar with a variety of the field's concepts, practices, and procedures. Relies on extensive experience and judgment to plan and accomplish goals. Performs a variety of tasks. Leads and directs the work of others. A wide degree of creativity and latitude is expected. May report to an executive or a manager. Reviews, analyzes, and modifies programming systems including encoding, testing, debugging and documenting programs.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "87.0665",
        "gsa_price_with_iff__a_": "88.6337",
        "gsa_price_with_iff__b_": "90.2291",
        "gsa_price_with_iff__c_": "91.8533",
        "gsa_price_with_iff__d_": "93.5066",
        "gsa_price_with_iff__e_": "95.1897",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "design,development,implementation,technical,systems",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 785,
      "price_list_id": 123
    },
    {
      "contract_number": "GS-35F-252DA",
      "labor_category": "Application Developer - Sr.",
      "hourly_rate": 83.8339,
      "source_sheet_name": "Price List",
      "source_row_number": 5,
      "raw_data": {
        "vendor_name": "ADNET SYSTEMS INC",
        "unique_catalog_item_id": "Adnet-003",
        "title": "Application Developer - Sr.",
        "description": "Creates, tests, and keeps current computer programs that provide instructions that computers must follow to perform their function. Creates, designs, and tests logical structure for solving problems by computers. Writes programs according to specifications, which may be provided by Software Engineers, Systems Analysts, or other computer scientists. Updates repairs, modifies, and expands existing computer programs. Analyzes workflow chart and diagram, applying knowledge of computer capabilities, subject matter, and symbolic logic. Confers with supervisor and representatives of departments concerned with program to resolve questions of program intent, data input, output requirements, and inclusion of internal checks and controls. Reads manuals, periodicals, and technical reports to learn ways to develop programs that meet user requirements. Formulates plan outlining steps required to develop program, using structured analysis and design. Submits plans to user for approval. Designs computer terminal screen displays to accomplish goals of user request. Converts project specifications, using flowcharts and diagrams, into sequence of detailed instructions and logical steps; codes language that can be processed by computer, applying knowledge of computer programming techniques and computer languages. Enters program codes into computer system. Inputs test data into computer. Observes computer monitor screen to interpret program operating codes. Reads computer printouts or observes display screen to detect syntax or logic errors during program test, or uses diagnostic software to detect errors. Corrects program errors using methods such as modifying program or altering sequence of program steps. Recreates steps taken by user to locate source of problem and rewrites program to correct errors. Analyzes, reviews, and rewrites programs to increase operating efficiency or to adapt program to new requirements. Compiles and writes documentation of program development and subsequent revisions.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "83.8339",
        "gsa_price_with_iff__a_": "85.3429",
        "gsa_price_with_iff__b_": "86.8791",
        "gsa_price_with_iff__c_": "88.4429",
        "gsa_price_with_iff__d_": "90.0349",
        "gsa_price_with_iff__e_": "91.6555",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "creates,tests,current,computer,programs",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 785,
      "price_list_id": 123
    },
    {
      "contract_number": "GS-35F-252DA",
      "labor_category": "Enterprise Architect / ITIL - Sr.",
      "hourly_rate": 146.2636,
      "source_sheet_name": "Price List",
      "source_row_number": 6,
      "raw_data": {
        "vendor_name": "ADNET SYSTEMS INC",
        "unique_catalog_item_id": "Adnet-004",
        "title": "Enterprise Architect / ITIL - Sr.",
        "description": "Responsible for designing and implementing information systems which will adequately support the enterprise infrastructure of the organization. Analyzes system requirements and ensures that systems will offer security and will be effectively integrated with current applications. Ensures that all systems are working at optimal levels and offers support to application development department regarding new technologies and system requirements. Has thorough knowledge of infrastructure, application programming, and web and software applications. Requires a bachelor's degree in area of specialty and 6-8 years of experience in the field or in a related area. Familiar with a variety of the field's concepts, practices, and procedures. Relies on extensive experience and judgment to plan and accomplish goals. Performs a variety of tasks. Leads and directs the work of others. A wide degree of creativity and latitude is expected. Typically reports to top management. Defines and implements IT quality assurance practices and procedures. Manages a group of quality assurance analysts who test, evaluate, and validate IT initiatives and identify issues in software or services. Analyzes discrepancies in service or performance and makes recommendations for product or service updates. Requires a bachelor's degree with at least 7 years of experience in the field. Familiar with a variety of the field's concepts, practices, and procedures. Relies on extensive experience and judgment to plan and accomplish goals. Helps develop strategic direction and implement tactics to meet goals. Performs a variety of tasks. Leads and directs the work of others. A wide degree of creativity and latitude is expected. Typically reports to head of a unit/department.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "146.2636",
        "gsa_price_with_iff__a_": "148.8964",
        "gsa_price_with_iff__b_": "151.5765",
        "gsa_price_with_iff__c_": "154.3049",
        "gsa_price_with_iff__d_": "157.0824",
        "gsa_price_with_iff__e_": "159.9099",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "15.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "designing,implementing,information,enterprise,infrastructure",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 785,
      "price_list_id": 123
    },
    {
      "contract_number": "GS-35F-252DA",
      "labor_category": "Help Desk - Sr. (Lead)",
      "hourly_rate": 61.6672,
      "source_sheet_name": "Price List",
      "source_row_number": 7,
      "raw_data": {
        "vendor_name": "ADNET SYSTEMS INC",
        "unique_catalog_item_id": "Adnet-005",
        "title": "Help Desk - Sr. (Lead)",
        "description": "Supervises the day-to-day operations of the help desk. Identifies, researches, and resolves complex technical problems. Creates and manages escalation procedures and ensures service levels are maintained. Documents, tracks, and monitors problems to ensure resolution in a timely manner. A level II supervisor has authority for personnel actions and oversees most day-to-day operations of a group. May require a bachelor's degree in area of specialty for the lead position. Familiar with a variety of the field's concepts, practices, and procedures. Relies on extensive experience and judgment to plan and accomplish goals. Performs a variety of tasks. A wide degree of creativity and latitude is expected. Typically reports to a manager or head of a unit/department. Provides support to customers on a variety of issues. Identifies, researches, and resolves technical problems. Responds to telephone calls, email and personnel requests for technical support. Documents, tracks and monitors the problem to ensure a timely resolution. May require an associate's degree in a related area and experience in the field or in a related area for a Mid to Junior position. Has knowledge of commonly-used concepts, practices, and procedures within a particular field. Relies on instructions and pre-established guidelines to perform the functions of the job. Works under immediate supervision. Primary job functions do not typically require exercising independent judgment. Typically reports to a supervisor or manager.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "61.6672",
        "gsa_price_with_iff__a_": "62.7772",
        "gsa_price_with_iff__b_": "63.9072",
        "gsa_price_with_iff__c_": "65.0575",
        "gsa_price_with_iff__d_": "66.2286",
        "gsa_price_with_iff__e_": "67.4207",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "supervises,operations,resolves,complex,technical",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 785,
      "price_list_id": 123
    },
    {
      "contract_number": "GS-35F-252DA",
      "labor_category": "Operations / Project Manager - Sr",
      "hourly_rate": 118.9097,
      "source_sheet_name": "Price List",
      "source_row_number": 8,
      "raw_data": {
        "vendor_name": "ADNET SYSTEMS INC",
        "unique_catalog_item_id": "Adnet-006",
        "title": "Operations / Project Manager - Sr",
        "description": "Supervises employees of the information technology department in accordance with organizational policies and goals. Ensures proper functioning of the organization's information systems and makes upgrades as necessary. Helps business operations groups utilize information systems to improve their efficiency. Keeps computer equipment, hardware, and software updated to meet organizational needs. Follows appropriate programming procedures. Has authority for personnel actions and oversees most day-to-day operations of a performance group. May require a bachelor's degree in area of specialty. Familiar with a variety of the field's concepts, practices, and procedures. Relies on extensive experience and judgment to plan and accomplish goals. Performs a variety of tasks. A wide degree of creativity and latitude is expected. Typically reports to a manager or head of a unit/department.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "118.9097",
        "gsa_price_with_iff__a_": "121.05",
        "gsa_price_with_iff__b_": "123.2289",
        "gsa_price_with_iff__c_": "125.4471",
        "gsa_price_with_iff__d_": "127.7051",
        "gsa_price_with_iff__e_": "130.0038",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "information,technology,organizational,policies,goals",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 785,
      "price_list_id": 123
    },
    {
      "contract_number": "GS-35F-252DA",
      "labor_category": "Systems Administrator - Sr.",
      "hourly_rate": 81.4604,
      "source_sheet_name": "Price List",
      "source_row_number": 9,
      "raw_data": {
        "vendor_name": "ADNET SYSTEMS INC",
        "unique_catalog_item_id": "Adnet-007",
        "title": "Systems Administrator - Sr.",
        "description": "Sets up, configures, and supports internal and/or external networks. Develops and maintains all systems, applications, security, and network configurations. Troubleshoots network performance issues and creates and maintains a disaster recovery plan. Recommends upgrades, patches, and new applications and equipment. Provides technical support and guidance to users. May require a bachelor's degree in area of specialty and 2-5 years of experience in the field or in a related area. Familiar with a variety of the field's concepts, practices, and procedures. Relies on extensive experience and judgment to plan and accomplish goals. Performs a variety of tasks. May provide consultation on complex projects and is considered to be the top level contributor/specialist. Typically reports to a manager or head of a unit/department.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "81.4604",
        "gsa_price_with_iff__a_": "82.9267",
        "gsa_price_with_iff__b_": "84.4194",
        "gsa_price_with_iff__c_": "85.9389",
        "gsa_price_with_iff__d_": "87.4858",
        "gsa_price_with_iff__e_": "89.0606",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "configures,supports,internal,external,networks",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 785,
      "price_list_id": 123
    },
    {
      "contract_number": "GS-35F-252DA",
      "labor_category": "Security Specialist - Mid",
      "hourly_rate": 48.597,
      "source_sheet_name": "Price List",
      "source_row_number": 10,
      "raw_data": {
        "vendor_name": "ADNET SYSTEMS INC",
        "unique_catalog_item_id": "Adnet-008",
        "title": "Security Specialist - Mid",
        "description": "Troubleshoots network access problems and implements network security policies and procedures. Ensures network (LAN/WAN, telecommunications, and voice) security access and protects against unauthorized access, modification, or destruction. Requires a bachelor's degree and experience in the field. Familiar with a variety of the field's concepts, practices, and procedures. Relies on extensive experience and judgment to plan and accomplish goals. Performs a variety of tasks. May lead and direct the work of others. A wide degree of creativity and latitude is expected. Typically reports to a supervisor or manager.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "48.597",
        "gsa_price_with_iff__a_": "49.4718",
        "gsa_price_with_iff__b_": "50.3623",
        "gsa_price_with_iff__c_": "51.2688",
        "gsa_price_with_iff__d_": "52.1916",
        "gsa_price_with_iff__e_": "53.1311",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "troubleshoots,network,access,policies,security",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 785,
      "price_list_id": 123
    },
    {
      "contract_number": "GS-35F-252DA",
      "labor_category": "Systems Engineer III",
      "hourly_rate": 51.3249,
      "source_sheet_name": "Price List",
      "source_row_number": 11,
      "raw_data": {
        "vendor_name": "ADNET SYSTEMS INC",
        "unique_catalog_item_id": "Adnet-009",
        "title": "Systems Engineer III",
        "description": "Performs complex engineering tasks involving design, development, and modification of computer systems or subsystems. Conducts studies to determine system requirements. Conducts feasibility studies to ascertain reliability of system designs. Participates in systems analysis and design definition. Applies knowledge of hardware and software for throughput analysis and trade-off studies. Performs system modeling and analysis studies of system reliability and availability. Studies and analyzes existing systems relative to current technology and operational problems. Develops and recommends plans for use in evaluating systems, subsystems, and system requirements. Prepares technical reports concerning status and progress of assigned activities.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "51.3249",
        "gsa_price_with_iff__a_": "52.2488",
        "gsa_price_with_iff__b_": "53.1892",
        "gsa_price_with_iff__c_": "54.1466",
        "gsa_price_with_iff__d_": "55.1213",
        "gsa_price_with_iff__e_": "56.1135",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "design,development,modification,computer,systems",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 785,
      "price_list_id": 123
    },
    {
      "contract_number": "GS-35F-252DA",
      "labor_category": "Solution Architect Senior Leader",
      "hourly_rate": 109.5447,
      "source_sheet_name": "Price List",
      "source_row_number": 12,
      "raw_data": {
        "vendor_name": "ADNET SYSTEMS INC",
        "unique_catalog_item_id": "Adnet-010",
        "title": "Solution Architect Senior Leader",
        "description": "Provides technical leadership on formulating highly complex technical solutions and approaches to include installation and administration activities of compute, storage, data services, and network system",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "109.5447",
        "gsa_price_with_iff__a_": "111.5165",
        "gsa_price_with_iff__b_": "113.5238",
        "gsa_price_with_iff__c_": "115.5672",
        "gsa_price_with_iff__d_": "117.6474",
        "gsa_price_with_iff__e_": "119.7651",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "10.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "technical,leadership,complex,solutions",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 785,
      "price_list_id": 123
    },
    {
      "contract_number": "GS-35F-252DA",
      "labor_category": "Project Manager III",
      "hourly_rate": 109.6091,
      "source_sheet_name": "Price List",
      "source_row_number": 13,
      "raw_data": {
        "vendor_name": "ADNET SYSTEMS INC",
        "unique_catalog_item_id": "Adnet-011",
        "title": "Project Manager III",
        "description": "Responsible for all aspects of the development and implementation of assigned projects and provides a single point of contact for those projects. Takes projects from original concept through final implementation. Interfaces with all areas affected by the project including end users, computer services, and client services. Defines project scope and objectives. Develops detailed work plans, schedules, project estimates, resource plans, and status reports. Conducts project meetings and is responsible for project tracking and analysis. Ensures adherence to quality standards and reviews project deliverables. Manages the integration of vendor tasks and tracks and reviews vendor deliverables. Provides technical and analytical guidance to project team. Recommends and takes action to direct the analysis and solutions of problems.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "109.6091",
        "gsa_price_with_iff__a_": "111.5821",
        "gsa_price_with_iff__b_": "113.5906",
        "gsa_price_with_iff__c_": "115.6352",
        "gsa_price_with_iff__d_": "117.7166",
        "gsa_price_with_iff__e_": "119.8355",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "8.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "development,implementation,computer,client,services",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 785,
      "price_list_id": 123
    },
    {
      "contract_number": "GS-35F-252DA",
      "labor_category": "HPC System Administrator II",
      "hourly_rate": 63.8151,
      "source_sheet_name": "Price List",
      "source_row_number": 14,
      "raw_data": {
        "vendor_name": "ADNET SYSTEMS INC",
        "unique_catalog_item_id": "Adnet-012",
        "title": "HPC System Administrator II",
        "description": "Responsible for system administration, system monitoring and maintenance of highly complex systems, visualization systems, storage management systems, data services systems, and associated applications. Supports the development of operation procedures, trend analysis, utilization logs, and security administration.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "63.8151",
        "gsa_price_with_iff__a_": "64.9638",
        "gsa_price_with_iff__b_": "66.1332",
        "gsa_price_with_iff__c_": "67.3236",
        "gsa_price_with_iff__d_": "68.5354",
        "gsa_price_with_iff__e_": "69.769",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "5.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "system,administration,monitoring,maintenance,complex",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 785,
      "price_list_id": 123
    },
    {
      "contract_number": "GS-35F-252DA",
      "labor_category": "System Engineer IV",
      "hourly_rate": 88.2479,
      "source_sheet_name": "Price List",
      "source_row_number": 15,
      "raw_data": {
        "vendor_name": "ADNET SYSTEMS INC",
        "unique_catalog_item_id": "Adnet-013",
        "title": "System Engineer IV",
        "description": "Performs technical planning, system integration, verification and validation, cost and risk, and supportability and effectiveness analyses for total systems. Analyses of all levels of total system product to include: concept, design, fabrication, test, installation, operation, maintenance and disposal. Ability to understand systems level engineering requirements and drawings. Specialized knowledge in one technical discipline is supplemented with understanding of fundamentals in at least two other technical disciplines.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "88.2479",
        "gsa_price_with_iff__a_": "89.8364",
        "gsa_price_with_iff__b_": "91.4534",
        "gsa_price_with_iff__c_": "93.0996",
        "gsa_price_with_iff__d_": "94.7754",
        "gsa_price_with_iff__e_": "96.4813",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "12.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "system,integration,verification,validation,risk",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 785,
      "price_list_id": 123
    },
    {
      "contract_number": "GS-35F-252DA",
      "labor_category": "Programmer Analyst/Developer IV",
      "hourly_rate": 89.3756,
      "source_sheet_name": "Price List",
      "source_row_number": 16,
      "raw_data": {
        "vendor_name": "ADNET SYSTEMS INC",
        "unique_catalog_item_id": "Adnet-014",
        "title": "Programmer Analyst/Developer IV",
        "description": "Install and unit test system application components, software tuning, support system testing. Developing/updating monitoring and control software.  Provides programming support to include software development or support of system tools and utilities, graphical user interfaces, data analysis tools, and data visualization tools. Experienced in code optimization (e.g., porting, tuning, parallelization), programming languages, and development tools",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "89.3756",
        "gsa_price_with_iff__a_": "90.9843",
        "gsa_price_with_iff__b_": "92.622",
        "gsa_price_with_iff__c_": "94.2892",
        "gsa_price_with_iff__d_": "95.9865",
        "gsa_price_with_iff__e_": "97.7142",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "7.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "install,system,application,software,support",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 785,
      "price_list_id": 123
    },
    {
      "contract_number": "GS-35F-252DA",
      "labor_category": "Solution Architect Principal Leader",
      "hourly_rate": 115.5374,
      "source_sheet_name": "Price List",
      "source_row_number": 17,
      "raw_data": {
        "vendor_name": "ADNET SYSTEMS INC",
        "unique_catalog_item_id": "Adnet-015",
        "title": "Solution Architect Principal Leader",
        "description": "Provides technical leadership on formulating highly complex technical solutions and approaches to include installation and administration activities of compute, storage, data services, and network system",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "115.5374",
        "gsa_price_with_iff__a_": "117.6171",
        "gsa_price_with_iff__b_": "119.7342",
        "gsa_price_with_iff__c_": "121.8894",
        "gsa_price_with_iff__d_": "124.0834",
        "gsa_price_with_iff__e_": "126.3169",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "12.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "installation,administration,storage,data,network",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 785,
      "price_list_id": 123
    },
    {
      "contract_number": "GS-35F-252DA",
      "labor_category": "System Administrator",
      "hourly_rate": 76.0906,
      "source_sheet_name": "Price List",
      "source_row_number": 18,
      "raw_data": {
        "vendor_name": "ADNET SYSTEMS INC",
        "unique_catalog_item_id": "Adnet-016",
        "title": "System Administrator",
        "description": "Responsible for the installation, maintenance, and upgrade of computer hardware and software.  Controls user access and passwords.  Proposes and implements system enhancements that will improve the reliability and performance of the system.  Monitors system usage and performance.  A BS degree from an accredited institution of higher learning in Computer Science is a typical requirement for this skill level.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "76.0906",
        "gsa_price_with_iff__a_": "77.4602",
        "gsa_price_with_iff__b_": "78.8545",
        "gsa_price_with_iff__c_": "80.2739",
        "gsa_price_with_iff__d_": "81.7188",
        "gsa_price_with_iff__e_": "83.1898",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "6.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "installation,maintenance,upgrade,hardware,software",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 785,
      "price_list_id": 123
    },
    {
      "contract_number": "GS-35F-252DA",
      "labor_category": "Senior Systems Analyst",
      "hourly_rate": 113.7117,
      "source_sheet_name": "Price List",
      "source_row_number": 19,
      "raw_data": {
        "vendor_name": "ADNET SYSTEMS INC",
        "unique_catalog_item_id": "Adnet-017",
        "title": "Senior Systems Analyst",
        "description": "An individual with a distinguished development reputation in Operating Systems, Visualization, or Applications Analysis.  An MS degree from an accredited institution of higher learning in Computer Science or BS degree plus at least three of related work experience are typical requirements for this skill level.  An individual at this skill level should have demonstrated his/her problem solving ability in operating system development with numerous technical publications and formal technical presentations, and should have some experience in mentoring and leading others in small team environments.",
        "sin": "54151S",
        "predominant_work_site": "Contractor_Facility",
        "unit_of_measure": "HR",
        "gsa_price_with_iff____as_of_price_list_generation_date": "113.7117",
        "gsa_price_with_iff__a_": "115.7585",
        "gsa_price_with_iff__b_": "117.8421",
        "gsa_price_with_iff__c_": "119.9633",
        "gsa_price_with_iff__d_": "122.1226",
        "gsa_price_with_iff__e_": "124.3208",
        "minimum_education": "Bachelors",
        "minimum_years_of_education": "3.0",
        "security_clearance_required": "No",
        "catalog_item_type": "Commercial_Labor_Category",
        "key_words": "development,operating,systems,visualization,applications",
        "domestic__overseas_or_domestic_and_overseas": "Domestic"
      },
      "education_level": "Bachelors",
      "security_clearance": "No",
      "contractor_id": 785,
      "price_list_id": 123
    }
  ],
  "parsed_at": "2025-11-06T11:56:29.875095"
}